[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai rasul,janganlah membuat kamu sedih orang-orang yang bersegera dalam mengingkari kenabianmu dari kalangan orang-orang munafik yang mereka menampakkan keislaman secara lahiriyah, padahal hati mereka kosong darinya. Sebab sesungguhnya Aku adalah penolong bagimu atas mereka. Dan janganlah kamu disedihkan oleh cepatnya kaum yahudi mengingakri kenabianmu, sebab sesungguhnya mereka itu kaum yahudi yang suka mendengar kedustaan dan mereka menerima kedustaan-kedustaan yang dibuat-buat oleh para pendeta-pendeta mereka dan menyambut perkataan orang lain yang tidak datang kemajelismu. Orang-orang lain itu telah mengubah-ubah kalamullah setelah mereka memahaminya, dan mereka mungucapakan, ”Bila Muhammad datang kepada kalian dengan membawa Sesutu ajaran yang sesuai dengan apa yang telah kami ganti dan kami ubah dari hukum-hukum taurat, maka kerjakanlah, dan apabila dia datang dengan membawa hukum yang tidak sejalan dengannya,maka hindari untuk menerima dan mengamalkannya, ”Barangsiapa yang Allah berkehendak kesesatannya, kamu tidak akan bisa (wahai rasul) untuk menolak hal itu darinya,dan kamu tidak kuasa untuk memberi hidayah kepadanya. Dan sesunguhnya orang-orang munafik dan yahudi itu, Allah tidak menghendaki untuk membersihkan hati-hati mereka dari kotoran kekafairan. Bagi mereka kehinaan dan terbongkarnya aib mereka didunia, dan bagi mereka di akhirat mendapat siksaan besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Wahai Rasul, janganlah kamu bersedih hati melihat orang-orang yang tergesa-gesa menyatakan kekafiran mereka untuk membuatmu marah. Mereka itu dari kalangan munafik yang memperlihatkan keimanan dan menyembunyikan kekafiran dan dari kalangan Yahudi yang suka mendengarkan serta menerima kebohongan dan mengikuti jejak para pemuka mereka yang enggan datang kepadamu. Mereka mengganti firman Allah yang ada di dalam kitab suci Taurat dengan sesuatu yang sejalan dengan selera mereka. Dan mereka berkata kepada para pengikut mereka, “Jika hukum Muhammad sejalan dengan selera kalian, ikutilah ia. Jika tidak, jauhilah ia.” Barangsiapa yang dikehendaki untuk disesatkan oleh Allah dari bangsa manusia, maka kamu -wahai Rasul- tidak akan menemukan orang yang dapat melindunginya dari kesesatan dan membawanya ke jalan yang benar. Orang-orang Yahudi dan orang-orang munafik semacam itu, Allah tidak hendak membersihkan hatinya dari kekafiran. Mereka akan mendapatkan kehinaan dan kenistaan di dunia. Dan mereka akan mendapatkan azab yang sangat berat di Akhirat, yaitu siksa Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Ini merupakan seruan kepada Rasulullah untuk melarangnya bersedih hati akibat tipu daya musuh yang saling berlomba-lomba menuju kekafiran dan berjatuhan ke dalam jurang kegelapan, yaitu dari golongan orang-orang munafik yang menampakan keimanan, namun keimanan itu tidak meresap ke hati mereka, karena hati mereka masih condong kepada kekafiran; Dan juga dari golongan orang-orang Yahudi dan Nasrani yang sangat suka mendengarkan berita-berita bohong sehingga itu menjadi kebiasaan mereka, mereka jadi membenci kejujuran, dan condong kepada orang-orang yang bertabiat sama dengan mereka, mereka menjadi akrab dengan orang-orang tersebut, mentaati mereka, dan menyebarkan kabar-kabar yang mereka dapatkan dari mereka. Orang-orang Yahudi dan Nasrani itu enggan mendatangi majelismu dan mendengar perkataanmu, mereka menjauhimu karena rasa dengki dan kesombongan yang mereka miliki. Selain itu mereka suka mentakwilkan ayat-ayat Allah dengan takwil yang tidak benar, mengubah ayat-ayat itu dengan menghapusnya atau mengubahnya dengan lafadz yang lain. Sebagaimana yang mereka lakukan terhadap ayat yang menjelaskan tentang hukum rajam, mereka menyembunyikannya dan menggantinya dengan hukum cambuk dan mewarnai wajah pelakunya dengan warna hitam, namun kemudian perbuatan mereka ini terungkap. Perbuatan mereka mengubah ayat-ayat Allah sudah menjadi perkara yang biasa, bahkan itu menjadi kegemaran dan pekerjaan mereka. Hal ini mereka lakukan untuk memutar-balikan fakta dan menyebarkan kebatilan dan kebingungan. Dan Perbuatan mereka mengubah hukum rajam merupakan bentuk pengubahan ayat-ayat Allah yang telah ditetapkan dan diketahui dalam kitab mereka, yang ingin mereka sembunyikan. Mereka menyarankan agar menerima perkataanmu yang tidak menyelisihi hawa nafsu mereka, namun mereka menjauhi hukum Allah yang mengandung keadilan dan rahmat! Akan tetapi itu merupakan hikmah Allah terhadap orang-orang yang dijauhkan dari rahmat-Nya agar Dia tidak menyucikan mereka dari najis kekafiran dan kotoran kesyirikan yang telah lama mereka tenggelam di dalamnya. Maka tidak ada jalan bagi mereka untuk keluar dari jurang ini, karena mereka tidak layak untuk disucikan. Sehingga apa yang dapat kamu lakukan bagi mereka, sedangkan mereka telah terjerumus ke dalam musibah yang besar dengan pilihan mereka sendiri?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. يٰٓأَيُّهَا الرَّسُولُ لَا يَحْزُنكَ (Hari Rasul, janganlah hendaknya kamu disedihkan) Ayat ini diturunkan dalam perkara seorang Yahudi yang berzina dengan seorang wanita Yahudi; dan orang-oranag Yahudi dulunya telah mengubah hukum rajam bagi pezina dan menggantinya dengan hukuman lainnya yang lebih ringan. Lalu mereka mendatangi Rasulullah agar memutuskan perkara mereka dengan hukum yang dulu ada pada mereka, agar mereka mempunyai alasan di sisi Allah kelak; maka Rasulullah memerintahkan untuk merajam kedua pezina tersebut. Dan kisah lengkapnya terdapat dalam kitab-kitab hadist, silakan merujuknya. الَّذِينَ يُسٰرِعُونَ فِى الْكُفْرِ(oleh orang-orang yang bersegera (memperlihatkan) kekafirannya) Yang dimaksud adalah cepatnya mereka masuk kedalam kekafiran apabila mendapat kesempatan untuk itu. مِنَ الَّذِينَ قَالُوٓا۟ ءَامَنَّا بِأَفْوٰهِهِمْ(yaitu diantara orang-orang yang mengatakan dengan mulut mereka) Mereka adalah orang-orang munafik. ۛ وَمِنَ الَّذِينَ هَادُوا۟ ۛ( dan (juga) di antara orang-orang Yahudi) Yakni dan diantara orang-orang yahudi itu terdapat sekelompok orang. سَمّٰعُونَ لِلْكَذِبِ(amat suka mendengar (berita-berita) bohong) Yakni yang senantiasa menerima kebohongan pemimpin mereka yang selalu mengubah-ubah Taurat. سَمّٰعُونَ لِقَوْمٍ ءَاخَرِينَ(dan amat suka mendengar perkataan-perkataan orang lain) Yakni memperhatikan perkataan mereka. لَمْ يَأْتُوكَ ۖ( yang belum pernah datang kepadamu) Yakni belum pernah duduk dimajlis Rasulullah. Mereka adalah golongan dari orang-orang Yahudi yang tidak pernah menghadiri majlis Rasulullah karena kesombongan dan kebebalan mereka, akan tetapi menyarankan orang lain untuk menghadiri majlisnya, dan memberi mereka arahan-arahan. يُحَرِّفُونَ الْكَلِمَ مِنۢ بَعْدِ مَوَاضِعِهِۦ ۖ( mereka merubah perkataan-perkataan (Taurat) dari tempat-tempatnya) Ini adalah bagian dari ciri-ciri segolongan orang yang disebutkan tadi. Yakni mereka memindahkan wahyu dari yang telah Allah tempatkan, baik itu dari sisi lafazhnya atau dari sisi maknanya. Dan yang dimaksud adalah mereka mengubah-ubah kitab Taurat, yang termasuk didalamnya mengubah hukuman rajam bagi para pezina, mengubahnya dengan mewarnai wajah pelaku zina dengan warna hitam. يَقُولُونَ إِنْ أُوتِيتُمْ هٰذَا فَخُذُوهُ(Mereka mengatakan: “Jika diberikan ini (yang sudah di rubah-rubah oleh mereka) kepada kamu, maka terimalah) Yakni jika kalian diberi Muhammad wahyu yang telah kami ubah ini maka terima dan amalkanlah, namun jika kalian tidak diberi hal itu tetapi memberimu yang selainnya maka janganlah kalian terima dan amalkan. وَمَن يُرِدِ اللهُ فِتْنَتَهُۥ (Barangsiapa yang Allah menghendaki kesesatannya) Yakni kesesatannya. فَلَن تَمْلِكَ لَهُۥ مِنَ اللهِ شَيْـًٔا ۚ( maka sekali-kali kamu tidak akan mampu menolak sesuatupun (yang datang) daripada Allah) Maka kamu tidak akan mampu menolaknya, dan kamu tidak akan bisa memberinya hidayah. أُو۟لٰٓئِكَ الَّذِينَ لَمْ يُرِدِ اللهُ أَن يُطَهِّرَ قُلُوبَهُمْ ۚ( Mereka itu adalah orang-orang yang Allah tidak hendak mensucikan hati mereka) Yakni mensucikan dari kotoran-kotoran kekafiran dan kemunafikan. Sebagaimana hati orang-orang beriman yang bersih. لَهُمْ فِى الدُّنْيَا خِزْىٌ ۖ(Mereka beroleh kehinaan di dunia) Yakni dengan menampakkan kemunafikan orang-orang munafik, dan dengan mewajibkan membayar jizyah atas orang-orang kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Bukanlah menjadi kepentingan bagi kita untuk memberi pendegaran bagi orang tuli dan memberi penglihatan untuk orang buta, dan tida pula kepada orang yang dengan sengaja meletakkan jari-jemari mereka ditelinga, sehingga tidak dapat mendegar, atau menutupi matanya dengan kedua tangannya, sehingga matahari terbit pun tidak nampak olehnya : { وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا } \"Barangsiapa yang Allah menghendaki kesesatannya, maka sekali-kali kamu tidak akan mampu menolak sesuatupun (yang datang) daripada Allah\", tetapi yang menjadi kewajiban kita adalah menegakkan hujjah yang haq dihadapan orang yang jahil darinya, dan menerangkan jalan yang lurus kepada mereka yang menempuhnya. 2 ). Ketika engkau melihat ada kebenaran yang diabaikan, dan kesesatan yang ditinggikan maka ingatlah firman Allah : { وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا ۚ أُولَٰئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَنْ يُطَهِّرَ قُلُوبَهُمْ } \"Barangsiapa yang Allah menghendaki kesesatannya, maka sekali-kali kamu tidak akan mampu menolak sesuatupun (yang datang) daripada Allah. Mereka itu adalah orang-orang yang Allah tidak hendak mensucikan hati mereka.\" 3 ). Hati tidak akan dimasuki oleh hakikat iman jika di dalamnya terdapat sesuatu yang dapat mengotorinya, seperti sombong dan dengki, Allah berfirman : { أُولَٰئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَنْ يُطَهِّرَ قُلُوبَهُمْ } \"Mereka itu adalah orang-orang yang Allah tidak hendak mensucikan hati mereka.\" { سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَإِنْ يَرَوْا كُلَّ آيَةٍ لَا يُؤْمِنُوا بِهَا وَإِنْ يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِنْ يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلً } \"Aku akan memalingkan orang-orang yang menyombongkan dirinya di muka bumi tanpa alasan yang benar dari tanda-tanda kekuasaan-Ku. Mereka jika melihat tiap-tiap ayat(Ku), mereka tidak beriman kepadanya. Dan jika mereka melihat jalan yang membawa kepada petunjuk, mereka tidak mau menempuhnya, tetapi jika mereka melihat jalan kesesatan, mereka terus memenempuhnya\" [al-A'raf : 146]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai rasul, jangan sampai kamu bersedih atas orang-orang yang cepat-cepat melakukan hal-hal yang menyebabkan kekufuran dan terjerumus dalam kekufuran membuatmu ketika ada ada kesempatan (berbuat kufur) masuk ke dalam pikiran mereka, yaitu di orang-orang munafik yang menunjukkan keimanan mereka menggunakan lisan, namun hatinya tidak beriman dan menyembunyikan kekufuran mereka, dan di antara orang-orang Yahudi, yaitu para pendengar kebohongan pendeta mereka yang memalsukan Taurat, mereka menyimak perkataan kaum-kaum lain yang tidak menghadiri majlismu karena kesombongan dan penolakan mereka, atau mereka (para pendengar) menyampaikan kalam Taurat kepada (kaum) mereka, dan mereka itu adalah mata-mata. As-Samma’un adalah orang yang banyak mendengarkan sesuatu untuk berbuat dusta dan rekayasa. Mereka mengganti kalam Taurat atau mentakwilnya dengan cara yang salah atau bahkan menguranginya. Dan di antara kalam yang mereka ganti adalah: hukum rajam bagi pezina. Mereka mengganti kalam itu dengan hukum menghitamkan wajah yang mana mereka berkata: “Jika datang kepada kalian hukum yang bertentangan dengan Taurat dari Muhammad, yaitu hukum cambuk dan dihitamkan (wajahnya) di tempat perajaman, maka terimalah dia, namun jika hal itu tidak disampaikan kepada kalian melainkan hal lain, yaitu perajaman, maka janganlah menerimanya dan jauhi dia.” Barangsiapa yang dikehendaki Allah kesesatannya akibat penyimpangan dan kekufurannya, maka dia tidak bisa ditolong dari kesesatan itu. Mereka itu adalah orang-orang yang tersesat. Dan Allah tidak mau membersihkan hati mereka dari kekufuran dan kemunafikan sebagaimana Dia membersihkan hati orang-orang mukmin. Bagi mereka di dunia adalah kerendahan dan kehinaan dengan ditampakkannya kemunafikan, penyimpangan, dan rencana rahasia mereka dalam Taurat. Dan bagi mereka itu di akhirat adalah azab yang sangat dahsyat dalam neraka. Ayat ini turun terkait laki-laki dan perempuan Yahudi yang berzina, dan orang-orang Yahudi menjadikan hukum menghitamkan wajah sebagai ganti rajam, lalu mereka mendatangi Nabi SAW agar beliau menentukan hukum yang sudah mereka tentukan supaya mereka bisa mengklaim bahwa hukum tersebut dari sisi Allah, lalu Nabi memerintahkan untuk merajam keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Rasul, janganlah kamu dibuat sedih oleh orang-orang yang bersegera dalam kekufuran, yaitu orang-orang yang mengatakan dengan mulut mereka, “Kami telah beriman,” padahal hati mereka belum beriman, dan orang-orang Yahudi. Orang-orang yang sangat suka mendengar kebohongan dan sangat suka mendengar kaum lain yang belum pernah datang kepadamu} belum hadir di dalam majelismu karena sombong {Mereka mengubah} mereka mengubah {firman-firman} kalam-kalam Taurat {setelah berada di tempat-tempatnya. Mereka berkata, “Jika kalian diberi ini} kalian diberi sesuatu seperti kalam yang telah diubah ini dari Muhammad {maka ambillah} terimalah {Jika kalian tidak diberi ini} tidak diberi ini {maka hati-hatilah.”} untuk menerima dan mengamalkannya {Siapa yang dikehendaki Allah kesesatannya} kesesatannya {maka sekali-kali kamu tidak akan mampu menolak apa pun dari Allah. Mereka itu adalah orang-orang yang tidak akan menyucikan hatinya oleh Allah. Di dunia mereka mendapat kehinaan dan di akhirat akan mendapat azab yang sangat berat."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Karena kecintaannya kepada manusia, Rasulullah sangat bersedih terhadap orang yang menampakkan iman lalu kembali kepada kekufuran, maka Allah membimbingnya agar jangan berputus asa dan bersedih terhadap orang-orang itu, karena mereka –seperti kata pepatah- tidak bersama rombongan dagang dan tidak pula bersama rombongan perang, jika mereka hadir, mereka tidak memberi manfaat, jika mereka tidak hadir, mereka tidak dicari. Oleh karena itu, Allah menjelaskan penyebab agar tidak bersedih terhadap mereka. Dia berfirman, “Di antara orang-orang yang mengatakan dengan mulut mereka, ‘Kami beriman’ , padahal hati mereka belum beriman.” Orang-orang yang semestinya disedihi dan disayangkan, adalah orang-orang yang tergolong ke dalam orang-orang yang beriman secara lahir dan batin dan mustahil orang-orang seperti itu meninggalkan agamanya dan murtad, karena cahaya iman telah merasuk ke dalam hati, maka pemiliknya tidak akan berpaling kepada yang lain dan tidak akan mencari penggantinya. “Dan juga di antara orang-orang Yahudi, di mana mereka sangat gemar mendengar berita bohong dan mendengar perkataan-perkataan orang lain yang belum pernah datang kepadamu,” yakni mereka mengikuti dan mengekor pemimpin-pemimpin mereka yang menyandarkan urusan mereka di atas kebohongan, kesesatan, dan penyimpangan. Para pemimpin yang diikuti itu “belum pernah datang kepadamu,” akan tetapi mereka berpaling darimu dan membanggakan kebatilan yang mereka miliki, yaitu merubah perkataan dari tempatnya; maksudnya, menafsirkan perkataan dengan makna yang tidak diinginkan dan tidak dimaksudkan oleh Allah, untuk menyesatkan manusia dan menolak kebenaran. Orang-orang yang mengikuti para penyeru kepada kesesatan yang mengikuti kemustahilan, yang datang kepadamu dengan membawa semua dusta, mereka itu tidak berakal dan berkeinginan, maka biarkan saja jika mereka itu tidak mengikutimu, karena mereka tidak perlu dipedulikan. “Mereka mengatakan, ‘Jika diberikan ini kepadamu, maka terimalah ia dan jika kamu diberi yang bukan ini, maka berhati-hatilah’ .” maksudnya, ini adalah ucapan mereka pada saat mereka berhakim kepadamu. Tujuan mereka hanyalah mengikuti hawa nafsu. Sebagian berkata kepada yang lain, “Jika Muhammad menghukumimu dengan hukum yang sesuai dengan hawa nafsumu, maka terimalah hukumnya, jika tidak, maka berhati-hatilah, jangan mau mengikutinya.” Ini adalah fitnah dan pengikutan terhadap hawa nafsu. “Barangsiapa yang Allah menghendaki kesesatannya, maka sekali-kali kamu tidak akan mampu menolak sesuatu pun yang datang dari Allah.” Ini seperti FirmanNYa, \"Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk.\" (Al-Qashahsh:56). “Mereka itu adalah orang-orang di mana Allah tidak ingin menyucikan hati mereka,” dan oleh karena itulah mereka melakukan apa yang mereka lakukan. Hal ini membuktikan bahwa barangsiapa tujuannya dengan berhukum kepada hukum syar’I adalah mengikuti hawa nafsu, di mana jika berhukum berpihak kepadanya dia menerima, jika tidak maka dia marah; ini membuktikan bahwa hatinya tidak bersih. Sebagaimana halnya barangsiapa yang berhukum kepada syariat lalu dia menerima; sesuai dengan keinginannya atau tidak, maka ini membuktikan kesucian hatinya. Ini sekaligus menunjukkan bahwa kesucian hati adalah penyebab seluruh kebaikan. Ia adalah pendorong terbesar kepada ucapan dan perbuatan yang lurus dan bersih. “Mereka mendapatkan kehinaan di dunia yaitu, kerendahan dan penyesalan dan di akhirat mereka mendapatkan siksaan yang besar,” yakni neraka dan murka Allah Yang Mahaperkasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 41: Muslim meriwayatkan dari Barra' bin 'Azib ia berkata: Nabi shallallahu 'alaihi wa sallam pernah melewati orang Yahudi dalam keadaan dihitamkan dan didera, lalu Beliau memanggil mereka dan bertanya, \"Apakah seperti ini, kamu mendapatkan hukuman pezina dalam kitabmu?\" Mereka menjawab, \"Ya.\" Maka Beliau memanggil salah seorang di antara ulama mereka dan berkata, \"Aku bertanya kepadamu dengan nama Allah yang telah menurunkan kitab Taurat kepada Musa, apakah seperti ini kamu mendapatkan hukuman pezina dalam kitab kamu?\" Ia menjawab, \"Tidak.\" Jika sekiranya engkau tidak bertanya kepadaku dengan nama itu tentu aku tidak akan memberitahukan kamu, kami mendapatkan rajam di sana, akan tetapi perbuatan itu sering terjadi di kalangan orang-orang terhormat di antara kami. Oleh karena itu, jika kami mendapatkan orang yang terhormat (melakukannya), maka kami biarkan dan jika kami mendapatkan orang yang lemah (melakukannya), maka kami tegakkan had terhadapnya. Kami pun berkata, \"Marilah kita berkumpul untuk menetapkan sesuatu yang akan kita pakai dalam memberikan hukuman kepada orang terhormat dan orang yang rendah; kita tetap penghitaman dan dera sebagai ganti rajam.\" Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Ya Allah, sesungguhnya aku adalah orang pertama yang menghidupkan perintah-Mu ketika mereka mematikannya.\" Beliau pun memerintahkan dirajam, lalu dirajamlah orang tersebut. Maka Allah Azza wa Jalla menurunkan ayat, \"Wahai rasul (Muhammad)! Janganlah kamu disedihkan karena mereka berlomba-lomba dalam kekafirannya\" sampai ayat, \"Jika (hukum) ini yang diberikan kepadamu (yang sudah diubah) terimalah,\" di mana orang itu mengatakan, \"Datangilah Muhammad! Jika ia memeintahkan dihitamkan dan didera, maka terimalah hukum itu, tetapi jika dia memfatwakan kamu untuk dirajam, maka berhati-hatilah.\" Kemudian Allah menurunkan ayat, \"Barang siapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itulah orang-orang yang kafir\", \"Barang siapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itulah orang-orang yang zalim\" dan \" Barang siapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itulah orang-orang yang fasik.\" (lih. Al Maa'idah: 44, 45 dan 47). Yakni memperlihatkan kekafirannya ketika ada kesempatan. Nabi Muhammad shallallahu 'alaihi wa sallam sangat berkeinginan agar orang lain mendapatkan hidayah dan merasa sedih jika mereka tidak memperolehnya, atau terhadap orang-orang yang nampaknya telah memperoleh hidayah, namun kemudian berbalik kafir. Dalam ayat ini, Allah Subhaanahu wa Ta'aala menghibur Beliau agar tidak bersedih terhadap mereka itu, karena memang tidak ada kebaikan dalam diri mereka dan tidak ada keinginan kepada kebaikan sebagaimana hal ini diketahui dari sikap mereka seperti yang disebutkan dalam ayat di atas. Adapun orang-orang yang benar-benar beriman, di mana imannya telah masuk ke dalam hatinya, maka dirinya jauh dari kembali kepada kekafiran dan enggan mencari pengganti keimanannya. Mudah-mudahan kita digolongkan Allah ke dalamnya, amin. Maksudnya orang-orang Yahudi sangat suka mendengar perkataan-perkataan pendeta mereka yang dusta, atau sangat suka mendengar perkataan-perkataan Nabi Muhammad shallallahu 'alaihi wa sallam untuk disampaikan kepada pendeta-pendeta dan kawan-kawan mereka dengan cara yang tidak jujur. Maksudnya adalah mereka sangat suka mendengar perkataan pemimpin-pemimpin mereka yang dusta yang belum pernah bertemu dengan Nabi Muhammad shallallahu 'alaihi wa sallam karena sangat benci kepada beliau seperti orang-orang Yahudi yang tinggal di Khaibar, atau sangat suka mendengarkan perkataan-perkataan Nabi Muhammad shallallahu 'alaihi wa sallam untuk disampaikan secara tidak jujur kepada kawan-kawannya tersebut. Yakni merubah arti kata-kata, tempat atau menambah dan mengurangi. Mereka juga mena'wil ayat-ayat Allah sesuai hawa nafsu mereka untuk menyesatkan manusia dan menolak kebenaran. Kata-kata ini mereka ucapkan ketika hendak meminta keputusan kepada Nabi Muhammad shallallahu 'alaihi wa sallam, di mana hal ini menunjukkan bahwa tidak ada yang mereka inginkan selain mengikuti selera hawa nafsu, yakni jika keputusan Beliau sesuai dengan selera mereka, maka mereka menerimanya, namun jika tidak sesuai selera mereka, maka mereka menolaknya. Dalam tafsir Al Jalaalain disebutkan, bahwa dua orang yahudi Khaibar yang sudah menikah melakukan zina, lalu orang-orang Yahudi Khaibar tidak mau merajamnya, maka mereka mengirim utusan kepada Yahudi Bani Quraizhah di Madinah agar bertanya kepada Nabi shallallahu 'alaihi wa sallam tentang hukuman yang harus ditimpakan kepada pezina yang sudah menikah itu. Jika Beliau memutuskan bahwa kedua orang itu harus didera dan dihitamkan mukanya, maka mereka akan menerimanya, namun jika selain itu, misalnya rajam, maka mereka menolaknya. Ayat ini menunjukkan bahwa barang siapa yang niatnya mendatangi hukum syar'i karena ingin mencari hukum yang sesuai dengan selera hawa nafsunya, di mana jika sesuai dengan seleranya, maka ia senang, namun jika tidak sesuai ia pun kesal, maka yang demikian menunjukkan keadaan hatinya yang tidak bersih. Sebaliknya, orang yang mendatangi hukum syar'i dan ridha kepadanya, baik sesuai dengan seleranya maupun tidak, maka hal itu menunjukkan kebersihan hatinya. Ayat di atas juga menunjukkan bahwa bersihnya hati merupakan sebab terhadap semua kebaikan, dan pendorong terbesar untuk berkata dan bersikap benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 41",
    "description": "Pada ayat yang lalu diterangkan tentang hukuman bagi pencuri, sementara ayat ini menjelaskan sikap orang yahudi terhadap hukum dalam kitab taurat. Keterangan ini diawali dengan peringatan kepada rasulullah. Wahai rasul! janganlah engkau disedihkan karena mereka berlomba-lomba dalam kekafirannya dan menampakkan permusuhan, karena Allah pasti akan melindungimu. Ketahuilah bahwa mereka adalah orang-orang munafik yang mengatakan dengan mulut mereka, kami telah beriman, padahal hati mereka meyakini yang lain, dan mereka sesungguhnya belum beriman; dan waspadalah juga terhadap orang-orang yahudi yang sangat suka mendengar berita-berita bohong yang diungkapkan oleh pendeta-pendetanya, dan mereka juga sangat suka mendengar perkataan-perkataan orang lain yang belum pernah datang kepadamu yang menjelek-jelekkanmu. Mereka tidak segan-segan untuk mengubah katakata dalam kitab taurat dari makna yang sebenarnya, seperti mengubah hukum rajam bagi pezina menjadi menghitamkan wajah dan cambukan, atau diselewengkan pengertiannya. Mereka mengatakan kepada utusan yang diperintahkan untuk bertanya kepada rasulullah tentang hukum bagi pezina, jika ini, seperti yang mereka lakukan, yang diberikan kepadamu, yaitu hukum yang sudah diubah, terimalah, dan jika kamu diberi hukum yang bukan ini, maka hati-hatilah dan jangan diterima. Barang siapa dikehendaki Allah untuk dibiarkan sesat karena keangkuhan dan keras kepalanya, sedikit pun engkau tidak akan mampu menolak suatu akibat atau hukuman apa pun dari Allah untuk menolongnya. Karena pilihan pada kesesatan, maka mereka itu adalah termasuk orang-orang yang sudah tidak dikehendaki Allah untuk diberi petunjuk agar dapat menyucikan hati mereka. Di dunia mereka pasti akan mendapat kehinaan akibat sikapnya itu, dan di akhirat mereka pasti akan mendapat azab yang besar karena kesesatannya ayat ini sekali lagi menjelaskan sifat buruk orang yahudi, yaitu bahwa mereka sangat suka mendengar berita bohong, terutama yang berkaitan dengan pribadi nabi Muhammad, banyak memakan makanan yang haram, seperti menerima suap, makan riba, dan lainnya. Jika mereka, orang yahudi, datang kepadamu, wahai nabi Muhammad, untuk meminta putusan, maka berilah putusan di antara mereka sesuai dengan yang ditetapkan dalam kitab taurat atau berpalinglah dari mereka, karena sebenarnya tidak ada manfaat sedikit pun, dan jika engkau berpaling dari mereka dengan tidak melayani permintaan yang tidak akan mereka lakukan, maka mereka tidak akan membahayakanmu sedikit pun. Tetapi jika engkau memutuskan perkara mereka, maka putuskanlah dengan adil sesuai dengan hukum yang terdapat dalam taurat. Ketahuilah bahwa sesungguhnya Allah sangat menyukai orang-orang yang adil dalam memutuskan perkara."
  }
]