[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yahudi itu,menggabungkan antara mendengarkan kedustaan dan memakan harta haram. Maka jika mereka datang kepadamu untuk meminta putusan hukum, maka putuskanlah perkara di antara mereka atau tinggalkan mereka. Dan jika kamu tidak memutuskan perkara diantara mereka, makan mereka sekali-kali tidak akan sanggup untuk memudaratkanmu sedikitpun. Dan jika kamu mau memutuskan (perkara mereka), maka putuskanlah perkara diantara mereka dengan adil. Sesungguhnya Allah mencintai orang-orang yang adil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Orang-orang Yahudi itu gemar mendengarkan kebohongan dan memakan harta yang haram, seperti riba. Jika mereka memintamu -wahai Rasul- untuk menjadi hakim, maka putuskanlah perkara mereka jika berkenan, atau janganlah memutuskan perkara mereka jika enggan. Kamu boleh memilih mana yang kamu inginkan. Apabila kamu memilih untuk tidak memutuskan perkara mereka, maka mereka tidak akan dapat menimpakan mudarat apa pun kepadamu. Dan jika kamu memilih untuk memutuskan perkara mereka, maka putuskanlah secara adil, meskipun mereka adalah orang-orang yang zalim dan musuh bagimu. Sesungguhnya Allah menyukai orang-orang yang berlaku adil dalam memutuskan perkara, sekalipun orang-orang yang berperkara adalah musuh bagi hakim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Mereka terbiasa mendengarkan perkataan bohong sehingga itu menjadi tabiat mereka dan mereka adalah orang-orang yang sangat serakah sehingga terbiasa memakan harta haram yang dapat menghilangkan keberkahan. Kedua sifat ini menunjukkan keburukan akhlak mereka dan kebanggaan mereka terhadap kebatilan dan hal yang haram. Setelah Allah menyingkap perkara Mereka, kemudian Allah memberi pilihan bagi Nabi Muhammad antara kesiapan menentukan hukum bagi mereka atau enggan melakukan itu; jika beliau memilih untuk siap menentukan hukum bagi mereka Maka wajib baginya menentukan hukum sesuai dengan apa yang diturunkan Allah. Namun jika beliau enggan melakukan itu maka mereka tidak akan mampu membahayakanmu. Jika hendak menetapkan hukum maka tetapkanlah dengan keadilan karena itu sesuatu yang wajib dan dicintai. Allah mencintai orang-orang yang adil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. أَكّٰلُونَ لِلسُّحْتِ ۚ (banyak memakan yang haram) Makna (السحت) yakni harta haram. Disebut demikian karena ia menghilangkan ketaatan dan menghapus pahalanya. Pendapat lain mengatakan ia adalah uang suap. فَإِن جَآءُوكَ فَاحْكُم بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ۖ( Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka) Dalam ayat ini disebutkan dua pilihan bagi Rasulullah, antara memutuskan perkara mereka atau berpaling dari mereka. Para ulama berijma’ bahwa wajib bagi para qadhi atau hakim muslimin untuk memutuskan perkara antara orang islam dan orang kafir dzimmy apabila mereka mengangkat perkaranya kepadanya. Namun terdapat perbedaan pendapat dalam masalah perkara yang menyangkut dua orang kafir dzimmy yang mengangkat perkaranya, pendapat pertama mengatakan wajib memutuskan perkara mereka, dan pendapat kedua mengatakan boleh memutuskan perkara mereka dan boleh juga menolaknya. وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْـًٔا ۖ( jika kamu berpaling dari mereka maka mereka tidak akan memberi mudharat kepadamu sedikitpun) Yakni apabila kamu memilih untuk berpaling dari perkara mereka maka mereka tidak akan memiliki jalan sedikitpun untuk memberimu marabahaya. وَإِنْ حَكَمْتَ(Dan jika kamu memutuskan perkara mereka) Yakni jika kamu memilih untuk memutuskan perkara mereka. فَاحْكُم بَيْنَهُم بِالْقِسْطِ ۚ( maka putuskanlah (perkara itu) diantara mereka dengan adil) Yakni dengan penuh keadilan sebagaimana yang telah Allah perintahkan dan kepadamu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ سَمَّاعُونَ لِلْكَذِبِ } \"Mereka itu adalah orang-orang yang suka mendengar berita bohong,\" Jika orang yang suka mendengar berita bohong saja Allah mencelanya, maka bagaimana dengan kebohongan itu sendri ? begitu pun dengan ghiba, namimah, dan dusta; karena sesungguhnya kebohongan itu akan menimbulkan berbagai kerusakan yang amat banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Para pendengar kebohongan pendeta yang mendengarkan dengan mentah-mentah itu adalah pemakan harta haram seperti uang suap, riba, dan upah zina. Maka jika mereka meminta keputusan hukum kepadamu wahai rasul, maka kamu bisa memilih antara memutuskan perkara mereka atau berpaling dari mereka. Kemudian ayat tentang pemilihan itu dinasakh (disalin) dengan firmanNya: “(Wa anihkum bainahum bimaa anzalallah) surah Al-Maidah ayat 49”. Jika kamu tidak mau memutuskan perkara mereka, maka tidak ada jalan lain bagi mereka atas dirimu , dan mereka tidak akan bisa memberi mudharat kepadamu. Dan jika kamu memutuskan hukum diantara mereka maka putuskanlah dengan adil. Sesungguhnya Allah mencintai dan meridhai orang-orang yang berlaku adil dalam suatu keputusan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka sangat suka mendengar kebohongan} mereka memperbanyak mendengar kebohongan {dan banyak memakan makanan yang haram} memperbanyak memakan harta yang haram seperti suap {Maka jika mereka datang kepadamu, maka berilah putusan di antara mereka atau berpalinglah dari mereka. Jika kamu berpaling, mereka tidak akan membahayakanmu sedikit pun. Jika kamu memutuskan, putuskanlah dengan adil} dengan adil {Sesungguhnya Allah menyukai orang-orang yang adil} orang-orang yang adil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Mereka itu adalah orang-orang yang suka mendengar berita bohong.” Mendengar di sini adalah mendengar dan mengikuti, yakni, karena lemahnya agama dan akal, mereka mengikuti orang yang menyeru mereka kepada ucapan yang bohong. “Banyak makan harta haram,” yang mereka tarik dari orang-orang awam dan orang rendahan dalam bentuk upeti dan iuran-iuran yang tidak benar. Mereka menggabungkan antara mengikuti kebohongan dan makan harta haram. “Jika mereka datang kepadamu, maka putuskanlah perkara itu di antara mereka atau berpalinglah dari mereka,” silahkan, kamu bebas memilih, dan ayat ini tidak Mansukh. Pada saat orang-orang seperti ini berhakim kepada Nabi, maka Nabi diberi pilihan antara menetapkan hukum atau berpaling dari mereka karena tujuan mereka dalam hukum syar’I hanyalah sekedar mencari yang cocok dengan hawa nafsu. Dari sini, maka setiap peminta hukum atau peminta fatwa kepada seorang alim yang mengetahui keadaannya bahwa jika orang alim tersebut memutuskan hukum baginya dia tidak rela, maka tidak wajib menetapkan hukum dan memberi fatwa. Kalaupun hukum tetap harus diputuskan, maka wajib dengan keadilan. Oleh karena itu Allah berfirman, “Jika kamu berpaling dari mereka, maka mereka tidak akan memberi mudarat kepadamu sedikit pun. Dan jika kamu memutuskan perkara mereka, maka putuskanlah (perkara itu) di antara mereka dengan adil, sesungguhnya Allah menyukai orang-orang yang adil,.” Walaupun mereka adalah orang-orang zhalim dan musuh, hal itu jangan menghalangimu untuk memberikan keputusan yang adil di antara mereka. Dalam ayat ini terdapat keterangan tentang keutamaan berlaku adil dalam menetapkan hukum di antara manusia dan bahwa Allah mencintainya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 42: Karena kurangnya agama dan akal mereka. Seperti uang sogokan dan sebagainya. Ada yang berpendapat, bahwa perintah berpaling dari mereka dimansukh dengan ayat \"wa anihkum bainahum bimaa anzalallah\" (Al Maa'idah: 49) yang memerintahkan untuk memutuskan perkara mereka dengan apa yang diturunkan Allah jika mereka membawa masalahnya kepada kita untuk diputuskan. Namun menurut Syaikh As Sa'diy, bahwa ayat di atas tidaklah mansukh, bahkan hakim diberikan pilihan antara memberikan keputusan atau berpaling dari memutuskan masalah mereka karena tidak ada yang mereka inginkan dari hukum syara' selain mencari keputusan yang sesuai dengan hawa nafsu mereka. Oleh karena itu, jika orang yang datang kepada ulama meminta fatwa atau keputusan diketahui keadaannya, bahwa jika diberi fatwa atau diputuskan ia tidak ridha, maka tidak wajib baginya memberi fatwa dan memberi keputusan, dan jika memilih untuk memberikan keputusan, maka seorang ulama harus memutuskan dengan adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 42",
    "description": "Ayat ini sekali lagi menjelaskan sifat buruk orang yahudi, yaitu bahwa mereka sangat suka mendengar berita bohong, terutama yang berkaitan dengan pribadi nabi Muhammad, banyak memakan makanan yang haram, seperti menerima suap, makan riba, dan lainnya. Jika mereka, orang yahudi, datang kepadamu, wahai nabi Muhammad, untuk meminta putusan, maka berilah putusan di antara mereka sesuai dengan yang ditetapkan dalam kitab taurat atau berpalinglah dari mereka, karena sebenarnya tidak ada manfaat sedikit pun, dan jika engkau berpaling dari mereka dengan tidak melayani permintaan yang tidak akan mereka lakukan, maka mereka tidak akan membahayakanmu sedikit pun. Tetapi jika engkau memutuskan perkara mereka, maka putuskanlah dengan adil sesuai dengan hukum yang terdapat dalam taurat. Ketahuilah bahwa sesungguhnya Allah sangat menyukai orang-orang yang adil dalam memutuskan perkara. Dan bagaimana mungkin mereka akan mengangkatmu, wahai nabi Muhammad, menjadi hakim untuk menyelesaikan perselisihan di antara mereka, padahal mereka mempunyai taurat yang di dalamnya terdapat hukum Allah' mereka mengubah isi dan tidak menaati hukum dalam taurat. Jika mereka berbuat demikian terhadap kitab mereka sendiri, nanti mereka pasti akan berpaling dari putusanmu setelah itu' sungguh, mereka itu benar-benar bukan termasuk orang-orang yang beriman."
  }
]