[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tindakan orang-orang yahudi itu amat aneh. Mereka itu meminta putusan hukum kepadamu (wahai rasul), padahal mereka tidak beriman kepadamu dan tidak juga kepada kitabmu, meskipun kitab taurat yang mereka Imani yang ada pada sisi mereka, didalamnya terdapat hukum Allah. Kemudian mereka berpaling setelah putusanmu ketika putusan itu tidak menyenangkan mereka. Maka mereka menggabungkan antara keingkaran kepada syariat mereka dengan berpaling dari putusan hukummu. Dan bukanlah Orang-orang yang bersifat demikian itu termasuk orang-orang yang beriman kepada Allah dan kepadamu beserta putusan yang kamu putuskan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sikap mereka itu benar-benar aneh. Mereka ingkar kepadamu tetapi mereka menjadikanmu sebagai hakim dengan harapan kamu akan memberikan keputusan (hukum) yang sejalan dengan keinginan mereka. Padahal mereka mempunyai kitab suci Taurat yang mereka klaim sebagai kitab suci yang mereka yakini dan berisi ketentuan-ketentuan hukum dari Allah. Kemudian mereka akan mengabaikan keputusanmu manakala keputusan itu tidak sejalan dengan keinginan mereka. Jadi, mereka menggabungkan antara pengingkaran terhadap isi kitab suci mereka dan pengabaian terhadap keputusanmu. Tindakan mereka itu bukanlah tindakan orang-orang yang beriman. Oleh karena itu, mereka bukanlah orang-orang yang beriman kepadamu dan tidak mengakui agama yang kamu bawa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Allah mengingkari perbuatan mereka: bagaimana mereka akan meminta keputusan kepadamu Sedangkan di dalam Taurat yang mereka miliki terdapat hukum rajam yang merupakan hukum Allah namun mereka tidak mentaati kebenaran itu? Hai Muhammad, Orang-orang yang jauh dari rahmat Allah itu tidak akan beriman dengan hukum yang kamu tetapkan, dan mereka tidak mengakui kitab yang Allah turunkan kepadamu dan yang Allah turunkan kepada Musa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَكَيْفَ يُحَكِّمُونَكَ وَعِندَهُمُ التَّوْرَىٰةُ فِيهَا حُكْمُ اللهِ (Dan bagaimanakah mereka mengangkatmu menjadi hakim mereka, padahal mereka mempunyai Taurat yang didalamnya (ada) hukum Allah) Ayat ini mengandung bentuk keheranan atas perbuatan mereka menyerahkan perkara mereka kepada Rasulullah, padahal mereka tidak beriman kepadanya dan tidak pula kepada yang ia datangkan, terlebih lagi hukum yang diberikan kepada mereka sebenarnya telah ada dalam Taurat, seperti hukum rajam dan lain sebagainya. Mereka meminta agar Rasulullah memutuskan perkara mereka sebenarnya hanya ingin mendapat pembenaran dari Rasulullah atas perbuatan mereka mengubah-ubah Taurat dan pembenaran atas hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Bagaimana bisa mereka mengangkatmu sebagai hakim wahai rasulullah, sedangkan di sisi mereka sudah ada hukum Allah yang terang dalam Taurat seperti rajam dan hukum lainnya, namun mereka ingin agar keputusanmu ini sesuai dengan hawa nafsu dan penyimpangan mereka, jadi jika keputusanmu itu tidak sesuai dengan hawa nafsu mereka, niscaya mereka akan berpaling dari keputusanmu. Dan sebenarnya mereka itu tidak beriman dengan risalahmu dan kitab mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagaimana mereka meminta keputusan darimu, sedangkan mereka mempunyai Taurat yang di dalamnya hukum Allah, kemudian mereka berpaling} mereka berpaling dari putusanmu {setelah itu} setelah putusanmu {Mereka benar-benar bukanlah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Kemudian Allah berfirman heran terhadap mereka, “Dan bagaimanakah mereka mengangkatmu menjadi hakim mereka, padahal mereka mempunyai Taurat yang di dalamnya (ada) hukum Allah, kemudian mereka berpaling sesudah itu (dari putusanmu)? Dan mereka sungguh-sungguh bukan orang yang beriman.” Seandainya mereka itu beriman, melakukan apa yang menjadi konsekuensi dan tuntutan iman, niscaya mereka tidak akan berpaling dari hukum Allah yang ada dalam Taurat yang mereka miliki kecuali mungkin mereka mendapatkan sesuatu padamu yang sesuai dengan hawa nafsu mereka. Dan manakala kamu menghukum mereka dengan hukum Allah yang cocok dengan hukum mereka, mereka juga tidak mau, justru mereka berpaling darinya dan tidak rela padanya. Allah berfirman, “Mereka itu sungguh bukan,” yaitu, orang-orang yang dengan perbuatan seperti ini, bukanlah orang-orang yang beriman. Maksudnya, ini bukan perilaku orang-orang yang beriman, mereka tidak layak menyandang iman, karena mereka menjadikan hawa nafsu sebagai tuhan dan menjadikan hukum iman mengekori hawa nafsu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 43: Seperti ayat tentang hukum rajam. Dalam hadits riwayat Muslim dari Ibnu Umar disebutkan: أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِىَ بِيَهُودِىٍّ وَيَهُودِيَّةٍ قَدْ زَنَيَا فَانْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى جَاءَ يَهُودَ فَقَالَ « مَا تَجِدُونَ فِى التَّوْرَاةِ عَلَى مَنْ زَنَى » . قَالُوا نُسَوِّدُ وُجُوهَهُمَا وَنُحَمِّلُهُمَا وَنُخَالِفُ بَيْنَ وُجُوهِهِمَا وَيُطَافُ بِهِمَا . قَالَ « فَأْتُوا بِالتَّوْرَاةِ إِنْ كُنْتُمْ صَادِقِينَ » . فَجَاءُوا بِهَا فَقَرَءُوهَا حَتَّى إِذَا مَرُّوا بِآيَةِ الرَّجْمِ وَضَعَ الْفَتَى الَّذِى يَقْرَأُ يَدَهُ عَلَى آيَةِ الرَّجْمِ وَقَرَأَ مَا بَيْنَ يَدَيْهَا وَمَا وَرَاءَهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ وَهْوَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُرْهُ فَلْيَرْفَعْ يَدَهُ فَرَفَعَهَا فَإِذَا تَحْتَهَا آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا . \"Bahwa Rasulullah shallallahu 'alaihi wa sallam pernah dihadapkan orang Yahudi laki-laki dan perempuan yang berzina, lalu Rasulullah shallallahu 'alaihi wa sallam pergi mendatangi orang-orang Yahudi dan bersabda, \"(Hukuman) apa yang kalian dapatkan dalam Taurat bagi orang yang berzina?\" Mereka menjawab, \"Kami menghitamkan mukanya dan menaruhnya di atas hewan kendaraan, menyilangkan antara kedua mukanya dan dikelilingi.\" Beliau bersabda, \"Bawalah kemari Taurat itu, jika kamu orang-orang yang benar!\" Maka mereka pun membawanya, sehingga ketika telah sampai pada ayat rajam, pemuda yang membacanya menaruh tangannya (menutupi) ayat tentang rajam, ia baca ayat sebelum dan sesudahnya. Lalu Abdullah bin Salam yang ketika itu bersama Rasulullah shallallahu 'alaihi wa sallam berkata, \"Perintahkan dia untuk mengangkat tangannya!\", ia pun mengangkat tangannya, ternyata di bawah tangannya ada ayat tentang rajam, maka Rasulullah shallallahu 'alaihi wa sallam memerintahkan keduanya dirajam.\" Karena jika mereka beriman, tentu mereka tidak akan berpaling dari hukum Allah yang ada dalam kitab mereka, dan datang kepadamu dengan harapan kamu memutuskan sesuai hawa nafsu mereka. Oleh karena itu, mereka bukanlah orang-orang yang beriman, karena mereka menjadikan hawa nafsu sebagai tuhannya dan menjadikan hukum-hukum keimanan mengikuti hawa nafsu mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 43",
    "description": "Dan bagaimana mungkin mereka akan mengangkatmu, wahai nabi Muhammad, menjadi hakim untuk menyelesaikan perselisihan di antara mereka, padahal mereka mempunyai taurat yang di dalamnya terdapat hukum Allah' mereka mengubah isi dan tidak menaati hukum dalam taurat. Jika mereka berbuat demikian terhadap kitab mereka sendiri, nanti mereka pasti akan berpaling dari putusanmu setelah itu' sungguh, mereka itu benar-benar bukan termasuk orang-orang yang beriman pada ayat yang lalu dijelaskan sikap orang yahudi terhadap taurat dan hukum yang terdapat di dalamnya. Pada ayat ini diterangkan bahwa taurat diwahyukan sebagai petunjuk bagi bani israil, tetapi sebagian hukumnya mereka tinggalkan. Penjelasan ini diawali dengan suatu ungkapan untuk meyakinkan. Sungguh, kami yang menurunkan kitab taurat kepada nabi musa; di dalamnya ada petunjuk untuk membimbing mereka ke jalan yang lurus dan cahaya yang akan menerangi jalan hidup mereka. Yang dengan kitab itu para nabi yang berserah diri kepada Allah dari bani israil telah memberi putusan atas perkara yang terjadi di antara orang yahudi, demikian juga yang diperbuat oleh para ulama dan pendeta-pendeta mereka, yang sedemikian ini sebab mereka memang diperintahkan untuk memelihara kitab-kitab Allah dengan melaksanakan hukum-hukumnya, dan mereka siap untuk menjadi saksi terhadapnya. Karena itu, wahai Muhammad, janganlah kamu takut kepada manusia, tetapi takutlah hanya kepada-ku. Dan janganlah pula kamu jual ayatayat-ku dengan harga murah dengan mengharap imbalan duniawi yang sedikit. Barang siapa tidak memutuskan hukum suatu perkara dengan apa yang diturunkan Allah, maka ketahuilah bahwa mereka itulah termasuk orang-orang kafir."
  }
]