[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah menurunkan taurat yang didalamnya terdapat bimbingan dari kesesatan dan penjelasan terhadap hukum-hukum, dan sungguh telah berhukum dengannya nabi-nabi yang patuh kepada hukum Allah dan mengimaninya dan telah memberlakukan hukum-hukum taurat itu ditengah kaum yahudi, mereka tidak keluar darinya dan tidak mengubah-ubahnya, dan juga yang memberlakukannya adalah para ahli ibadah kaum yahudi dan para ahli hukumnya yang membina manusia dengan syariat Allah. Demikian ini, dikarenakan para nabi mereka telah mempercayakan kepada mereka dalam menyampaikan taurat dan pemahaman kitabullah serta pengalamannya. Dan insan-insan Rabbani dan para rahib menjadi saksi-saksi bahwa para nabi mereka telah memutuskan perkara di tengah kaum yahudi dengan dasar kitabullah. Dan Allah berfirman kepada para ulama yahudi dan rahib-rahib mereka, ”janganlah kalian takut kepada manusia untuk melaksanakan hukumKu,sebab sesungguhnya mereka tidak berkuasa untuk memberikan manfaat dan melancarkan mudarat terhadap kalian. Akan tetapi,takutlah kepadaku, sesungguhnya Aku lah yang Maha pemberi manfaat lagi Maha pemberi mudarat, dan janganlah kalian mengambil dengan meninggalkan hukum yang aku turunkan dengan imbalan sepele. ”Dan orang-orang yang mengubah-ubah hukum Allah yang diturunkanNya di dalam kitabNya dan menyembunyikannya serta mengingkari dan memberlakukan hukum yang lain dengan meyakini halal dan bolehnya hal itu, maka mereka itu adalah orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Sesungguhnya Kami telah menurunkan kitab suci Taurat kepada Musa -‘Alaihissalām-. Di dalamnya terdapat petunjuk ke arah kebaikan dan cahaya yang dapat menerangi jalan. Kitab itu digunakan sebagai sumber hukum oleh nabi-nabi Bani Israil yang tunduk dan patuh kepada Allah. Dan juga dijadikan sebagai sumber hukum oleh para ulama dan fukaha yang mendidik manusia tatkala Allah meminta mereka untuk menjaga kitab suci-Nya dan menjadikan mereka sebagai pengawal kitab suci tersebut yang bertugas menjaganya dari perubahan dan penggantian. Mereka adalah saksi-saksi yang menyatakan bahwa kitab tersebut adalah hak. Dan mereka menjadi rujukan orang dalam setiap masalah yang terkait dengan kitab tersebut. Maka janganlah kalian takut -wahai orang-orang Yahudi- kepada manusia. Tetapi takutlah kepada-Ku saja. Dan janganlah kalian menukar hukum yang Allah turunkan kepada kallian dengan imbalan yang sedikit, seperti jabatan, kedudukan, atau kekayaan. Siapa yang tidak mau menjadikan wahyu Allah sebagai sumber hukum seraya menghalalkan tindakan itu, atau memprioritaskan sumber hukum lain, atau menganggapnya sama dengan yang lain, mereka itu adalah orang-orang kafir sejati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Setelah membahas tentang kitab Taurat yang mereka pegang yang telah ternodai oleh pengubahan, dan penyembunyian hukum-hukum dan ayat-ayat-Nya setelah mereka tinggalkan, maka dalam ayat ini membahas tentang hakikat kitab Taurat, penurunannya, kandungannya, dan faidah-faidahnya. Taurat adalah wahyu dari Allah yang diturunkan dari sisi-Nya yang mengandung petunjuk dan cahaya, sebagai hidayah bagi manusia. Taurat bagaikan pohon rindang yang berbuah lebat, yang dipakai berteduh oleh para nabi yang taat kepada perintah-perintah Allah dan ridha terhadap hukum-hukum-Nya. Taurat adalah aturan dan jalan yang terang bagi mereka, dan ia adalah landasan hukum yang dipakai oleh para nabi yang memiliki ilmu yang bermanfaat dan amal yang shalih, dan para pendeta yang memiliki ilmu yang mendalam. Mereka adalah para penjaga amanat dan para saksi bagi kitab Allah. Mengapa orang-orang Yahudi pada generasi setelahnya tidak menjadikan mereka sebagai teladan dan panutan; sehingga mereka tidak lagi khawatir dalam menghadapi orang yang mencela, dan tidak menukar hukum-hukum agama mereka dengan sesuatu yang fana, agar mereka tidak lalai terhadap ayat-ayat allah dan menukarnya dengan harga yang murah; karena baerhukum dengan selain apa yang diturunkan Allah merupakan suatu kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. إِنَّآ أَنزَلْنَا التَّوْرَىٰةَ فِيهَا هُدًى وَنُورٌ ۚ (Sesungguhnya Kami telah menurunkan Kitab Taurat di dalamnya (ada) petunjuk dan cahaya) Ayat ini merupakan penjelasan syari’at-syari’at dan pemberian kabar gembira akan datangnya Muhammad dan kewajiban mengikutinya. يَحْكُمُ بِهَا النَّبِيُّونَ(yang dengan Kitab itu diputuskan perkara orang-orang Yahudi oleh nabi-nabi) Yakni para nabi dari bani Israil. الَّذِينَ أَسْلَمُوا۟( yang menyerah diri kepada Allah) Ini adalah sifat terpuji dari para Nabi tersebut. Dalam kalimat ini terdapat celaan bagi orang-orang yahudi bahwa sebenarnya nabi-nabi mereka dahulu beragama Islam sebagaimana agama yang dianut Nabi Muhammad. Dari sini, kita dilarang mengatakan kepada seorang nabi dari nabi-nabi tersebut bahwa ia adalah Yahudi atau Nasrani, akan tetapi mereka semua adalah muslim. وَالرَّبّٰنِيُّونَ (oleh orang-orang alim mereka) Yakni para orang bertakwa yang senantiasa mengagungkan Allah. وَالْأَحْبَارُ (dan pendeta-pendeta mereka) Yakni para ulama mereka. بِمَا اسْتُحْفِظُوا۟ مِن كِتٰبِ اللهِ (disebabkan mereka diperintahkan memelihara kitab-kitab Allah) Yakni mereka diperintahkan oleh para nabi untuk menjaga Taurat dan mempelajarinya serta menjauhkannya dari pengubahan. وَكَانُوا۟ عَلَيْهِ شُهَدَآءَ ۚ (dan mereka menjadi saksi terhadapnya) Yakni terhadap kitab Allah. Yakni mereka melindungi Taurat dari pengubahan dengan pengawasan mereka. فَلَا تَخْشَوُا۟ النَّاسَ (Karena itu janganlah kamu takut kepada manusia) Yakni kepada para pemimpin orang-orang Yahudi. وَلَا تَشْتَرُوا۟ بِـَٔايٰتِى ثَمَنًا قَلِيلًا ۚ (Dan janganlah kamu menukar ayat-ayat-Ku dengan harga yang sedikit) Yakni janganlah kalian tinggalkan hukum yang telah diturunkan Allah karena takut kepada seseorang, atau kerena mengharapkan maslahat atau uang suap. وَمَن لَّمْ يَحْكُم بِمَآ أَنزَلَ اللهُ فَأُو۟لٰٓئِكَ هُمُ الْكٰفِرُونَ (Barangsiapa yang tidak memutuskan menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang kafir) Yakni mereka termasuk orang-orang yang kafir apabila mereka melakukannya. Ayat ini berlaku bagi setiap hakim yang memutuskan perkara dengan selain yang disyari’atkan Allah sedangkan ia mengetahuinya. Pendapat lain mengatakan ayat ini ditujukan bagi hakim yang memutuskan perkara dengan selain yang disyari’atkan Allah karena meremehkan, atau menganggap itu dibolehkan, atau karena keingkarannya dan bukan karena mengharapkan harta suap atau takut pada sesuatu. Ibnu ‘Abbas berkata: barangsiapa yang mengingkari wajibnya memutuskan perkara dengan apa yang diturunkan Allah maka ia telah kafir, barangsiapa yang mengakui hukum tersebut namun tidak memakainya untuk memutuskan perkara maka ia orang yang zalim dan fasik. Ia juga berkata: kakafiran ini bukan kekafiran yang mengeluarkan seseorang dari agama, namun kekafiran yang berada dibawah tingkat kekafiran yang sesungguhnya, dan kezaliman dibawah tingkat kezaliman yang sesungguhnya, dan kefasikan dibawah tingkat kefasikan yang sesungguhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Sesungguhnya Kami menurunkan Taurat kepada Musa yang di dalamnya terdapat petunjuk dan cahaya dengan memberi keterangan tentang syariat dan membimbing menuju kebahagiaan dunia dan akhirat. Para Nabi bani Israil seperti Musa dan nabi setelahnya, serta orang-orang yang tunduk kepada perintah-perintah Allah SWT memutuskan hukum bagi orang Yahudi menggunakan Taurat. Begitu juga orang-orang alim yaitu ahli wara’ dan ahli hikmah, dan para pendeta, yaitu ulama’ Yahudi, yang mana Allah menjadikan mereka sebagai penjaga Taurat dan mengamalkan isinya. Mereka mengawasi Taurat dan memeliharanya dari tindakan penggantian (isi Taurat). Maka janganlah takut terhadap manusia wahai ulama’ Yahudi, namun takutlah kepadaKu, dan Jangan sampai kalian tidak mengamalkan ayat-ayatKu yang terkandung dalam Taurat, supaya kalian bisa menggantinya dengan ganti yang hina dan fana berupa kenikmatan dunia sebagai ganti merahasiakan ayat tersebut. Dan barangsiapa tidak memutuskan hukum sesuatu apa yang diturunkan oleh Allah dan memutuskannya dengan hukum lainnya, maka mereka itu adalah orang-orang kafir. Hal itu ditujukan kepada setiap orang yang diberi amanat untuk memberi keputusan. Ayat ini turun terkait kisah lelaki dan wanita Yahudi yang berzina. Keduanya datang kepada Nabi SAW dengan maksud meminta keringanan (hukum), lalu Nabi bertanya kepada mereka tentang hukum zina dalam Taurat, lalu mereka menjawab: “Ditahmim (dihitamkan wajahnya) dan dicambuk serta ditajbih, yaitu pezina laki-laki dan wanita diarak keliling di atas keledai dalam posisi terbalik” Kemudian mereka mengakui adanya hukuman rajam, lalu Nabi memutuskan hukuman rajam dan memerintahkan hukuman itu atas keduanya, lalu mereka berdua dirajam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menurunkan Taurat. Di dalamnya ada petunjuk dan cahaya. Dengan itu para nabi yang berserah diri} tunduk kepada perintah Allah {memberi putusan atas perkara orang Yahudi} orang-orang Yahudi {Demikian pula ulama’} ulama’ juga menentukan putusan dengan itu {dan para ahli} orang-orang berilmu {sebab mereka diperintahkan untuk menjaga} diperintahkan {kitab Allah dan mereka merupakan saksi-saksi terhadapnya. Maka janganlah takut kepada manusia, takutlah kepadaKu. Janganlah kalian memperjual-belikan} menukar {ayat-ayatKu dengan harga yang murah. Siapa yang tidak memutuskan menurut ketentuan yang diturunkan Allah, maka mereka itulah orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Sesungguhnya Kami telah menurunkan Taurat,” kepada Musa. “Di dalamnya terdapat petunjuk” kepada iman dan kebenaran dan melindungi mereka dari kesesatan. “Dan cahaya,” yang menerangi gelapnya kebodohan, kebingungan, kebimbangan, syubhat dan syahwat; sebagaimana Firman Allah, \"Dan sesungguhnya telah Kami berikan kepada Musa dan Harun Kitab Taurat dan penerangan serta pengajaran bagi orang-orang yang bertakwa.\" (Al-Anbiya:48). “Yang dengan kitab itu diputuskan” perkara-perkara dan persoalan-persoalan di antara orang-orang oleh “para nabi yang menyerahkan diri” kepada Allah dan tunduk kepada perintah-perintahNya, yang keislaman mereka lebih agung daripada keislaman selain mereka. Mereka adalah hamba-hamba Allah terpilih. Jika mereka, para nabi yang mulia, para pemimpin yang terhormat telah meneladani Taurat, bermakmum dan berjalan di belakangnya, lalu apa yang menghalangi orang-orang Yahudi yang rendah itu untuk mengikutinya? Apa yang mendorong mereka mencampakkan kewajiban iman kepada Muhammad yang merupakan kandungan termulianya di mana amal lahir dan batin tidak diterima kecuali dengan iman itu ? apakah dalam hal ini mereka mempunyai iman? Benar, mereka mempunyai iman yang mana kegemaran mereka adalah penyelewengan terhadap kalamullah, penegakkan kepemimpinan dan kedudukan mereka di antara manusia dan mengeruk keuntungan dari menyembunyikan kebenaran dan menonjolkan kebatilan. Mereka itulah para pemimpin kesesatan yang menyeru ke api neraka. Dan FirmanNya, “Dan oleh orang-orang alim dan pendeta-pendeta mereka.” Maksudnya, begitu pula Taurat digunakan sebagai sumber hukum di antara orang-orang Yahudi oleh para pemuka agama yang Rabbaniyyin, yakni para ulama yang beramal dan mengajarkan, yang mendidik manusia dengan didikan terbaik, dan membimbing mereka dengan bimbingan para nabi yang penuh kasih dan para pendeta mereka yaitu para ulama besar yang didengar ucapannya diikuti jejaknya, dan mereka memiliki ucapan yang dipercaya di antara umat mereka. Hukum yang mereka keluarkan itu yang sesuai dengan kebenaran “disebabkan mereka diperintahkan memelihara kitab-kitab Allah dan mereka menjadi saksi terhadapnya,” maksudnya, karena Allah meminta mereka untuk menjaga kitabNya, menjadikan mereka orang-orang yang dipercaya atasnya dan ia adalah amanat atas mereka, maka Allah mengharuskan mereka menjaganya dari penambahan, pengurangan, dan penyembunyian, mengajarkannya kepada yang tidak mengetahui, dan mereka adalah saksi-saksi terhadapnya. Mereka adalah rujukan padanya dan pada apa yang kurang dimengerti oleh manusia. Allah telah membebankan kepada para ulama apa yang tidak dibebankan kepada orang-orang bodoh, maka mereka harus menunaikan kewajiban yang disematkan di pundak mereka. Hendaknya mereka tidak mengikuti orang-orang bodoh dengan memilih sikap malas dan ogah-ogahan. Hendaknya mereka tidak membatasi diri hanya pada ibadah-ibadah personal berupa berbagai macam dzikir, shalat, zakat, haji, puasa, dan ibadah-ibadah lain yang jika dilakukan oleh selain ulama, maka mereka selamat. Adapun para ulama, maka sebagaimana mereka dituntut untuk melakukan apa yang menjadi kewajiban atas diri mereka, mereka juga dituntut untuk mengajar manusia, menyampaikan perkara-perkara agama yang mereka butuhkan khususnya masalah-masalah dasar yang sering terjadi, dan hendaknya mereka tidak takut kepada manusia, akan tetapi takut kepada Tuhan mereka. Oleh karena itu Dia berfirman, “Janganlah kamu takut kepada manusia tetapi takutlah kepadaKu. Dan janganlah kamu menukar ayat-ayatKu dengan harga yang sedikit,” di mana kamu menyebunyikan kebenaran dan menampakkan kebatilan demi harta dunia yang sedikit. Jika ulama selamat dari penyakit-penyakit ini, maka ia termasuk taufik dan kebahagiannya. Keinginannya adalah bersungguh-sungguh di bidang ilmu dan mengajarkan (nya). Dia menyadari bahwa Allah telah memintanya untuk menjaga ilmu dan menjadi saksi atasnya. Maka dia hanya takut kepada Tuhannya. Ketakutan dan kekhawatirannya kepada manusia tidak menghalanginya melakukan apa yang harus dilakukannya. Dia tidak mendahulukan dunia di atas agama. Sebagaimana tanda celakanya ulama adalah kemalasannya menunaikan tugasnya, tidak peduli dengan apa yang diperintahkan kepadanya. Dia menyia-nyiakannya dan menelantarkannya, menjual agama dengan dunia, menerima suap dalam hukum-hukumnya, dan meminta bayaran atas fatwa-fatwanya. Dia tidak bersedia mengajar kecuali dengan bayaran dan gaji. Ulama ini telah diberi nikmat besar oleh Allah, tetapi dia mengkufurinya dan menolak bagian karuniaNya yang besar di mana selannya tidak mendapatkannya. Kami memohon kepadaMu ya Allah ilmu yang berguna dan amalan yang diterima, Limpahkan kepada kami maaf dan keselamatan dari segala cobaan wahai Allah Yang Maha Karim. “Dan barangsiapa tidak memutuskan menurut apa yang diturunkan Allah,” yakni, dari kebenaran yang jelas dan dia memutuskan berdasarkan kebatilan yang diketahuinya, karena satu tujuan yang rusak, “maka mereka itu adalah orang-orang yang kafir.” Berhukum dengan selain apa yang diturunkan Allah termasuk perbuatan orang-orang kafir dan bisa jadi ia adalah kekufuran yang mengeluarkan dari agama, hal itu jika dia meyakini kebolehan dan kehalalannya, dan bisa pula ia merupakan salah satu dosa besar dan termasuk perbuatan kekufuran di mana pelakunya berhak mendapat azab yang keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 44: Yakni petunjuk yang menunjuki manusia dari kesesatan serta cahaya yang menerangkan hukum-hukum. di mana dengan cahaya itu menjadi teranglah gelapnya kebodohan, keraguan, kebimbangan, syubhat (kesamaran) dan syahwat (hawa nafsu). Yakni para nabi dari Bani Israil, di mana mereka adalah makhluk pilihan Allah. Jika mereka (para nabi) yang menjadi pemimpin umat telah mengikuti kitab itu, lantas apa yang menghalangi orang-orang yang rendah itu untuk mengikuti imam (pemimpin) mereka. Namun mereka telah memilih pemimpin yang lain; pemimpin yang memiliki kebiasaan suka merubah firman Allah, hubburiyaasah (cinta kepada kepemimpinan dan jabatan), menyembunyikan kebenaran dan menampakkan yang batil. Mereka inilah pemimpin-pemimpin dalam kesesatan, mereka inilah yang mengajak kepada neraka, wal 'iyaadz billah. Yakni mereka dijadikan rujukan tentang kitab itu dan dijadikan rujukan dalam hal yang masih samar bagi manusia. Oleh karena itu, Allah Ta'ala telah membebani ahli ilmu dengan beban yang tidak dipikul oleh orang-orang yang jahil; mereka wajib memikul beban itu dan tidak mengikuti orang-orang jahil yang senang dengan main-main dan sikap malas, mereka pun tidak membatasi diri mereka dengan ibadah yang manfaatnya bagi diri mereka semata, seperti dzikr, shalat, zakat, haji, puasa dan sebagainya, di mana jika yang melakukannya bukan ahli ilmu niscaya cukup dan akan selamat. Adapun ahli ilmu, di samping mengerjakan ibadah tersebut, mereka dituntut untuk mengajarkan manusia dan mengingatkan mereka terhadap hal-hal yang dibutuhkan berupa masalah agama, khususnya masalah ushul (dasar-dasar) agama dan hal-hal yang biasa dikerjakan manusia serta tidak takut kepada manusia, oleh karenanya mereka tidak menyembunyikan ilmu, dan hanya takut kepada Allah Ta'ala saja. Yakni janganlah kamu wahai orang-orang Yahudi takut kepada manusia untuk menampakkan pengetahuan yang ada pada dirimu tentang sifat Nabi Muhammad shallallahu 'alaihi wa sallam. Oleh karena itu, jangan menyembunyikannya. Yakni kesenangan dunia. Ini merupakan musibah yang menimpa orang alim, jika ia dapat selamat daripadanya, maka yang demikian merupakan tanda bahwa dirinya diberi taufik dan menunjukkan kebahagiaannya, yakni perhatiannya tertuju kepada sikap sungguh-sungguh menuntut ilmu, mengajarkan ilmu serta mengetahui bahwa mereka diamanahi untuk menjaga agama Allah, memiliki rasa takut kepada Allah serta tidak takut kepada manusia dalam mengerjakan kewajibannya serta tidak mengutamakan dunia di atas agama. Sebaliknya, tanda celakanya seorang alim adalah senang dengan perkara sia-sia, tidak mengerjakan kewajibannya, tidak peduli dengan amanah yang dipikulkan kepadanya, menjual agama dengan dunia, mengambil risywah (sogok) terhadap hukum-hukum agama sehingga berani menyembunyikan yang hak, mengambil harta terhadap fatwa-fatwanya dan tidak mau mengajarkan ilmu kepada hamba-hamba Allah kecuali dengan upah. Ya Allah, sesungguhnya kami meminta kepada-Mu ilmu yang bermanfaat, amalan yang diterima serta mengaruniakan kepada kami maaf dan keselamatan dari setiap bala', kabulkanlah wahai Allah Yang Maha Mulia. Yakni kekufuran di bawah kekufuran, di mana bisa menjadi kufur akbar (mengeluarkan dari Islam) jika sampai menganggap halal berhukum dengan hukum selain Allah, atau menganggap ada hukum yang lebih baik dari hukum Allah atau menghina hukum Allah, dan bisa menjadi dosa besar jika tidak seperti itu (seperti mengakui bahwa hukum Allah yang hak, yang terbaik, dan keputusannya yang salah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 44",
    "description": "Pada ayat yang lalu dijelaskan sikap orang yahudi terhadap taurat dan hukum yang terdapat di dalamnya. Pada ayat ini diterangkan bahwa taurat diwahyukan sebagai petunjuk bagi bani israil, tetapi sebagian hukumnya mereka tinggalkan. Penjelasan ini diawali dengan suatu ungkapan untuk meyakinkan. Sungguh, kami yang menurunkan kitab taurat kepada nabi musa; di dalamnya ada petunjuk untuk membimbing mereka ke jalan yang lurus dan cahaya yang akan menerangi jalan hidup mereka. Yang dengan kitab itu para nabi yang berserah diri kepada Allah dari bani israil telah memberi putusan atas perkara yang terjadi di antara orang yahudi, demikian juga yang diperbuat oleh para ulama dan pendeta-pendeta mereka, yang sedemikian ini sebab mereka memang diperintahkan untuk memelihara kitab-kitab Allah dengan melaksanakan hukum-hukumnya, dan mereka siap untuk menjadi saksi terhadapnya. Karena itu, wahai Muhammad, janganlah kamu takut kepada manusia, tetapi takutlah hanya kepada-ku. Dan janganlah pula kamu jual ayatayat-ku dengan harga murah dengan mengharap imbalan duniawi yang sedikit. Barang siapa tidak memutuskan hukum suatu perkara dengan apa yang diturunkan Allah, maka ketahuilah bahwa mereka itulah termasuk orang-orang kafir. Di antara hukum yang terdapat dalam taurat adalah bahwa kami telah menetapkan bagi mereka di dalamnya, taurat, hukuman yang sepadan, yaitu bahwa menghilangkan nyawa dibalas dengan nyawa, melukai mata dibalas dengan melukai mata, mencederai hidung dibalas dengan hidung, memotong telinga dibalas dengan telinga, merontokkan gigi dibalas dengan gigi, dan luka-luka pun ada qisas-Nya, yakni ada balasannya yang sama. Namun demikian, barang siapa melepaskan hak untuk melakukan qisasnya, maka sikap itu akan menjadi penebus dosa baginya. Sebaliknya barang siapa tidak memutuskan perkara yang terjadi dengan saudaranya menurut apa yang diturunkan Allah, maka mereka itulah akan termasuk orang-orang yang zalim."
  }
]