[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah tetapkan atas mereka didalam taurat bahwa nyawa dibunuh sebagai balasan membunuh nyawa, mata dicongkel sebagai balasan congkelan mata, hidung diiris sebagai balasan mengiris hidung, telinga dipotong sebagai balasan memotong telinga, serta gigi dicabut sebagai balasan mencabut gigi, dan sesungguhnya diberlakukan hukum qishash pada luka-luka. Maka barangsiapa merelakan haknya dalam menuntut qishash dari orang yang berbuat zhalim (kepadanya) maka tindakan itu,menjadi penggugur dan pengahapus sebagian dosa orang yang terzhalimi. Dan barangsiapa tidak berhukum dengan apa yang Allah turunkan dalam hukum qishash dan hukum lainnya, maka mereka adalah orang-orang yang melampaui batas terhadap hukum-hukum Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kami telah membuat ketentuan hukum bagi orang-orang Yahudi di dalam kitab suci Taurat, bahwasanya siapa saja yang membunuh seseorang secara sengaja tanpa hak, ia harus dihukum mati. Siapa saja yang mencongkel mata seseorang secara sengaja, ia harus dicongkel matanya. Siapa saja yang mematahkan hidung seseorang secara sengaja, ia harus dipatahkan hidungnya. Siapa yang memotong telinga seseorang secara sengaja, ia harus dipotong telinganya. Dan siapa yang menanggalkan gigi seseorang secara sengaja, ia harus ditanggalkan giginya. Dan Kami tetapkan bagi mereka bahwa setiap orang yang melukai seseorang, ia harus dihukum dengan hukuman yang sama dengan kejahatannya. Barangsiapa yang memaafkan si pelaku kejahatan, maka kata maaf itu akan menjadi penghapus dosa-dosanya, karena ia telah memaafkan orang yang telah berbuat zalim kepadanya. Dan barangsiapa yang tidak mau menggunakan ketentuan hukum yang telah diturunkan oleh Allah dalam konteks kisas dan lain-lain, ia telah melanggar aturan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Dan yang termasuk Apa yang dimaksudkan Allah dalam Taurat adalah hukum qisas yang adil pada kasus pembunuhan dan melukai orang lain, hukum ini bertujuan untuk melindungi jiwa dan memproteksi anggota tubuh. Namun bersamaan dengan itu Allah juga mensyaratkan dan mendorong untuk mengampuni dan memberi maaf, sebagai bentuk kasih sayang dan kemudahan bagi hamba-hamba-Nya. Maka barangsiapa yang memberi maaf, maka itu akan menjadi penggugur dosa baginya, karena dia telah menghilangkan pertikaian, menjaga keselamatan jiwa dan anggota badan, dan takut jika hukum-hukum ini terlupakan. Dan barangsiapa yang tidak berhukum dengan apa yang Allah turunkan maka dia termasuk orang yang zalim terhadap dirinya sendiri dan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَكَتَبْنَا عَلَيْهِمْ فِيهَآ أَنَّ النَّفْسَ بِالنَّفْسِ (Dan Kami telah tetapkan terhadap mereka di dalamnya (At Taurat) bahwasanya jiwa (dibalas) dengan jiwa) Yakni telah Kami tetapkan atas orang-orang Yahudi didalam Taurat hukum qishash bahwa yang membunuh akan dihukum mati, baik itu orang kecil atau besar, laki-laki atau perempuan, apabila pembunuhannya disengaja dan tanpa alasan yang benar. Dan syari’at yang ditetapkan bagi umat sebelum kita apabila tercantup dalam al-qur’an maka wajib kita terapkan juga selama belum dinasakh. وَالْعَيْنَ بِالْعَيْنِ(mata dengan mata) Yakni apabila mata ditusuk atau dicongkel secara sengaja dan tanpa alasan yang benar sehingga tidak dapat disembuhkan, maka pelaku kejahatan ini harus ditusuk atau dicongkel matanya sesuai dengan apa yang ia lakukan. وَالْأَنفَ بِالْأَنفِ(hidung dengan hidung) Apabila hidung itu dipotong seluruhnya maka pelaku tersebut harus dipotong hidungnya seluruhnya, begitu juga telinga. وَالسِّنَّ بِالسِّنِّ (gigi dengan gigi) Begitu juga gigi apabila dicabut atau dipecahkan maka pelakunya dibalas dengan hal yang serupa, seperti gigi seri, gigi taring, gigi geraham, dan gigi seri rateral yang dirusak harus dibalas dengan gigi yang semisalnya tanpa ada perbedaan. Aggota badan yang diambil untuk qishash harus setara dengan kejahatannya, seperti telinga kanan dibalas dengan telinga kanan dan gigi taring dengan gigi taring. وَالْجُرُوحَ قِصَاصٌ ۚ (dan luka luka (pun) ada qishaashnya) Maka luka yang diakibatkan pelaku harus dibalas dengan luka yang setara, hal ini dilakukan apabila tidak ditakutkan kematian jika qishash ini ditegakkan, dan ukuran luka tersebut diketahui dengan pasti, baik itu ukuran panjang, luas, atau kedalamannya. Para ulama fiqih telah memberi Batasan ganti rugi atas setiap luka dengan Batasan tertentu sesuai dengan hadist-hadist Rasulullah, ganti rugi ini diambil jika kejahatan yang dilakukan tanpa disengaja atau jika korban memaafkan pelaku untuk tidak ditegakkan qishash atasnya dengan meminta ganti rugi (diyat). فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٌ لَّهُۥ ۚ( Barangsiapa yang melepaskan (hak qishaash)nya, maka melepaskan hak itu (menjadi) penebus dosa baginya) Yakni dengan memaafkan si pelaku, maka hal itu menjadi kafarat yang menghapus dosa-dosanya. وَمَن لَّمْ يَحْكُم بِمَآ أَنزَلَ اللهُ فَأُو۟لٰٓئِكَ هُمُ الظّٰلِمُونَ(Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang zalim) Yakni kezaliman yang mereka lakukan ini adalah kezaliman yang besar, karena mereka telah meninggalkan dan berpaling dari penerapan syari’at Allah dan menggantinya dengan syari’at manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Dan Kami wajibkan atas kaum Yahudi dalam kitab Taurat hukum qishash yang mana membunuh jiwa dibalas dengan jiwa seperti mata dibalas dengan mata, menyakiti hidung dibalas dengan hidung, memotong telinga dibalas dengan telinga, dan memotong lidah dibalas dengan lidah, serta qishash terkait luka yaitu dengan mengqishash pelaku sesuatu tindakannya jika hal itu mungkin dilakukan, Dan jika tidak maka diputuskan dengan hukum penggantinya. Maka barangsiapa memaafkan pelaku yang harusnya diqishash, maka pemaafan itu menjadi pelebur dosa baginya dan Allah akan melebur dosa-dosanya. Dan barangsiapa tidak memutuskan hukum sesuai apa yang diturunkan Allah dalam hal qishash dan lainnya, maka mereka itu melakukan kezaliman yang besar terhadap dirinya sendiri, sehingga mereka akan disiksa di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menetapkan bagi mereka di dalamnya} Kami telah mewajibkan atas orang-orangYahudi di dalam Taurat {bahwa nyawa dengan nyawa} nyawa pembunuh dibalas dengan nyawa yang terbunuh jika dia membunuhnya tanpa alasan yang benar {mata dengan mata} mata dicongkel sebagai balasan mata lain, ketika mata itu dicongkel tanpa alasan yang benar {hidung dengan hidung} hidung dipotong sebagai balasan hidung yang dipotong tanpa alasan yang benar {telinga dengan telinga} telinga dipotong sebagai balasan telinga yang dipotong dengan zalim {gigi dengan gigi} gihi dicabut sebagai balasan gigi yang dicabut tanpa alasan yang benar {dan luka-luka ada qisasnya} memiliki balasan yang sama {Siapa saja yang melepaskan} hak qisasnya {maka itu penebus dosa baginya} bagi orang dibebaskan {Siapa yang tidak memutuskan menurut ketentuan yang diturunkan Allah, maka mereka itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Hukum-hukum ini termasuk di antara hukum-hukum yang ada di dalam Taurat di mana para nabi, para ulama Rabbani, dan para pendeta menjadikannya sebagai hukum di kalangan orang-orang Yahudi. Allah telah mewajibkan bagi mereka bahwa satu jiwa diqishahsh karena membunuh jiwa yang lain, dengan syarat kesengajaan dan kesetaraan, mata dicongkel dengan mata, telinga dipotong dengan telinga, gigi dicabut dengan gigi. Sama halnya dengan anggota badan yang lain yang mungkin dilakukan qishash padanya tanpa kezhaliman. “Dan luka-luka pun ada qishashnya.” Qishash adalah perlakuan kepada pelaku kejahatan sebagaimana dia melakukannya kepada korban. Barangsiapa melukai orang lain secara sengaja, maka pelakunya dilukai sebagai qishash seperti luka pada korban dari segi tempat, panjang, lebar dan kedalaman. Dan hendaknya diketahui bahwa syariat umat sebelum kita adalah syariat bagi kita juga selama tidak bertentangan dengan syariat kita. “Barangsiapa melepaskan hak qishashnya,” pada nyawa dan yang lebih rendah darinya, pada anggota badan dan luka, yaitu dengan memaafkan pelaku kejahatan dan hak telah ditetapkan untuknya, “maka ia menjadi penebus dosa baginya,” artinya, penebus bagi pelaku kejahatan, karena Bani Adam telah memaafkan haknya, maka Allah pun lebih berhak dan lebih layak untuk memaafkan. Ia juga pelebur dosa bagi pemberi maaf. Sebagaimana dia telah memaafkan orang yang telah berbuat jahat kepadanya atau orang yang berkaitan dengannya, maka Allah pun memaafkan kesalahan dan kekeliruannya. “Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang zhalim.” Ibnu Abbas berkata, “Kekufuran di bawah kekufuran, kezhaliman di bawah kezhaliman, kefasikan di bawah kefasikan, ia menjadi kezhaliman besar jika disertai penghalalan, dan dosa besar dan berat jika dilakukan tanpa menghalalkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 45: Syari'at qisas juga berlaku dalam syari'at Nabi Muhammad shallallahu 'alaihi wa sallam. Jika dibunuh. Jika dicolok. Jika dipotong. Jika dicabut. Demikian juga anggota badan lainnya yang bisa dilakukan qisas tanpa melebihi batas. Oleh karena itu, barang siapa yang melukai orang lain secara sengaja, maka dilakukan qisas terhadap yang melukai tersebut sesuai perbuatannya melukai, baik batasnya, tempatnya, panjangnya, dan kedalamannya. Perlu diketahui, bahwa syari'at sebelum kita merupakan syari'at bagi kita selama tidak ada dalam syari'at kita yang menyelisihinya. Baik dalam hal jiwa, anggota badan maupun luka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 45",
    "description": "Di antara hukum yang terdapat dalam taurat adalah bahwa kami telah menetapkan bagi mereka di dalamnya, taurat, hukuman yang sepadan, yaitu bahwa menghilangkan nyawa dibalas dengan nyawa, melukai mata dibalas dengan melukai mata, mencederai hidung dibalas dengan hidung, memotong telinga dibalas dengan telinga, merontokkan gigi dibalas dengan gigi, dan luka-luka pun ada qisas-Nya, yakni ada balasannya yang sama. Namun demikian, barang siapa melepaskan hak untuk melakukan qisasnya, maka sikap itu akan menjadi penebus dosa baginya. Sebaliknya barang siapa tidak memutuskan perkara yang terjadi dengan saudaranya menurut apa yang diturunkan Allah, maka mereka itulah akan termasuk orang-orang yang zalim. Dan setelah masa para nabi penganut dan pelaksana isi taurat berakhir, kami teruskan jejak mereka dengan mengutus isa putra maryam yang mendapat amanah untuk membenarkan kitab yang sebelumnya, yaitu taurat dan mengajarkan serta melaksanakan ajaran-ajarannya. Dan, selain itu, kami menurunkan pula injil kepadanya sebagai penyempurna taurat, yang di dalamnya terdapat petunjuk dan cahaya, dan juga berfungsi untuk membenarkan kitab yang sebelumnya yaitu taurat, dan injil ini juga berisi ajaran sebagai petunjuk serta pengajaran untuk orang-orang yang bertakwa, yaitu yang selalu menaati perintah-Nya dan menjauhi larangan-Nya."
  }
]