[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami iringkan nabi-nabi Bani israil dengan Isa putra Maryam, yang beriman terhadap hukum-hukum di dalam taurat, mengamalkan hukum-hukum yang ada di dalamnya yang tidak dihapus oleh kitabnya (injil). Dan kami turunkan kepadanya kitab injil sebagai petunjuk menuju kebenaran, lagi menjelaskan hal-hal yang tidak diketahui oleh manusia terkait hukum-hukum Allah, juga menjadi saksi atas kebenaran taurat beserta hukum-hukum yang dikandungnya. dan sesungguhnya kami telah menjadikannya sebagai penjelasan bagi orang-orang yang takut kepada Allah, dan penghalang bagi mereka dari berbuat perkara-perkara haram."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan Kami ikutkan pada jejak nabi-nabi Bani Israil dengan Isa putra Maryam yang beriman kepada apa yang tercantum di dalam kitab suci Taurat dan menjadikannya sebagai sumber hukum. Dan Kami berikan kepadanya kitab suci Injil yang berisi petunjuk ke jalan yang benar dan berisi penjelasan yang dapat melenyapkan hujah yang berupa syubhat-syubhat dan mengatasi masalah-masalah hukum. kitab suci Injil ini sesuai dengan kitab suci Taurat yang diturunkan sebelumnya kecuali sedikit masalah hukum yang diubahnya. Dan Kami jadikan kitab suci Injil sebagai petunjuk ke jalan yang benar dan pencegah dari perbuatan yang diharamkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Nabi Isa menempuh jalan para nabi dan pendeta-pendeta yang memiliki ilmu mendalam dalam membenarkan kitab Taurat dan menyuruh untuk melaksanakan hukum-hukumnya. Dan Allah telah memberinya kitab Injil yang merupakan petunjuk yang agung dan cahaya yang terang. dayn hukum-hukum yang ada di dalamnya sesuai dengan apa yang ada dalam Taurat. Injil adalah petunjuk dan tuntunan bagi orang-orang yang bertakwa. Allah mengulangi penyebutan sifat Injil sebagai petunjuk agar menjadi penegasan sifat tersebut dan menjelaskan bahwa Injil adalah petunjuk bagi seluruh Bani Israel dan petunjuk khusus bagi orang-orang bertaqwa yang mampu mengambil manfaat darinya. Dan seluruh firman Allah saling membenarkan satu sama lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَقَفَّيْنَا عَلَىٰٓ ءَاثٰرِهِم بِعِيسَى ابْنِ مَرْيَمَ (Dan Kami iringkan jejak mereka (nabi nabi Bani Israil) dengan Isa putera Maryam) Yakni Kami jadikan Isa putra Maryam mengikuti jejak para Nabi dari bani Israil yang beriman dan berislam. وَءَاتَيْنٰهُ الْإِنجِيلَ فِيهِ هُدًى وَنُورٌ (Dan Kami telah memberikan kepadanya Kitab Injil sedang didalamnya (ada) petunjuk dan dan cahaya) Yakni Aku telah memberikan kepada Isa kitab Injil yang mengandung petunjuk dan cahaya. وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَىٰةِ (dan membenarkan kitab yang sebelumnya, yaitu Kitab Taurat) Yakni yang sesuai dan mengakui kebenaran yang ada dalam Taurat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kemudian Kami mengutus Isa sebagai rasul yang mengikuti jejak-jejak nabi Bani Israil dan membenarkan Taurat yang diturunkan sebelumnya. Dan Kami turunkan kepadanya kitab Injil yang mengandung hidayah dari kesesatan, cahaya dari ketidaktahuan, dan pembenar bagi kitab yang datang sebelumnya yaitu kitab Taurat dan hukum-hukumnya, serta petunjuk dan pelajaran bagi orang-orang yang bertakwa kepada Allah dan azabNya. Dan orang yang bertakwa itu dicirikan dengan dzikir karena merekalah yang dimaksud dalam ilmu Allah. sekalipun seluruhnya itu dipanggil dan diberi pelajaran. Al Huda adalah tuntunan untuk mengesakan Allah dan mematuhi hukum-hukumNya dan An-Nur adalah sesuatu yang digunakan sebagai penerangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami meneruskan} Kami mengikuti {jejak mereka} jejak para nabi Bani Israil {dengan Isa putra Maryam yang membenarkan apa yang sebelumnya, yaitu Taurat. Kami menurunkan Injil kepadanya, di dalamnya terdapat petunjuk dan cahaya dan untuk membenarkan apa yang sebelumnya, yaitu Taurat; dan menjadi petunjuk serta pengajaran bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Yaknin setelah Kami mengutus para Nabi dan Rasul yang memutuskan hukum berdasarkan Taurat, Kami mengutus sesudah mereka hamba dan Rasul Kami, Isa putra Maryam Ruhullah dan kalimatNya yang disampaikannya kepada Maryam. Allah mengutusnya dengan membenarkan Taurat yang diturunkan sebelumnya, dia adalah saksi kebenaran dan kejujuran bagi Musa dana pa yang ada di bawahnya, pendukung dakwahnya, berhukum kepada syariatnya, menyetujuinya dalam banyak perkara-perkara syari. Dan dalam beberapa hukum bisa jadi Isa lebih ringan sebagaimana Allah berfirman tentangnya bahwa dia berkata kepada Bani Israil. \"dan untuk menghalalkan bagimu sebagian yang telah diharamkan untukmu\" (Ali Imran:50). “Dan Kami telah memberikan kitab injil kepadanya,” kitab yang agung penyempurna bagi Taurat. “Di dalamnya terdapat petunjuk dan cahaya,” petunjuk kepada jalan yang lurus dan menjelaskan kebenaran dari kebatilan. “Dan membenarkan kitab yang sebelumnya yaitu kitab Taurat,” dengan mendukunya, menjadi saksi kebenarannya, dan menyetujuinya. “Dan menjadi petunjuk dan pengajaran bagi orang-orang yang bertakwa,” karena merekalah orang-orang yang mengambil manfaat dari petunjuk, mengambil pelajaran dari nasihat, dan tidak melakukan apa-apa yang tidak layak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 46: Allah mengutus Nabi Isa 'alaihis salam membenarkan kitab yang diturunkan sebelumnya, yaitu Taurat, oleh karena itu dia menjadi saksi terhadap kebenaran Nabi Musa dan Taurat yang dibawanya, menguatkan dakwahnya, menggunakan syari'atnya dan sesuai dengan syari'at Nabi Musa 'alaihis salam dalam banyak hal, hanya saja syari'at Nabi Isa 'alaihis salam lebih ringan dalam sebagian hukum, di mana Beliau (Nabi Isa) menghalalkan untuk Bani Israil sebagian yang diharamkan. Sebagai kitab yang menyempurnakan Taurat. Yang menerangkan mana yang benar dan mana yang salah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 46",
    "description": "Dan setelah masa para nabi penganut dan pelaksana isi taurat berakhir, kami teruskan jejak mereka dengan mengutus isa putra maryam yang mendapat amanah untuk membenarkan kitab yang sebelumnya, yaitu taurat dan mengajarkan serta melaksanakan ajaran-ajarannya. Dan, selain itu, kami menurunkan pula injil kepadanya sebagai penyempurna taurat, yang di dalamnya terdapat petunjuk dan cahaya, dan juga berfungsi untuk membenarkan kitab yang sebelumnya yaitu taurat, dan injil ini juga berisi ajaran sebagai petunjuk serta pengajaran untuk orang-orang yang bertakwa, yaitu yang selalu menaati perintah-Nya dan menjauhi larangan-Nya. Dan hendaknya pengikut injil, yaitu mereka yang meyakini dan mengikuti nabi isa, memutuskan semua perkara dalam kehidupan mereka menurut apa yang telah diturunkan Allah di dalamnya. Barang siapa dengan sengaja tidak memutuskan perkara yang mereka hadapi menurut apa yang diturunkan Allah, maka sesungguhnya mereka itulah yang disebut sebagai orang-orang fasik, yaitu yang beriman pada Allah dan tuntunan-Nya, tetapi tidak melaksanakan ajaran tersebut."
  }
]