[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hendaklah berhukum para pengikut injil yang utus kepada mereka Isa dengan hukum-hukum yang diturunkan Allah di dalamnya. Dan barangsiapa tidak berhukum dengan syariat yang diturunkan oleh Allah, maka mereka itu adalah orang-orang yang keluar dari perintahNya lagi durhaka kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Seharusnya orang-orang Nasrani beriman kepada apa yang Allah turunkan di dalam kitab suci Injil. Dan hendaklah mereka menjadikannya sebagai sumber hukum sebelum diutusnya Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- kepada mereka. Barangsiapa yang tidak mau menetapkan hukum berdasarkan kitab suci yang Allah turunkan, mereka itu adalah orang-orang yang tidak taat kepada Allah, meninggalkan kebenaran dan cenderung kepada kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Allah juga memerintahkan orang-orang Nasrani untuk berhukum dengan Injil yang sesuai dengan yang Allah turunkan kepada Isa, bukan injil-injil yang telah diubah yang diimani oleh orang-orang Nasrani sekarang, karena injil-injil itu telah bercampur antara kebenaran dan kebatilan, dan syariat dan hawa nafsu. Maka hendaklah orang-orang Nasrani mengamalkan Injil yang masih murni seperti ketika diturunkan Allah. Dan barangsiapa yang tidak berhukum dengan apa yang diturunkan Allah maka dia telah keluar dari ketaatan kepada-Nya dan dari sunnah-sunnah para nabi dan orang-orang Shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَلْيَحْكُمْ أَهْلُ الْإِنجِيلِ بِمَآ أَنزَلَ اللهُ فِيهِ ۚ (Dan hendaklah orang-orang pengikut Injil, memutuskan perkara menurut apa yang diturunkan Allah didalamnya) Allah memerintahkan para hakim dari kaum Nasrani untuk memutuskan perkara dengan hukum-hukum yang telah ditetapkan Allah atas mereka dalam Injil, dan agar mereka tidak meninggalkannya demi kenikmatan dunia atau takut kepada manusia, atau karena alasan-alasan lain yang mereka kemukakan. Karena Injil adalah kitab yang benar sebelum diutusnya Nabi Muhammad, namun setelah diutusnya Nabi Muhammad mereka telah diperintahkan berkali-kali untuk menjalankan apa yang diturunkan Allah kepada Nabi Muhammad dalam al-qur’an, karena al-qur’an menghapus segala hukum yang menyelisihinya yang terdapat dalam kitab-kitab sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dan hendaknya para pengikut Injil, yaitu orang Nasrani memutuskan hukum sesuai hukum yang diturunkan oleh Allah dalam Injil, karena sebelum perintah kenabian (nabi Muhammad) itu benar. Adapun setelah adanya perintah kenabian, maka mereka harus mengamalkan Al-Qur’an, karena Al-Qur’an itu menasakh (menyalin) seluruh kitab yang diturunkan sebelumnya. Dan barang siapa tidak memutuskan sesuatu sesuai apa yang diturunkan oleh Allah, maka mereka itu adalah orang-orang yang tidak taat kepada Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah pengikut Injil memutuskan menurut apa yang diturunkan Allah di dalamnya. Siapa saja yang tidak memutuskan menurut ketentuan yang diturunkan Allah, maka mereka itulah orang-orang fasik} orang yang tidak menaati Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Dan hendaknya orang-orang pengikut Injil memutuskan perkara menurut apa yang diturunkan oleh Allah di dalamnya,” yakni mereka harus berpegang kepada kitab mereka, mereka tidak boleh berpaling darinya. “Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang fasik.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 47: Pengikut-pengikut Injil itu diwajibkan memutuskan perkara menurut apa yang diturunkan Allah di dalam Injil itu, sampai pada masa diturunkan Al Quran. Orang yang tidak berhukum dengan hukum Allah bisa menjadi kafir apabila ia menghina hukum Allah, menganggap halal berhukum dengan hukum selain Allah, menganggap bahwa hukum selain Allah lebih baik atau lebih cocok dipakai seperti orang-orang yang membuat undang-undang yang menyalahi syari’at Islam, di mana mereka tidaklah membuat undang-undang tersebut kecuali karena adanya anggapan bahwa hukum Allah tidak cocok lagi atau kurang tepat dsb. Orang yang tidak berhukum dengan hukum Allah bisa juga menjadi zalim (tidak kafir) apabila ia melakukan hal itu, namun ia yakin bahwa hukum Allah-lah yang benar, yang baik, yang cocok, hukum yang dipakainya yang salah, ia juga tidak meremehkannya. Dan bisa menjadi fasik (tidak kafir), apabila ia melakukan hal itu (yakni tidak menggunakan hukum Allah) karena ada rasa sayang kepada orang yang terkena hukuman itu atau karena diberi sogokan (risywah) namun ia tetap yakin bahwa hukum Allah-lah yang benar dan hukumnya yang salah, seperti karena si pencuri itu adalah kerabatnya dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 47",
    "description": "Dan hendaknya pengikut injil, yaitu mereka yang meyakini dan mengikuti nabi isa, memutuskan semua perkara dalam kehidupan mereka menurut apa yang telah diturunkan Allah di dalamnya. Barang siapa dengan sengaja tidak memutuskan perkara yang mereka hadapi menurut apa yang diturunkan Allah, maka sesungguhnya mereka itulah yang disebut sebagai orang-orang fasik, yaitu yang beriman pada Allah dan tuntunan-Nya, tetapi tidak melaksanakan ajaran tersebut. Pada ayat-ayat yang lalu Allah menerangkan tentang diturunkannya taurat dan injil yang mengandung petunjuk dan cahaya, serta adanya kewajiban bagi umat masa itu untuk melaksanakan ajaran-ajarannya. Dan kami selanjutnya telah pula menurunkan kitab Al-Qur'an kepadamu, Muhammad, sebagai nabi terakhir, dengan membawa kebenaran yang hakiki, yang membenarkan sebagian isi dari kitab-kitab yang diturunkan sebelumnya, yaitu taurat, zabur, dan injil, dan menjaganya dari penyimpangan atau pengubahan yang dilakukan oleh orang-orang yang mencari keuntungan diri, maka putuskanlah perkara yang mereka perselisihkan menurut ketetapan dalam kitab-kitab yang diturunkan Allah itu dan janganlah sekali-kali engkau mengikuti kemauan dan keinginan nafsu mereka dengan meninggalkan kebenaran yang telah datang kepadamu. Ketahuilah bahwasanya untuk setiap umat di antara kamu, di mana saja mereka berada, kami berikan aturan bagi mereka masing-masing dan jalan yang terang sesuai dengan keadaannya. Kalau Allah menghendaki sesuai dengan kehendak-Nya, niscaya kamu semua akan dijadikan-Nya sebagai satu umat saja, tetapi Allah berkehendak lain, yaitu ingin menguji kamu terhadap karunia dan semua nikmat yang telah diberikan-Nya kepadamu, maka sebagai jawaban dari semua rahmat yang telah dilimpahkan itu, berlomba-lombalah untuk berbuat kebajikan. Ketahuilah bahwa hanya kepada Allah saja kamu semua akan kembali, lalu pada saat itu akan diberitahukan-Nya kepadamu apa saja yang dahulu pernah kamu perselisihkan pada saat menjalani kehidupan di dunia."
  }
]