[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah menurunkan al-qur’an kepadamu (wahai rasul), dan semua yang ada didalamnya merupakan kebenaran yang mempersaksikan kebenaran kitab-kitab suci sebelumnya, dan sesungguhnya ia datang dari sisi Allah, yang membenarkan apa yang ada di dalamnya berupa kebenaran, dan yang menjelaskan adanya penyelewengan di dalamnya, dan menasakh (mengganti) sebagian syariat yang ada didalamnya. Maka putuskanlah orang-orang yang datang untuk berhukum kepadamu dari kaum Yahudi dengan apa yang Allah turunkan kepadamu di dalam al-qur’an. Dan janganlah kamu berpaling dari kebenaran yang Allah perintahkan kamu untuk melaksanakannya menuju keinginan-keinginan hawa nafsu mereka dan apa yang biasa mereka perbuat. Sesungguhnya kami telah menjadikan ajaran syariat bagi setiap umat dan cara yang jelas yang mereka amalkan. Dan seandainya Allah berkehendak, niscaya Dia menjadikan ajaran-ajaran syariat kalian hanya satu, akan tetapi Allah membeda-bedakan ajaran bagi kalian guna menguji kalian, sehingga akan tampak siapa yang taat dan siapa yang melanggar. Maka bersegeralah untuk mencari apa yang baik bagi kalian di dunia dan di akhirat dengan mengamalkan kandungan al-qur’an. Maka sesungguhnya tempat kembali kalian hanya kepada Allah, lalu Dia akan memberitahukan kepada kalian apa yang kalian perselisihkan dan memberi balasan bagi masing-masing sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. \"Dan Kami turunkan kepadamu -wahai Rasul- kitab suci Al-Qur`ān dengan kebenaran yang tidak ada keraguan dan kebimbangan sedikit pun bahwa kitab suci ini berasal dari sisi Allah. kitab suci ini membenarkan kitab-kitab suci yang diturunkan sebelumnya dan menjadi tolok ukur. Maka bila isinya sesuai dengan Al-Qur`ān adalah benar, dan yang bertentangan dengannya adalah salah. Maka berikanlah keputusan hukum kepada manusia berdasarkan kitab suci yang Allah turunkan kepadamu. Dan janganlah kamu mengikuti keinginan mereka dengan meninggalkan kebenaran yang diturunkan kepadamu yang tidak mengandung keraguan pun. Kami telah memberikan syariat berupa ketentuan hukum amaliah dan jalan yang terang bagi tiap-tiap umat yang layak untuk diikuti. Seandainya Allah berkehendak menyatukan syariat mereka, niscaya Dia telah menyatukannya. Akan tetapi Allah berkehendak memberikan syariat tertentu kepada tiap-tiap umat. Hal itu karena hendak menguji mereka semua agar terlihat siapa yang taat dan siapa yang tidak. Maka bergegaslah kalian melaksanakan kebajikan dan meninggalkan kemungkaran. Lalu hanya kepada Allah kalian akan kembali di hari Kiamat kelak. Dia akan memberitahukan kepada kalian perihal apa yang dahulu kalian perselisihkan. Dan Dia akan memberikan balasan yang setimpal dengan apa yang telah kalian perbuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Allah menurunkan Al-Qur'an sebagai kitab yang terakhir kepada penutup para nabi, sebagai lanjutan dan pembenar bagi kitab-kitab sebelumnya. Al-qur'an adalah bukti dan penguji atas kebenaran kitab-kitab sebelumnya, penjelas, penerang, pelurus, pemurni dari kebatilan dan khurafat yang telah tercampur di dalamnya, penyempurna, dan rujukan hukum-hukumnya. Allah memerintahkan untuk berhukum dengan kitabnya, mengamalkan dan mengagungkannya; dan melarang mengikuti hawa nafsu orang-orang yang tersesat. Allah telah membuat syariat bagi setiap umat ada dijadikan sebagai dasar hukum, dan jalan yang terang untuk ditempuh agar dapat meraih kebaikan dan memenuhi segala kebutuhannya. Seandainya Allah menghendaki niscaya dia hanya akan membuat satu jalan dan syariat bagi seluruh umat manusia; namun setiap manusia memiliki perbedaan pandangan dan pemikiran, yang mana itu sudah menjadi sunnatullah dan ketetapan-nya. Dan bagian dari hikmah perbedaan syariat ini adalah untuk menguji manusia, antara yang beriman dan yang ingkar, dan yang baik dan yang jahat. Maka hendaklah orang yang beriman menyibukkan diri dengan berlomba-lomba dalam kebaikan, dengan mengerjakan sesuatu yang bermanfaat bagi kehidupan dunia dan akhiratnya, tanpa sibuk bersama orang-orang sesat dan bertanya tentang perkara orang-orang yang binasa. Dan hendaklah dia tetap melangkah di jalan kebaikan dengan menjadikannya sebagai jalan menuju keridhaan Allah; karena Allah merupakan tempatnya kembali. Allah telah menyampaikan hujjah-hujjah dan penjelasan-penjelasan kepada hamba-hamba-Nya ketika di dunia, dan di akhirat kelak Dia akan memberi keputusan kepada mereka dan membedakan antara hamba-Nya yang beriman dan yang ingkar, dan dia akan membalas mereka semua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَأَنزَلْنَآ إِلَيْكَ الْكِتٰبَ بِالْحَقِّ (Dan Kami telah turunkan kepadamu Al kitab dengan membawa kebenaran) Kalimat ini ditujukan bagi Nabi Muhammad. Dan makna kitab disini adalah al-qur’an. مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتٰبِ(membenarkan kitab-kitab yang sebelumnya) Yakni kitab-kitab yang diturunkan Allah. Hal ini karena al-qur’an mengandung perintah untuk menyeru kepada Allah dan menyuruh kepada kebaikan dan melarang kemungkaran sebagaimana kitab-kitab sebelumnya juga mengandung hal-hal ini. وَمُهَيْمِنًا عَلَيْهِ ۖ (dan batu ujian terhadap kitab-kitab yang lain itu) Yakni sebagai saksi atas kebenaran kitab-kitab sebelumnya, pengikrar atas apa yang belum dinasakhkan, penasakh apa yang menyelisihinya, penjaga asas-asas syariat didalamnya, rujukan dalam masalah hukum yang masih berlaku atau tidak, dan penjelas dari apa yang telah banyak dirubah oleh pendeta-pendeta Yahudi dan Nasrani. فَاحْكُم بَيْنَهُم بِمَآ أَنزَلَ اللهُ ۖ (maka putuskanlah perkara mereka menurut apa yang Allah turunkan) Yakni dalam al-qur’an. وَلَا تَتَّبِعْ أَهْوَآءَهُمْ (dan janganlah kamu mengikuti hawa nafsu mereka) Yakni mengikuti hawa nafsu pemeluk agama-agama yang sebelumnya dan pengubahan mereka atas agama. Dan jangan pula kamu berbelok dan tersesat. عَمَّا جَآءَكَ مِنَ الْحَقِّ ۚ (dengan meninggalkan kebenaran yang telah datang kepadamu) Yakni kebenaran yang telah diturunkan kepadamu, karena setiap pemeluk agama-agama itu menginginkan agar tetap berada dalam keadaan mereka itu dan dalam apa yang mereka dapatkan dari nenek moyang mereka meskipun itu adalah hal yang bathil dan telah dinasakh, atau telah disesatkan dari hukum yang diturunkan Allah kepada nabi mereka, sebagaimana hukum rajam dan lainnya yang mereka rubah dari kitab-kitab Allah. لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا ۚ( Untuk tiap-tiap umat diantara kamu, Kami berikan aturan dan jalan yang terang) Yakni menjadikan Taurat bagi pemeluk agama Yahudi dan Injil bagi pemeluk Nasrani, dan ini ketika syari’at-syari’at terdahulu belum dinasakh oleh al-qur’an. Adapun setelahnya maka tidak ada syari’at, aturan dan jalan hidup kecuali harus dengan apa yang didatangkan oleh Nabi Muhammad. وَلَوْ شَآءَ اللهُ لَجَعَلَكُمْ أُمَّةً وٰحِدَةً (Sekiranya Allah menghendaki, niscaya kamu dijadikan-Nya satu umat (saja)) Yakni satu syari’at, satu kitab, dan satu rasul saja. وَلٰكِن لِّيَبْلُوَكُمْ (tetapi Allah hendak menguji kamu) Menguji dengan perbedaan syari’at-syari’at. فِى مَآ ءَاتَىٰكُمْ ۖ (terhadap pemberian-Nya kepadamu) Yakni apa yang telah diturunkan kepada kalian berupa syari’at yang berbeda-beda. Yakni untuk menguju batas ketaatan tiap umat dalam mengikuti syari’atnya, apakah mereka menjalankan dan mentaatinya atau meninggalkannya dan condong kepada nawa nafsu serta menjual petunjuk dengan kesesatan? Dalam ayat ini terdapat dalil bahwa perbedaan syari’at-syari’at adalah dikarenakan alasan ini. فَاسْتَبِقُوا۟ الْخَيْرٰتِ ۚ( maka berlomba-lombalah berbuat kebajikan) Yakni wahai orang-orang beriman berlomba-lombalah dengan umat-umat lain yang telah menjalankan ketaatan kepada Allah atas dasar syari’at mereka, maka jalankanlah ketaatan kepada Allah atas dasar syari’at kalian agar kalian dapat mengalahkan mereka dalam ketaatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam syari'at yang dibwakan oleh Rasulullah Muhammad -عليه الصلاة والسلام- begitu banyak kelembutan, toleransi, ampunan, dan contoh akhlaq yang baik, dan ia merupakan syari'at yang lebih agung dan lebih mulia dari apa yang diterangkan oleh injil, dan dilamnya pula ada ketegasan dan jihad, dan ada pula penetapan hukuman bagi orang-orang kafir dan munafiq, yang sesungguhnya syari'at itu jauh lebih luhur dari Taurat, sesungguhnya syariat ini berada pada kesempurnaan yang amat tinggi; oleh karena itu sebagian ulama mengatakan : Musa diutus dengan kehebatannya, Isa diutus dengan keindahannya, dan Muhammad diutus dengan kesempurnaannya. 2 ). Jika Allah saja menghendaki dominasi al-Qur'an diatas semua kitab samawi, padahal semua adalah kitab-kitab yang diturunkan oleh-Nya -جل جلاله- ; maka bagaimana dengan orang-orang yang menentang dominasi al-Qur'an di atas kitab-kitab makhluq ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Wahai Nabi, Kami telah menurunkan kepadamu Al-Qur’an yang mengandung hakikat dari banyak perkara dan benar-benar memperbaiki (akhlak) para hamba, membenarkan kitab-kitab Tuhan sebelumnya dan menguji kitab-kitab tersebut, yang mana menyetujui kebenarannya dan menampakkan kesalahan isi kitab yang dipalsukan. Maka putuskanlah hukum di antara ahli kitab menggunakan Al-Qur’an yang diturunkan oleh Allah jika mereka meminta keputusanmu wahai Nabi, dan janganlah mengikuti hawa nafsu para pengikut kepercayaan sebelumnya dalam memutuskan perkara, sehingga kamu menyimpang dari kebenaran yang diturunkan oleh Allah kepadamu, karena masing-masing kepercayaan itu mengikuti keinginan mereka sekalipun itu menyimpang seperti halnya perkara rajam dan lainnya yang mereka paalsukan dari kitab Taurat. Masing-masing umat kami buatkan aturan dan jalan yang mereka ikuti, yaitu jalan yang terang dalam agama yang dijalaninya, Hal ini sebelum syariat-syariat sebelumnya dinasakh dalam Al-Qur’an. Adapun setelah dinasakh (disalin) maka tidak ada aturan kecuali yang diturunkan dalam Al-Qur’an. Sehingga para ahli kitab dan pengikut kepercayaan lain sebelumnya untuk mengamalkan Al-Qur’an. Jika berkehendak, sungguh Allah telah menjadikan kalian sebagai satu umat yang sepakat dengan satu aturan, namun Allah tidak mau demikian, melainkan ingin membuat beragam aturan dalam berbagai periode dan waktu, agar Dia bisa menguji kalian dengan aturan yang berbeda itu. Inilah alasannya. Tidak ada bedanya perbuatan baik di zaman yang berbeda, maka bergegaslah untuk beramal baik, supaya kalian bisa meraih ridaha Allah. Wahai Manusia, hanya kepada Allahlah tempat kembali kalian semua, lalu Dia akan memberitahu perbedaan kalian dalam urusan agama, dan menghisab kalian atas hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah menurunkan kepadamu kitab} Al-Qur’an {dengan kebenaran sebagai pembenar kitab-kitab yang diturunkan sebelumnya} sebelumnya {dan sebagai penjaganya} penjaga setiap kitab yang mendahuluinya {Maka putuskanlah mereka menurut aturan yang diturunkan Allah dan janganlah mengikuti hawa nafsu mereka dengan kebenaran yang telah datang kepadamu. Untuk setiap umat di antara kalian Kami berikan aturan} syariat {dan jalan yang terang} jalan yang jelas tentang agama {Seandainya Allah menghendaki, niscaya Dia menjadikan kalian satu umat} satu kelompok yang sepakat dengan satu syariat {Akan tetapi, Allah hendak menguji kalian} menguji kalian {tentang apa yang telah Dia anugerahkan kepada kalian. Maka berlomba-lombalah dalam berbuat kebaikan. Hanya kepada Allahlah tempat kembali kalian semua, lalu Dia memberitahukan kepada kalian apa yang selama ini kalian perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Firman Allah, “Dan Kami telah menurunkan kepadamu al-Kitab,” yakni, al-Quran yang agung, kitab termulia dan terbaik, “dengan membawa kebenaran,” yakni diturunkan dengan benar, berisi kebenaran pada berita-berita, perintah-perintah, dan larangan-larangan. “Membenarkan apa yang sebelumnya yaitu kitab-kitab (yang diturunkan sebelumnya),” karena ia menjadi saksi baginya, setuju dengannya, berita-beritanya sesuai dengan berita-beritanya, syariat-syariatnya yang pokok sama dengan syariat-syariatnya, ia memberitakan tentangnya, maka keberadaannya menjadi bukti kebenarannya. “Dan batu ujian terhadap kitab-kitab yang lain itu,” maksudnya, ia mengandung apa yang dikandung oleh kitab-kitab terdahulu, tetapi ia unggul dalam tuntutan-tuntutan Ilahiyah dan akhlak-akhlak kejiwaan. Ia adalah kitab yang menghimpun semua kebenaran yang dibawa oleh kitab-kitab, lalu memerintahkan kepadanya, mendorong kepadanya, dan memperbanyak jalan yang mengantarkan kepadanya. Ia adalah kitab yang berisi berita orang-orang terdahulu dan orang-orang yang akan datang. Ia adalah kitab yang mengandung keadilan, hikmah, dan hukum-hukum, di mana kitab-kitab terdahulu dicocokkan kepadanya, apa yang dinyatakan benar, maka ia diterima, dan apa yang ditolaknya maka ia tolak, dan itu berarti ia telah tercampuri oleh pergantian dan penyelewengan, jika tidak maka seandainya ia benar dari Allah, niscaya Allah tidak menyelisihinya. “Maka putuslah perkara mereka menurut apa yang Allah turunkan,” yaitu hukum syar’I yang diturunkan oleh Allah kepadamu, “dan janganlah kamu mengikuti hawa nafsu mereka dengan meninggalkan kebenaran yang telah datang kepadamu.” Maksudnya, jangan menjadikan sikap mengikuti hawa nafsu mereka yang rusak yang menentang kebenaran sebagai ganti bagi kebenaran yang telah datang kepadamu, maka kamu pun menukar yang lebih baik dengan yang lebih rendah. Masing-masing untuk kalian wahai umat-umat telah Kami jadikan “aturan dan jalan yang terang,” yakni jalan dan Sunnah. Syariat-syariat ini, yang berbeda-beda sesuai dengan perbedaan umat, inilah syariat yang berubah-ubah sesuai dengan perubahan masa dan kondisi, dan semuanya kembali kepada keadilan pada saat (dan tempat) disyariatkannya. Adapun prinsip-prinsip dasar yang merupakan kemaslahatan dan hikmah di setiap masa, maka ia tidak berbeda-beda, ia disyariatkan pada semua syariat. “Sekiranya Allah menghendaki, niscaya kamu dijadikanNya satu umat saja,” mengikuti satu syariat, yang terakhir tidak berbeda dari yang sebelumnya. “Tetapi Allah hendak mengujimu terhadap pemberianNya kepadamu.” Dia mengujimu dan melihat bagaimana kamu beramal dan Dia menguji masing-masing umat sesuai dengan hikmahNya dan memberi setiap orang apa yang layak baginya agar terjadi saling berlomba-lomba di antara umat. Masing-masing umat tentu berusaha mengungguli yang lain. Oleh karena itu Dia berfirman, “Maka berlomba-lombalah berbuat kebaikan,” yakni bersegeralah kepadanya, sempurnakanlah. Kebaikan yang mencakup seluruh kewajiban dan anjuran, baik itu hak-hak Allah maupun hak hamba-hambaNya, pelakunya belum di anggap berlomba-lomba padanya, mendahului yang lain, dan menguasai persoalan kecuali dengan dua perkara: Bersegera kepadanya, memanfaatkan peluang manakala waktunya tiba dan penyebabnya ada, bersungguh-sungguh dalam melaksanakannya dengan sempurna sesuai dengan yang diperintahkan. Ayat ini dijadikan sebagai dalil atas kewajiban bersegera dalam menjalankan shalat dan ibadah-ibadah yang lain pada awal waktu. Lebih dari itu hendaknya seorang hamba tidak hanya membatasi diri pada apa yang dianggap cukup dalam shalat dan ibadah wajib lainnya, akan tetapi hendaknya dia melakukan perkara-perkara Sunnah agar lebih lengkap dan sempurna, karena dengan itu dia meraih gelar berlomba-lomba dalam kebaikan. “Hanya kepada Allah-lah kamu semua kembali.” Umat-umat yang lalu dan yang akan datang, semuanya akan dikumpulkan oleh Allah pada hari yang tidak ada kebimbangan kepadanya, “lalu diberitakanNya kepadamu apa yang telah kamu persellisihkan itu,” yaitu, syariat-syariat dana mal-amal perbuatan, maka dia memberi pahala kepada pengikut kebenaran dana mal shalih dan menghukum pengikut kebatilan dana mal buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 48: Maksudnya Al Quran mengandung apa yang dikandung dalam kitab-kitab sebelumnya, dan menambah lagi tuntutan-tuntutannya dan akhlak bagi diri. Al Qur'an mengandung semua kebenaran yang dibawa kitab-kitab sebelumnya, sehingga ia memerintahkannya dan mendorongnya. Di dalam Al Qur'an terdapat berita tentang orang-orang yang terdahulu dan yang akan datang, di dalamnya terdapat hukum dan hikmah serta hukum-hukum yang ditunjukkan kitab-kitab sebelumnya, oleh karenanya isi kitab-kitab terdahulu, jika disaksikan oleh Al Qur'an sebagai kebenaran, maka hal itu diterima, namun jika tidak disaksikan demikian, bahkan didustakan, maka hal itu ditolak karena telah dirobah oleh tangan manusia. Maksudnya umat Nabi Muhammad shallallahu 'alaihi wa sallam dan umat-umat yang sebelumnya. Aturan di sini seperti yang tertera dalam Al Qur’an, dan jalan yang terang di sini adalah sunnah Rasulullah shallallahu 'alaihi wa sallam sebagai penjelasan atau praktek nyata dari Al Qur’an. Dengan demikian, sunnah Nabi shallallahu 'alaihi wa sallam merupakan tolok ukur benar tidaknya kita memahami Al Qur’an. Syari'at bagi setiap umat berbeda-beda sesuai kondizi zaman dan keadaan pada waktu itu, dan semua syari'at itu merujuk kepada keadilan yang memang layak diterapkan pada zaman itu, adapun ushul (dasar-dasar agama) yang menjadi maslahat dan kebijaksanaan di setiap zaman, maka tidak berbeda-beda, seperti pada ayat berikut: \"Sembahlah Allah dan janganlah kamu mempersekutukan-Nya dengan sesuatu pun, dan berbuat baiklah kepada kedua orang tua, karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga yang dekat dan tetangga yang jauh, dan teman sejawat, ibnu sabil dan hamba sahayamu. Sesungguhnya Allah tidak menyukai orang-orang yang sombong lagi membangga-banggakan diri.\" (Terj. An Nisaa': 36) dan ayat-ayat yang lain seperti di surat Al Baqarah: 83 dan 177, Al An'aam: 151-153, Al Israa': 23-38 dan Luqman: 12-19. Kalau Allah menghendaki, tentu Dia menjadikan kamu satu umat saja dan di atas satu syari'at, akan tetapi Dia pecah-pecahkan kamu untuk mengujimu terhadap syari'at yang berbeda sesuai keadaan waktu itu, agar Dia melihat siapa di antara kamu yang taat dan siapa di antara kamu yang bermaksiat. Demikian juga agar kamu dapat berlomba-lomba dalam kebaikan dengan umat sebelum kamu. Ayat ini menunjukkan agar seseorang bersegera melaksanakan ketaatan dan tidak menundanya, seperti melaksanakan shalat di awal waktu, dan agar seseorang tidak membatasi diri melakukan kewajiban saja, bahkan sepatutnya ia mengerjakan hal yang sunat yang mampu dikerjakan agar amalan menjadi sempurna dan dapat membalap orang lain dalam mengerjakan kebaikan. Baik kamu maupun umat-umat terdahulu. Tentang syari'at dan amal, lalu Dia akan memberikan balasan kepada pengikut kebenaran dan pelaku amal salih, serta akan memberikan balasan kepada pengikut kebatilan dan pelaku amal buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 48",
    "description": "Pada ayat-ayat yang lalu Allah menerangkan tentang diturunkannya taurat dan injil yang mengandung petunjuk dan cahaya, serta adanya kewajiban bagi umat masa itu untuk melaksanakan ajaran-ajarannya. Dan kami selanjutnya telah pula menurunkan kitab Al-Qur'an kepadamu, Muhammad, sebagai nabi terakhir, dengan membawa kebenaran yang hakiki, yang membenarkan sebagian isi dari kitab-kitab yang diturunkan sebelumnya, yaitu taurat, zabur, dan injil, dan menjaganya dari penyimpangan atau pengubahan yang dilakukan oleh orang-orang yang mencari keuntungan diri, maka putuskanlah perkara yang mereka perselisihkan menurut ketetapan dalam kitab-kitab yang diturunkan Allah itu dan janganlah sekali-kali engkau mengikuti kemauan dan keinginan nafsu mereka dengan meninggalkan kebenaran yang telah datang kepadamu. Ketahuilah bahwasanya untuk setiap umat di antara kamu, di mana saja mereka berada, kami berikan aturan bagi mereka masing-masing dan jalan yang terang sesuai dengan keadaannya. Kalau Allah menghendaki sesuai dengan kehendak-Nya, niscaya kamu semua akan dijadikan-Nya sebagai satu umat saja, tetapi Allah berkehendak lain, yaitu ingin menguji kamu terhadap karunia dan semua nikmat yang telah diberikan-Nya kepadamu, maka sebagai jawaban dari semua rahmat yang telah dilimpahkan itu, berlomba-lombalah untuk berbuat kebajikan. Ketahuilah bahwa hanya kepada Allah saja kamu semua akan kembali, lalu pada saat itu akan diberitahukan-Nya kepadamu apa saja yang dahulu pernah kamu perselisihkan pada saat menjalani kehidupan di duniaselanjutnya ingatlah, wahai nabi Muhammad, ketika orang-orang yahudi mengajukan persoalan di antara mereka dan mengharapkan keputusanmu, maka tetapkanlah sesuai aturan dan hendaklah engkau memutuskan perkara yang terjadi di antara mereka menurut apa yang diturunkan Allah, sebagaimana yang terdapat dalam taurat, dan janganlah engkau mengikuti keinginan mereka yang menyebabkan terjadinya kezaliman terhadap sebagian yang lain. Karena itu, hati-hati dan waspadalah terhadap sikap dan perkataan mereka, jangan sampai mereka berhasil memperdayakan engkau terhadap sebagian apa yang telah diturunkan Allah kepadamu, yaitu Al-Qur'an yang berisi petunjuk yang lebih lurus. Jika mereka berpaling dari hukum yang telah diturunkan Allah dan tidak mau mengikutinya, maka ketahuilah bahwa dengan keadaan itu sesungguhnya Allah berkehendak untuk menimpakan musibah sebagai peringatan kepada mereka yang disebabkan oleh sebagian dosa-dosa yang telah mereka lakukan. Itulah pelajaran dan ujian bagi mereka, namun sungguh banyak manusia tidak menyadarinya, sehingga mereka ini adalah termasuk sebagai orang-orang yang fasik, yaitu mereka yang tidak melaksanakan ajaran yang diimaninya."
  }
]