[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan putuskanlah perkara (wahai rasul) diantara orang-orang yahudi dengan hukum yang Allah turunkan kepadamu di dalam al-qur’an, dan janganlah kamu mengikuti keinginan-keinginan nafsu orang-orang yang berhukum kepadamu. Dan berhati-hatilah terhadap mereka agar jangan sampai mereka menghalangi dirimu dari sebagian hukum yang Allah turunkan kepadamu, akibatnya kamu meninggalkan pengamalannya. Apabila mereka itu berpaling dari putusan hukum yang sudah kamu keluarkan, maka ketahuilah bahwa sesungguhnya Allah berkehendak untuk memalingkan mereka dari kebenaran disebabkan oleh dosa-dosa yang mereka perbuat sebelumnya. Dan sesungguhnya kebanyakan manusia benar-benar keluar dari ketaatan kepada tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan kamu seharusnya -wahai Rasul- memutuskan perkara mereka berdasarkan hukum yang Allah turunkan kepadamu. Janganlah kamu mengikuti pendapat-pendapat mereka yang bersumber dari hawa nafsu. Dan berhati-hatilah agar mereka tidak menyesatkanmu dari hukum yang Allah turunkan kepadamu. Karena mereka akan terus bekerja keras untuk melakukan hal itu. Jika mereka tidak bersedia menerima keputusan berdasarkan hukum yang Allah turunkan kepadamu, ketahuilah bahwasanya Allah hendak menghukum mereka dengan hukuman dunia atas dasar sebagian dosa mereka dan hendak menghukum mereka di Akhirat atas dasar semua dosa-dosa mereka. Dan sesungguhnya banyak sekali manusia yang tidak taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Kemudian Allah memerintahkan untuk menjadikan syariat-Nya sebagai landasan hukum, karena didalamnya terdapat kebaikan, rahmat, keberkahan, dan kebahagiaan bagi setiap hamba yang mentaatinya dan ridha terhadapnya. Dan Allah melarang hamba-hamba-Nya mengikuti hawa nafsu orang-orang yang sesat dengan menjadikannya landasan hukum padahal di dalamnya terdapat kezaliman dan kesewenang-wenangan. Dan dia memperingatkan dari tipu daya musuh-musuh Islam agar kaum muslimin tidak terpalingkan dari syariat dan jalan mereka yang terang dan agar musuh-musuh Islam itu dapat menebar kezaliman dan kekacauan di masyarakat. Memenuhi ajakan musuh-musuh Allah tersebut dengan tidak menerapkan hukum yang diturunkan oleh Allah merupakan suatu ujian besar yang wajib diwaspadai. Jika mereka berpaling dari syariat dan jalan Allah yang telah Dia ridhai bagi hamba-hamba-Nya maka sesungguhnya Allah akan menyiksa mereka. Kemudian Allah membuat pengingkaran terhadap orang yang mengacuhkan syariat dan rela dengan hawa nafsu jahiliyah padahal itu dipenuhi dengan kebodohan, kezaliman, dan kontradiksi; namun tetap ada orang yang menyeru dan menuntut untuk menerapkan hukum jahiliyah tersebut. Dan Allah menekankan bahwa hukum-Nya adalah yang paling utama, sehingga tidak ada hukum yang dapat menandinginya. Dan orang yang menerapkan syariat Allah hanyalah orang yang telah yakin, yaitu orang yang keimanan telah kokoh di dalam hatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَأَنِ احْكُم بَيْنَهُم بِمَآ أَنزَلَ اللهُ (dan hendaklah kamu memutuskan perkara di antara mereka menurut apa yang diturunkan Allah) Yakni apabila mereka mendatangimu agar kamu memutuskan perkara diantara mereka dan kamu mau melakukan itu maka putuskanlah perkara mereka sesuai dengan apa yang diturunkan Allah kepadamu, bukan sesuai dengan hawa nafsu mereka atau kitab-kitab mereka yang telah dirubah. وَاحْذَرْهُمْ أَن يَفْتِنُوكَ عَنۢ بَعْضِ مَآ أَنزَلَ اللهُ إِلَيْكَ ۖ (Dan berhati-hatilah kamu terhadap mereka, supaya mereka tidak memalingkan kamu dari sebahagian apa yang telah diturunkan Allah kepadamu) Yakni menyesatkan kamu darinya. فَإِن تَوَلَّوْا۟ فَاعْلَمْ أَنَّمَا يُرِيدُ اللهُ أَن يُصِيبَهُم بِبَعْضِ ذُنُوبِهِمْ ۗ (Jika mereka berpaling, maka ketahuilah bahwa sesungguhnya Allah menghendaki akan menimpakan mushibah kepada mereka disebabkan sebahagian dosa-dosa mereka) Yakni apabila mereka tidak mau menerima putusanmu yang sesuai dengan apa yang diturunkan kepadamu, maka itu disebabkan karena Allah hendak menyiksa mereka karena sebagian dosa-dosa mereka, yaitu dosa berpaling darimu, dan penolakan atas apa yang kamu datangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Lalu Allah mengulangi perkara tersebut sebagai peringatan agar (Nabi) tidak tersesat, dan berfirman: “Wahai Nabi, hendaklah kamu memutuskan hukum di antara ahli kitab dan pemeluk kepercayaan lainnya sesuai apa yang diturunkan Allah kepadamu, dan janganlah kamu mengikuti hawa nafsu dan penyimpangan mereka dengan tetap membenarkan yang benar dan menyalahkan yang bathil, serta waspadailah mereka saat mau menyesatkanmu dari sebagian wahyu yang diturunkan Allah kepadamu sehingga kamu tidak mengamalkannya. Dan jika mereka tidak mau menerima keputusanmu yang sesuai dengan apa yang diturunkan kepadamu, maka hal itu karena balasan atas sebagian dosa-dosa mereka, yaitu menolak apa yang kamu bawa. Sesungguhnya kebanyakan manusia tidak mau menaati Allah SWT.” Ibnu Abbas berkata: “Sebagian ulama’ Yahudi datang dan berkata: “Wahai Muhammad, kami adalah para pendeta Yahudi, jika kami mengikutimu, maka semua orang Yahudi akan mengikutimu, dan sesungguhnya di antara kami dan kaum kami itu ada perdebatan, dan kami ingin meminta keputusan hukum kepadamu. Jika kamu memutuskan perkara bagi kami, niscaya kami akan berikrar untuk mengimanimu” Lalu Rasulullah SAW menolak hal tersebut dan Allah SWT menurunkan ayat [Wahdzarhum] untuk mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah kamu memutuskan di antara mereka menurut apa yang diturunkan Allah dan janganlah kamu mengikuti hawa nafsu mereka. Waspadailah mereka agar mereka tidak dapat memperdayakanmu} menyesatkan dan membelokkanmu {dari sebagian apa yang telah diturunkan Allah kepadamu. Jika mereka berpaling} berpaling untuk menerima hukum menurut apa yang diturunkan Allah kepadamu {ketahuilah bahwa sesungguhnya Allah berkehendak menimpakan kepada mereka} mengazab mereka {sebagian dosa-dosa mereka. Sesungguhnya banyak dari manusia adalah orang-orang yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “Dan hendaknya kamu memutuskan perkara di antara mereka menurut apa yang diturunkan oleh Allah.” Ayat inilah yang katanya menasakh Firman Allah,\"maka putuskanlah keptusan dianatara mereka atau berpalinglah\" (Al-Maidah:42). Padahal yang benar adalah bahwa ia bukan menasakh, karena ayat itu menunjukkan bahwa Nabi diberi pilihan antara memutuskan perkara atau tidak memutuskan, hal itu karena tujuan mereka dalam meminta keputusan bukanlah kebenaran. Sementara ayat ini menunjukkan bahwa jika Nabi memutuskan, ,maka dia memutuskan dengan dengan apa yang diturunkan oleh Allah yaitu al-Quran dan Sunnah. Inilah keadilan yang telah dinyatakan oleh Allah dalam ayat sebelumnya. \"dan jika kamu memutuskan maka putuskanlah diantara mereka dengan adil\" (Al-Maidah:42). Ayat ini menjelaskan tentang keadilan, bahwa intinya adalah hukum yang disyariatkan oleh Allah karena ia mengandung keadilan yang sempurna dana pa yang menyelisihinya adalah kezhaliman. “Dan janganlah kamu mengikuti hawa nafsu mereka.” Larangan mengikuti hawa nafsu kembali di ulang untuk memberikan peringatan keras darinya, dank arena konteksnya adalah memutuskan hukum dan fatwa yang jelas lebih luas sementara ini konteksnya hanyalah hukum semata. Pada keduanya seseorang tidak boleh mengikuti hawa nafsu mereka yang menyimpang dari kebenaran. Oleh karena itu Allah berfirman, “Dan berhati-hatilah kamu terhadap mereka supaya mereka tidak memalingkanmu dari sebagian apa yang telah diturunkan oleh Allah kepadamu.” Maksudnya, janganlah kamu terkecoh oleh mereka, jangan sampai mereka membuatmu berpaling lalu mereka berhasil menghalangimu dari sebagian yang diturunkan oleh Allah kepadamu. Maka mengikuti hawa nafsu mereka menjadi penyebab dicampakkannya kebenaran yang semestinya wajib dan harus diikuti. “JIka mereka berpaling” dari mengikutimu dan mengikuti kebenaran, “maka ketahuilah,” bahwa itu adalah hukuman bagi mereka, dan bahwa Allah menghendaki akan menimpakan musibah kepada mereka disebabkan sebagian dosa-dosa mereka. Karena dosa memiliki hukuman cepat atau lambat. Termasuk hukuman terbesar adalah, seorang hamba diuji dan dijadikan indah baginya keengganan untuk mengikuti Rasulullah, dan hal itu karena kefasikannya. “Dan sesungguhnya kebanyakan manusia adalah orang-orang fasik,” yakni tabiat mereka adalah kefasikan dan penyimpangan dari ketaatan kepada Allah dan RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 49: Yaitu yang disebutkan dalam Al Qur'an dan As Sunnah, dan itulah keadilan. Sehingga kamu meninggalkan hukum Allah karena mengikuti hawa nafsu mereka. Untuk dosa-dosa ada hukumannya, baik segera maupun ditunda nanti, di antara hukuman yang paling besar adalah dijadikan indah kemaksiatan akibat kefasikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 49",
    "description": "Selanjutnya ingatlah, wahai nabi Muhammad, ketika orang-orang yahudi mengajukan persoalan di antara mereka dan mengharapkan keputusanmu, maka tetapkanlah sesuai aturan dan hendaklah engkau memutuskan perkara yang terjadi di antara mereka menurut apa yang diturunkan Allah, sebagaimana yang terdapat dalam taurat, dan janganlah engkau mengikuti keinginan mereka yang menyebabkan terjadinya kezaliman terhadap sebagian yang lain. Karena itu, hati-hati dan waspadalah terhadap sikap dan perkataan mereka, jangan sampai mereka berhasil memperdayakan engkau terhadap sebagian apa yang telah diturunkan Allah kepadamu, yaitu Al-Qur'an yang berisi petunjuk yang lebih lurus. Jika mereka berpaling dari hukum yang telah diturunkan Allah dan tidak mau mengikutinya, maka ketahuilah bahwa dengan keadaan itu sesungguhnya Allah berkehendak untuk menimpakan musibah sebagai peringatan kepada mereka yang disebabkan oleh sebagian dosa-dosa yang telah mereka lakukan. Itulah pelajaran dan ujian bagi mereka, namun sungguh banyak manusia tidak menyadarinya, sehingga mereka ini adalah termasuk sebagai orang-orang yang fasik, yaitu mereka yang tidak melaksanakan ajaran yang diimaninyaapakah keinginan yang tidak sesuai dengan ajaran Allah itu karena mereka ingin kembali pada hukum jahiliah yang mereka kehendaki' sesungguhnya hukum siapakah yang lebih baik daripada hukum yang telah ditetapkan Allah, yaitu yang telah disyariatkan bagi orang-orang yang benar-benar beriman dan yang meyakini agama-Nya'"
  }
]