[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara bentuk kesempurnaan nikmat Allah pada kalian hari ini (wahai kaum Mukminin) , bahwa Allah menghalalkan bagi kalian hal-hal yang halal lagi baik. Dan sembelihan-sembelihan orang-orang yahudi dan nasrani, jika mereka menyembelihnya sesuai dengan ajaran syariat mereka, maka itu halal bagi kalian, dan sembelihan-sembelihan kalian juga halal bagi mereka. Dan Dia menghalalkan bagi kalian (wahai kaum Mukminin) untuk menikahi wanita-wanita yang menjaga diri, yaitu wanita-wanita merdeka yang Mukminah lagi menjaga diri dari perbuatan zina, demikian pula menikahi wanita-wanita merdeka lagi menjaga kehormatan dari kalangan yahudi dan nasrani, bila kalalaian berikan kepada mereka maskawin-maskawin mereka, sedang kalian adalah orang-orang yang menjaga kehormatan, bukan menginginkan berbuat perzinaan, lagi tidak menjadikan mereka simpanan-simpanan, serta kalian merasa aman dari terpengaruh dengan agama mereka. Dan barangsiapa mengingkari ajaran syariat iman, sungguh telah terhapus amalnya dan dia pada hari kiamat termasuk orang-orang yang merugi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Pada hari ini Allah menghalalkan bagi kalian memakan makanan-makanan yang dianggap lezat, dan memakan binatang yang disembelih oleh orang-orang ahli kitab dari kalangan Yahudi dan Nasrani. Dia juga menghalalkan bagi mereka binatang yang kalian sembelih. Dan Dia menghalalkan bagi kalian menikahi wanita-wanita beriman yang merdeka dan terhormat, dan menikahi wanita-wanita yang merdeka dan terhormat dari kalangan orang-orang yang diberi Alkitab sebelum kalian, yaitu kalangan Yahudi dan Nasrani, apabila kalian memberikan mahar mereka, dan kalian bermaksud menjaga diri dari perbuatan keji, tidak bermaksud menjadikan mereka sebagai kekasih-kekasih gelap untuk kalian ajak berbuat zina. Barangsiapa yang ingkar kepada ketentuan-ketentuan hukum yang telah Allah tetapkan bagi hamba-hamba-Nya, maka amal perbuatannya batal karena kehilangan syarat sahnya, yaitu iman. Dan kelak pada hari Kiamat ia termasuk orang-orang yang merugi, karena ia akan masuk Neraka untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah menghalalkan makanan para ahli kitab sebagaimana Allah menjelaskan kehalalan makanan kita bagi mereka. Dan Allah menghalalkan kita menikahi wanita-wanita beriman yang menjaga kehormatannya, serta menghalalkan untuk menikahi wanita-wanita ahli kitab yang menjaga kehormatan baik itu dari kaum Yahudi maupun Nasrani. Allah mendahulukan penyebutan wanita mukminah karena dia lebih layak dan lebih utama untuk dinikahi. Dan Allah menjelaskan hak wanita ahli kitab dalam perkara mahar. Dan memperingatkan dari keingkaran terhadap asas-asas keimanan dan syariat-syariat-Nya, karena bisa jadi berkumpul dengan ahli kitab akan membuat hati menjadi condong untuk meninggalkan agama. Hal ini untuk menjelaskan bahwa menikahi wanita ahli kitab bukan berarti menerima semua keyakinan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَطَعَامُ الَّذِينَ أُوتُوا۟ الْكِتٰبَ حِلٌّ لكُمْ (Makanan orang-orang yang diberi Al Kitab itu halal bagimu) Kata (الطعام) adalah sebutan bagi segala yang dapat dimakan dan masuk didalamnya hewan sembelihan. Maka segala makanan orang-orang Yahudi dan Nasrani tanpa ada perbedaan baik itu berupa daging dan lainnya adalah halal bagi orang-orang Islam. Sehingga sembelihan mereka juga halal kecuali yang memang telah diharamkan Allah seperti bangkai dan daging babi. Ali bin Abi Thalib, ‘Aisyah, dan Ibnu ‘Amr berkata: apabila ada ahli kitab yang menyembelih dengan menyebut nama selain Allah maka janganlah kalian makan sembalihannya. Imam Malik berkata: larangan ini yang dimaksudkan adalah sesuatu yang makruh dan bukan haram. Adapun jika kita tidak mengetahui kalau sembelihan itu disembelih dengan menyebut nama selain Allah maka hukumnya halal. Dan Rasulullah pun memakan daging kambing bakar yang dihadiahkan kepadanya oleh wanita Yahudi; dan kisah ini ada dalam hadist shahih. Adapun sembelihan orang Majusi maka haram hukumnya, begitu juga sembelihan para penyembah berhala dan orang-orang atheis, dan semua orang kafir selain orang Yahudi dan Nasrani. Diharamkan juga menikahkan wanita Muslimah dengan mereka karena mereka tidak termasuk ahli kitab. Adapun makanan lain selain sembelihan maka halal hukumnya untuk kita makan sesuai dengan Ijma’ para ulama. وَطَعَامُكُمْ حِلٌّ لَّهُمْ ۖ (dan makanan kamu halal (pula) bagi mereka) Yakni makanan orang-orang Islam halal untuk dimakan orang-orang ahli kitab. وَالْمُحْصَنٰتُ مِنَ الْمُؤْمِنٰتِ ((Dan dihalalkan mangawini) wanita yang menjaga kehormatan diantara wanita-wanita yang beriman) Yakni bagi wanita yang menjaga kehormatan, dan bukan yang suka melakukan perbuatan keji. Yakni mereka halal untuk kalian nikahi, wahai orang-orang beriman. وَالْمُحْصَنٰتُ مِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلِكُمْ (dan wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al Kitab sebelum kamu) Yakni mereka juga halal bagi kalian untuk kalian nikahi. Allah tidak menyebutkan bahwa wanita Muslimah halal bagi mereka untuk mereka nikahi sebagaimana telah menyebutkan bahwa makanan kita halal bagi mereka; hal ini menunjukkan bahwa wanita Muslimah haram bagi mereka untuk dinikahi. Adapun syarat wanita ahli kitab untuk bisa kita nikahi adalah wanita yang menjaga kehormatan, sehingga masuk didalamnya wanita merdeka yang menjaga kehormatan dari kaum bani Israil (Yahudi) atau Nasrani. Dan tidak masuk didalamnya wanita yang suka berbuat keji diantara mereka. إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ (bila kamu telah membayar mas kawin mereka) Yakni mahar mereka. مُحْصِنِينَ (dengan maksud menikahinya) Yakni berharap dari pernikahannya untuk menjaga kehormatan. غَيْرَ مُسٰفِحِينَ (tidak dengan maksud berzina) Yakni yang tidak terang-terangan melakukan zina. وَلَا مُتَّخِذِىٓ أَخْدَانٍ ۗ( dan tidak (pula) menjadikannya gundik-gundik) Makna (الأخدان) yakni kekasih-kekasih rahasia (selingkuhan). Allah mensyaratkan bagi para muslim laki-laki, menjaga kehormatan, tidak terang-terangan melakukan zina, dan tidak bertujuan mencari selingkuhan; sebagaimana Allah mensyaratkan perempuan ahli kitab adalah wanita yang menjaga kehormatan adapun wanita ahli kitab yang suka berzina maka ia haram dinikahi lelaki muslim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5 Pada hari ini dihalalkan bagimu segala yang baik-baik bagi kalian wahai orang-orang mukmin dan juga tidak diharamkan oleh syariat. Juga makanan sembelihan orang-orang Yahudi dan Nasrani itu halal bagimu selama kalian tidak mendengar mereka menyebut nama selain Allah ketika menyembelihnya. Makanan orang muslim itu halal pula bagi mereka Yahudi dan Nasrani. Dan dihalalkan mangawini wanita merdeka, beriman, yang menjaga kehormatan diantara wanita-wanita yang beriman dan wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al Kitab sebelum kamu, bila kamu telah membayar mas kawin mereka dengan maksud menikahinya, tidak dengan maksud berzina dan tidak pula menjadikannya gundik-gundik. Barangsiapa yang kafir kepada Allah dan risalah nabi Muhammad maka terhapuslah amalan salehnya dan di hari kiamat ia termasuk orang-orang merugi jika tetap mati dalam keadaan kafir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ini dihalalkan bagi kalian segala yang baik. Makanan Ahlul kitab} hewan sembelihan orang-orang Yahudi dan Nasrani {itu halal} halal {bagi kalian dan makanan kalian halal bagi mereka. Perempuan-perempuan yang menjaga kehormatan} Dihalalkan bagi kalian menikahi wanita-wanita yang bebas lagi suci {di antara perempuan-perempuan yang beriman dan perempuan-perempuan yang menjaga kehormatan di antara orang-orang yang diberi kitab suci sebelum kalian, apabila kalian memberi mereka} memberi mereka {imbalan mereka} mahar mereka {untuk menjaga kehormatan} untuk menjaga kesucian {tidak dengan maksud berbuat keji} tidak untuk terang-terangan berzina {dan tidak untuk menjadikan pasangan gelap} kekasih yang kalian bisa berzina dengan mereka secara sembunyi-sembunyi {Siapa yang kafir setelah beriman, maka sungguh sia-sia} batal {amalnya dan di akhirat dia termasuk orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah mengulang kembali penghalalan yang baik-baik untuk menegaskan nikmatNya dan untuk mengajak para hamba mensyukurinya dan memperbanyak dzikir kepadaNya, di mana Dia membolehkan apa yang mereka butuhkan, dan mereka dapat mengambil manfaat dari hal-hal yang baik. “Makanan orang-orang yang diberi al-Kitab itu halal bagimu.” Maksudnya, sembelihan orang Yahudi dan Nasrani adalah halal bagimu wahai kaum Muslimin, bukan orang-orang kafir selain mereka di mana sembelihan mereka tidak halal bagi kaum Muslimin. Hal itu karena Ahli Kitab menisbatkan diri kepada Rasul-rasul dan kitab-kitab Allah dan para rasul semuanya telah menyepakati diharamkannya menyembelih untuk selain Allah, karena itu adalah syirik. Orang-orang Yahudi dan Nasrani meyakini diharamkannya menyembelih untuk selain Allah, oleh karena itu sembelihan mereka dihalalkan sedang selain mereka tidak. Dan dalil yang menunjukkan bahwa yang dimaksud yang makanan (dalam ayat ini) adalah sembelihan mereka, dan bahwa makanan yang bukan merupakan sembelihan seperti biji-bijian dan buah-buahan, Ahli Kitab tidak memiliki kekhususan padanya, bahkan ia dibolehkan walaupun itu juga makanan selain Ahli KItab. Di samping itu, penisbatan makanan kepada mereka, menunjukkan bahwa ia adalah makanan dari hasil sembelihan mereka. Dan tidak bisa dikatakan bahwa penisbatan ini menunjukkan kepemilikan, dan bahwa yang dimaksud dengan makanan di sini adalah apa yang mereka miliki. Tidak demikian, karena ia tidak dibolehkan dengan cara mengambil secara tidak sah bahkan tidak pula dari kaum Muslimin. “Dan makananmu,” wahai kaum Muslimin, “halal pula bagi mereka,” maksudnya, halal bagimu untuk memberikannya kepada mereka. “Dan” dihalalkan untukmu, “wanita-wanita yang menjaga kehormatannya,” yaitu, wanita-wanita merdeka yang baik-baik (pandai menjaga diri), “dari kalangan wanita-wanita merdeka yang beriman.” Dan wanita-wanita yang menjaga kehormatannya, “dari orang-orang yang diberi al-Kitab sebelummu,” yaitu Yahudi dan Nasrani. Ayat ini adalah takhshish bagi Firman Allah \"dan janganlah kamu menikahi wanita-wanita musyrik sampai mereka beriman\" (Al-Baqarah: 221) Mafhum dari ayat ini, bahwasanya wanita-wanita hamba sahaya yang beriman tidak boleh dinikahi oleh laki-laki merdeka dan memang demikian. Adapun wanita-wanita Ahli KItab yang berstatus hamba sahaya, maka dalam keadaan apa pun mereka tidak boleh dinikahi oleh laki-laki merdeka secara mutlak berdasarkan Firman Allah, \"dan dari wani-wanita kalian yang beriman\" (An-Nisa:25). Adapun wanita-wanita Muslimah, jika mereka berstatus sebagai hamba sahaya, maka seorang laki-laki Muslim merdeka tidak boleh menikahinya kecuali dengan dua syarat: Pertama, tidak mampu memberi belanja, dan kedua, takut terjatuh kepada perbuatan zina. Adapun wanita-wanita nakal yang tidak terjaga dari zina, maka tidak boleh menikahi mereka, baik mereka itu Muslimah atau Ahli KItab, sampai mereka bertaubat, berdasarkan Firman Allah, \"seorang pezina tida menikah kecuali dengan pezina atau wanita musyrik\" (An-Nur:3). FirmanNya, “Bila kamu telah membayar mas kawin mereka,” maksudnya, Kami membolehkan kamu untuk menikahinya jika kamu telah membayarkan maharnya. Barangsiapa yang berniat tidak memberikan mas kawinnya, maka wanita tersebut tidak halal baginya. Dan Allah memerintahkan agar memberikan mahar kepadanya jika dia dewasa dan berakal serta sehat, layak untuk menerima, jika tidak, maka suami memberikannya kepada walinya. Dinisbatkannya maskawin kepada wanita, menunjukkan bahwa dia memiliki ha katas seluruh maskawinnya dan tidak seorang pun yang memiliki hak sedikit pun padanya, kecuali jika dia merelakan untuk suaminya atau walinya atau selainnya. “Dengan maksud menikahinya bukan dengan maksud berzina,” yakni dalam kedaan kamu wahai suami, menikahi istrimu yang karenanya kamu menjaga kemaluanmu dari wanita yang bukan istrimu. “Bukan dengan maksud berzina,” yakni berzina dengan siapa pun. “Dan tidak pula mengangkat gundik-gundik,” yakni berzina dengan kekasihnya. Para pezina di zaman jahiliyah, ada yang berzina dengan siapa pun, dia ini adalah pezina (ulung), di antara mereka ada yang berzina dengan kekasihnya. Maka Allah menyatakan bahwa hal itu menafikan akhlak iffah (terjaga dari zina) dan bahwa syarat menikah adalah hendaknya seorang laki-laki terjaga dari zina. FirmanNya, “Barangsiapa kafir kepada iman, maka terhapuslah amalannya.” Maksudnya, barangsiapa yang kafir kepada Allah, kitab-kitabNya, Rasul-rasulNya, atau syariat-syariatNya yang wajib diimani, maka gugurlah amalnya, dengan catatan dia mati di atas kekufurannya. Sebagaimana FirmanNya, “Mereka bertanya kepadamu tentang berperang pada bulan Haram. Katakanlah: \"Berperang dalam bulan itu adalah dosa besar; tetapi menghalangi (manusia) dari jalan Allah, kafir kepada Allah, (menghalangi masuk) Masjidilharam dan mengusir penduduknya dari sekitarnya, lebih besar (dosanya) di sisi Allah. Dan berbuat fitnah lebih besar (dosanya) daripada membunuh. Mereka tidak henti-hentinya memerangi kamu sampai mereka (dapat) mengembalikan kamu dari agamamu (kepada kekafiran), seandainya mereka sanggup. Barangsiapa yang murtad di antara kamu dari agamanya, lalu dia mati dalam kekafiran, maka mereka itulah yang sia-sia amalannya di dunia dan di akhirat, dan mereka itulah penghuni neraka, mereka kekal di dalamnya.” (Al-Baqarah:217). “Dan dia di akhirat termasuk orang-orang yang merugi,” yaitu orang-orang yang merugi, diri mereka, harta mereka, dan keluarga mereka pada Hari Kiamat, dan mereka mendapatkan kesengsaraan abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 5: Allah Subhaanahu wa Ta'aala menyebutkan beberapa kali tentang halalnya yang baik-baik untuk menerangkan nikmat-Nya, mengajak hamba mensyukurinya dan banyak menyebut nama-Nya, karena Dia telah menghalalkan kepada mereka semua yang dibutuhkan dan mereka dapat memanfaatkannya. Yakni Yahudi dan Nasrani, tidak orang-orang kafir yang lain. Hal itu karena Ahli Kitab masih menyandarkan diri kepada nabi dan kitab. Para rasul semuanya sepakat haramnya menyembelih untuk selain Allah, karena yang demikian adalah syirk, dan orang-orang Yahudi serta Nasrani beragama dengan meyakini haramnya menyembelih kepada selain Allah. Faedah: Syaikh M. bin Shalih Al ‘Utsaimin pernah ditanya tentang hukum daging ayam impor, ia menjawab, \"Ayam impor dari negara asing, yakni non Islam, jika yang menyembelihnya adalah Ahli Kitab, yaitu Yahudi atau Nasrani maka boleh dimakan dan tidak sepantasnya dipertanyakan bagaimana cara penyembelihannya atau apakah disembelih atas nama Allah atau tidak? Yang demikian itu karena Nabi Shallallahu ‘alaihi wa sallam pernah memakan daging domba yang dihadiahkan oleh seorang perempuan yahudi kepadanya di Khaibar, dan beliau juga memakan makanan ketika beliau diundang oleh seorang yahudi, yang di dalam makan itu ada sepotong gajih dan beliau tidak menanyakan bagaimana mereka menyembelihnya atau apakah disembelih dengan menyebut nama Allah atau tidak? ……….” Ia juga mengatakan, “Adapun kalau hewan potong itu datang dari negara asing dan orang yang melakukan penyembelihannya adalah orang yang tidak halal sembelihannya, seperti orang-orang majusi dan penyembah berhala serta orang-orang yang tidak menganut ajaran agama (atheis), maka ia tidak boleh dimakan, sebab Allah Subhanahu wa Ta’ala tidak membolehkan sembelihan selain kaum muslimin, kecuali orang-orang Ahli Kitab; yaitu Yahudi dan Nasrani. Apabila kita meragukan orang yang menyembelihnya, apakah berasal dari orang yang halal sembelihannya ataukah tidak, maka yang demikian itu tidak apa-apa.\" Para fuqaha (ahli fiqih) berkata, “Apabila anda menemukan sesembelihan dibuang di suatu tempat yang sembelihan mayoritas penduduknya halal, maka sembelihan itu halal.” Ada juga yang mengartikan wanita-wanita yang merdeka. Ayat ini juga menunjukkan bahwa wanita-wanita pezina yang tidak menjaga diri dari zina, maka tidak boleh menikahinya -baik mereka mereka muslimah atau Ahli Kitab- sampai jelas keadaannya (sudah bertobat atau belum), berdasarkan firman Allah Ta'ala, \"Laki-laki yang berzina tidak mengawini melainkan perempuan yang berzina, atau perempuan yang musyrik; dan perempuan yang berzina tidak dikawini melainkan oleh laki-laki yang berzina atau laki-laki musyrik.\" (Terj. An Nuur: 3). Namun tidak termasuk wanita musyrik. Jika wanita itu tidak cerdas, maka suami menyerahkan mahar kepada walinya. Disandarkannya mahar kepada wanita itu terdapat dalil bahwa wanita yang memiliki semua maharnya, dan tidak ada hak bagi seorang pun terhadapnya, kecuali jika si wanita memberikan dengan kerelaan kepada suaminya, walinya atau lainnya. Di mana ia melakukan zina bersamanya secara bersembunyi. Jika dia meninggal di atas kekafiran sebagaimana yang disebutkan dalam surat Al Baqarah ayat 217."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 5",
    "description": "Ayat ini masih berkaitan dengan ayat yang lalu memberikan jawaban atas pertanyaan orang yang beriman tentang apa saja yang dihalalkan bagi mereka. Pada hari ini dihalalkan bagimu segala yang baik-baik. Makanan, yakni binatang halal yang disembelih ahli kitab itu halal bagimu selagi tidak bercampur dengan barang-barang yang haram, dan makananmu halal pula bagi mereka, maka kamu tidak berdosa memberikannya kepada mereka. Dan dihalalkan bagimu menikahi perempuan-perempuan yang menjaga kehormatan di antara perempuanperempuan yang beriman dan halal pula menikahi perempuan-perempuan yang menjaga kehormatan di antara orang-orang yang diberi kitab sebelum kamu, yaitu orang-orang yahudi dan nasrani, apabila kamu membayar maskawin mereka untuk menikahinya, yakni melangsungkan akad nikah secara sah, tidak dengan maksud berzina dan bukan untuk menjadikan perempuan piaraan. Demikian Allah menetapkan hukum-hukum-Nya untuk dijadikan tuntunan bagi orang-orang yang beriman. Barang siapa kafir setelah beriman, maka sungguh, sia-sia amal mereka, dan di akhirat dia termasuk orang-orang yang rugi. Setelah Allah menjelaskan hukum tentang makanan dan hewanhewan sembelihan yang dihalalkan dan menjelaskan ketentuan menyangkut wanita-wanita yang boleh dinikahi, pada ayat ini Allah menjelaskan hukum-hukum yang berkaitan dengan tata cara beribadah kepada Allah dimulai dengan salat sebagai ibadah yang paling mulia. Ayat ini memberikan petunjuk tentang persiapan yang harus dilakukan ketika hendak melakukan salat, yaitu cara menyucikan diri dengan berwudu, tayamum, dan mandi. Wahai orang-orang yang beriman! apabila kamu telah membulatkan hati hendak melaksanakan salat, sedangkan kamu saat itu dalam keadaan tidak suci atau berhadas kecil, maka berwudulah, yaitu dengan cara basuhlah wajahmu dengan air dari ujung tempat tumbuhnya rambut kepala sampai ke ujung dagu dan bagian antara kedua telinga, dan basuhlah tanganmu sampai ke siku, dan sapulah sedikit atau sebagian atau seluruh kepalamu dan basuhlah kedua kakimu sampai kedua mata kaki. Dan jika kamu dalam keadaan junub, yakni keluar mani karena bersetubuh atau karena sebab lain, maka mandilah, yakni basuhlah dengan air seluruh badanmu. Dan jika kamu sakit yang menghalangi kamu menggunakan air karena khawatir penyakitmu bertambah parah atau memperlambat kesembuhan kamu, atau kamu berada dalam perjalanan yang dibenarkan agama dan dalam jarak tertentu, atau kembali dari tempat buang air, yakni kakus, setelah selesai membuang hajat, atau menyentuh perempuan, yakni persentuhan dalam arti pertemuan dua alat kelamin yang berbeda atau dalam arti persentuhan kulit seorang laki-laki dan perempuan, lalu kamu tidak memperoleh air, tidak dapat menggunakannya, baik karena tidak ada, tidak cukup, atau karena sakit, maka bertayamumlah dengan debu yang baik, yakni debu yang bersih dan suci; yaitu dengan cara sapulah wajahmu dan tanganmu dengan debu itu. Allah yang mahakuasa tidak ingin menyulitkan kamu dan tidak menghendaki sedikit pun kesulitan bagimu dengan mengharuskan kamu berwudu ketika tidak ada air atau ketika dalam keadaan sakit yang dikhawatirkan kamu bertambah sakit apabila anggota badanmu terkena air, tetapi dia hendak membersihkan kamu, menyucikan kamu dari dosa maupun dari hadas, dan menyempurnakan nikmat-Nya bagimu, dengan meringankan apa yang menyulitkan kamu agar kamu bersyukur atas nikmat yang dianugerahkan-Nya kepadamu."
  }
]