[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yahudi itu menghendaki kamu memutuskan perkara diantara mereka dengan kebiasaan yang dijalankan oleh kaum musyrikin dan para penyembah berhala, berupa kesesatan-kesesatan dan kebodohan-kebodohan?! Hal itu tidak akan terjadi dan tidak pantas selamanya. Dan siapakah yang lebih adil daripada Allah dalam hukum yang ditetapkanNya bagi orang yang memahami dari Allah lah syariatNya dan beriman kepadaNya serta meyakini bahwa hukum Allah adalah haq?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Apakah mereka berpaling dari keputusanmu seraya mencari keputusan dari orang-orang Jahiliah penyembah berhala yang memberikan keputusan berdasarkan selera hati mereka? Tidak ada yang lebih baik keputusan hukumnya dari Allah bagi orang-orang yang meyakini dan memahami apa yang Allah turunkan kepada rasul-Nya, bukan bagi orang-orang Jahiliah dan pemuja hawa nafsu yang hanya mau menerima apa yang sejalan dengan selera hati mereka meskipun batil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. أَفَحُكْمَ الْجٰهِلِيَّةِ يَبْغُونَ ۚ (Apakah hukum Jahiliyah yang mereka kehendaki) Yakni apakah mereka berpaling dari putusanmu yang sesuai dengan apa yang Allah turunkan kepadamu dan menghendaki hukum jahiliyah? وَمَنْ أَحْسَنُ مِنَ اللهِ حُكْمًا لِّقَوْمٍ يُوقِنُونَ (dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin?) Yakni tidak ada yang lebih baik dari hukum Allah bagi orang-orang yang beriman. Tidak seperti orang-orang bodoh dan menikuti hawa nafsu yang tidak rela kecuali hukum yang sesuai dengan nafsu mereka meskipun itu bathil."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ketajuilah bahwasanya setiap hukum yang bertentangan dengan syari'at Allah, maka sesungguhnya ia adalah bagian dari hukum-hukum jahiliah : { أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ ۚ وَمَنْ أَحْسَنُ مِنَ اللَّهِ حُكْمًا لِقَوْمٍ يُوقِنُونَ } \"Apakah hukum Jahiliyah yang mereka kehendaki, dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin?\" 2 ). Lafazh \"الْجَاهِلِيَّةِ\" di dalam al-Qur'an dinisbatkan kepada empat perkara : { أَفَحُكْمَ الْجَاهِلِيَّةِ } , dan { ظَنَّ الْجَاهِلِيَّةِ } [ Ali-Imran : 154 ]. dan { تَبَرُّجَ الْجَاهِلِيَّةِ } [ AL-Ahzab : 33 ], dan { حَمِيَّةَ الْجَاهِلِيَّةِ } [ AL-Fath : 26 ] , pada perkara pertama datang dari rusaknya hukum, dan kedua daru rusanya sangkaan, dan ketiga dari rusaknya pakaian para wanita, dan keempat dari kesombongan jahiliyah. 3 ). Itulah mereka yang mencari-cari jawaban dari penduduk bumi untuk menghindar dari sanksi Raja langit, tetapi sungguh mereka telah gagal dengan aturan-aturan yang mereka banggakan, yaitu aturan yang berasal dari fikiran mereka sendiri, maka peristiwa ini patutlah menjadi pelajaran bagi mereka yang memohon petunjuk Allah dari orang-orang yang menyesatkan, atau dengan melihat maslahat dari selain syari'at Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Apakah mereka menginginkan keputusan zaman Jahiliyyah yang didirikan atas dasar kesewenang-wenangan, monopoli dan hawa nafsu, dan tidak mau menerima keputusan Allah. Tidak ada keputusan yang lebih baik daripada keputusan Allah bagi kaum yang meyakini kebenaran ayat hukum dalam Al-Qur’an, adapaun selain itu adalah keputusan orang yang bodoh dan mengikuti hawa nafsu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah hukum jahiliyah yang mereka kehendaki} inginkan {siapakah yang lebih baik daripada hukum Allah bagi kaum yang meyakini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. \"Apakah hukum jahiliyah yang mereka kehendaki?” maksudnya, apakah dengan berpaling dan menjauhnya mereka darimu karena mereka mencari hukum jahiliyah? Hukum Jahiliyah itu adalah semua hukum yang bertentangan dengan apa yang diturunkan oleh Allah kepada RasulNya. Karena pilihan yang ada hanya hukum Allah dan RasulNya atau hukum jahiliyah. Siapa yang berpaling dari yang pertama, maka dia akan ditimpa oleh yang kedua yang berpijiak kepada kebodohan, kezaliman, dan kesewenang-wenangan. Oleh karena itu Allah menyatakannya jahiliyah. Adapun hukum Allah, maka ia berpijak kepada ilmu, keadilan, cahaya, dan petunjuk. “Siapa yang lebih baik daripada hukum Allah bagi orang-orang yang yakin?” orang yang yakin adalah orang yang mengetahui perbedaan antara dua hukum dan dia membedakan dengan keyakinannya kebaikan dan kemuliaan yang ada pada hukum Allah, bahwa ia secara akal dan syariat wajib untuk diikuti. Keyakinan adalah ilmu yang sempurna yang mendorong kepada amal perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 50: Hukum jahiliah adalah setiap hukum yang menyelisihi hukum Allam dan Rasul-Nya. Barang siapa yang berpaling dari hukum Allah dan Rasul-Nya, maka ia ditimpa bala' dengan hukum jahiliah yang tegak di atas kebodohan, kezaliman dan kesesatan, adapun hukum Allah, maka ia tegak di atas ilmu, keadilan, cahaya dan petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 50",
    "description": "Apakah keinginan yang tidak sesuai dengan ajaran Allah itu karena mereka ingin kembali pada hukum jahiliah yang mereka kehendaki' sesungguhnya hukum siapakah yang lebih baik daripada hukum yang telah ditetapkan Allah, yaitu yang telah disyariatkan bagi orang-orang yang benar-benar beriman dan yang meyakini agama-Nya' wahai orang-orang yang beriman! ingatlah kamu semua, janganlah sekali-kali kamu menjadikan orang yahudi dan nasrani sebagai teman setiamu karena akibat negatifnya lebih banyak ketimbang positifnya. Selain itu, mereka satu sama lain saling melindungi karena adanya persamaan kepentingan di antara mereka. Oleh karena itu, barang siapa di antara kamu yang tetap saja memilih dan menjadikan mereka sebagai teman setia dengan mengabaikan umat islam, maka sesungguhnya dia termasuk golongan mereka yang sering kali mengabaikan ajaran-ajaran Allah. Sungguh, karena keingkaran mereka, Allah tidak akan memberi petunjuk kepada orang-orang yang ingkar dan zalim karena selalu mengabaikan tuntunan-Nya."
  }
]