[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman,janganlah kalian menjadikan orang-orang yahudi dan nasrani sebagai sekutu-sekutu dan penolong-penolong untuk menghadapi kaum beriman. Demikian itu, karena sesungguhnya mereka tidak sayang kepada kaum Mukminin. Orang-orang yahudi itu, sebagian mereka loyal kepada sebagian yang lain. Begitu pula kaum nasrani. Dan dua golongan itu bersatu untuk memusuhi kalian, sedang kalian (wahai kaum mukminin), sepantasnya sebagain dari kalian membela sebagaian yang lain. Dan barangsiapa dari kalian yang memberikan loyalitasnya kepada mereka, sesungguhnya dia akan menjadi bagian dari mereka, dan hukumnya akan seperti hukum mereka. Sesungguhnya Allah tidak memberikan taufik kepada orang-orang zhalim yang membela orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya, janganlah kalian menjadikan orang-orang Yahudi dan Nasrani sebagai sekutu dan orang-orang pilihan yang kalian jadikan sebagai wali (pemimpin) kalian. Karena orang-orang Yahudi hanya menjadi wali bagi para pemeluk agama mereka saja. Dan orang-orang Nasrani pun hanya menjadi wali bagi para pemeluk agama mereka saja. Sedangkan kedua golongan itu sama-sama memusuhi kalian. Barangsiapa di antara kalian menjadikan mereka sebagai walinya berarti ia termasuk ke dalam golongan mereka. Sesungguhnya Allah tidak akan memberikan petunjuk kepada orang-orang yang zalim karena menjadikan orang-orang kafir sebagai teman setia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Ini merupakan seruan Allah bagi orang-orang yang beriman untuk melarang mereka dari menjadikan orang-orang Yahudi dan Nasrani sebagai kekasih dan pemimpin setelah tersingkap seluruh perkara mereka; mereka selalu melanggar perjanjian, membangkang, Ingkar, menyesatkan, dan mengubah ayat-ayat Allah. Maka Bagaimana kalian akan merasa aman dari tipu daya mereka dan mengharap kasih sayang mereka, sedangkan mereka saling tolong-menolong dalam memusuhi kalian! Dan seseorang akan berkasih sayang dengan orang yang serasi dan memiliki tujuan yang sama dengannya. Maka barangsiapa yang menjadikan mereka kekasih dan pemimpin maka dia termasuk golongan mereka, karena menjadikan mereka pemimpin menunjukkan sikap rendah dan kelalaian kalian. Maka bagaimana orang yang menjadikan mereka pemimpin akan mendapat hidayah sedangkan dia telah membantu kezaliman mereka? Allah tidak akan memberi hidayah kepada orang yang telah keluar dari ketaatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ الْيَهُودَ وَالنَّصٰرَىٰٓ أَوْلِيَآءَ ۘ (Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang Yahudi dan Nasrani menjadi pemimpin-pemimpin(mu)) Yakni yang kalian tolong, kalian jadikan sekutu, dan kalian cintai serta kalian tinggalkan Allah dan Rasul-Nya. بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۚ( sebahagian mereka adalah pemimpin bagi sebahagian yang lain) Yakni sebagian orang Yahudi merupakan pemimpin bagi sebagian lainnya, dan sebagian orang nasrani merupakan pemimpin bagi sebagian lainnya. Dan mereka tidak akan menjadikan kalian sebagai pemimpin dengan jujur sepenuh hati. Pendapat lain mengatakan yang dimaksud adalah orang-orang Yahudi menolong orang-orang Nasrani dan orang-orang Nasrani menolong orang-orang Yahudi dalam memusuhi Rasulullah dan apa yang ia datangkan, mekipun dalam hubungan diantara mereka sendiri mereka saling bermusuhan dan beselisih. وَمَن يَتَوَلَّهُم مِّنكُمْ فَإِنَّهُۥ مِنْهُمْ ۗ(angsiapa diantara kamu mengambil mereka menjadi pemimpin, maka sesungguhnya orang itu termasuk golongan mereka) Yakni berarti ia termasuk dalam golongan mereka. Dan ini merupakan bentuk ancaman keras. إِنَّ اللهَ لَا يَهْدِى الْقَوْمَ الظّٰلِمِينَ(Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim) Yakni yang menzalimi diri mereka sendiri dengan menjadikan orang-orang kafir sebagai pemimpin dan penolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Wahai orang-orang mukmin, janganlah kalian menjadikan orang-orang Yahudi dan Nasrani sebagai sahabat yang selalu mengawasi rahasia-rahasia kalian, karena sesungguhnya mereka adalah musuh kalian. Mereka adalah penolong satu sama lain, karena takut dengan kekuatan dan kesatuan kalian. Dan barangsiapa mengambil mereka sebagai penolong, maka sungguh dia termasuk di antara golongan mereka, karena mau dekat-dekat dengan musuh-musuh Allah. Sesungguhnya Allah tidak memberi taufik orang-orang yang menzalimi diri sendiri dengan berdekatan bersama musuh-musuhNya. Ayat ini turun untuk Abdullah bin Ubay ketika berkata: “Aku adalah lelaki yang takut ditimpa musibah sehingga aku tidak berlepas diri dari kekuasaan mereka” Adapun ‘Ubadah bin Shamit, itu berlepas diri dari kuasa orang yahudi, berlindung kepada Allah dan rasulNya. Lalu turunlah ayat ini untuk keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian menjadikan orang-orang Yahudi dan Nasrani sebagai teman setia} penolong dan teman setia {Sebagian mereka menjadi teman setia bagi sebagian yang lain} setiap kelompok dari mereka, menjadi teman setia satu sama lain {Siapa di antara kalian yang menjadikan mereka teman setia, maka sesungguhnya dia termasuk golongan mereka} dari kelompok mereka {Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Allah membimbing hamba-hambaNya yang beriman manakala Dia menjelaskan keadaan orang-orang Yahudi dan Nasrani dan sifat-sifat buruk mereka agar kaum Muslimin tidak mengangkat mereka sebagai pemimin-pemimpin. Karena sebagian dari mereka adalah “ wali bagi sebagian yang lain.” Mereka saling tolong-menolong dan saling bahu-membahu menghadapi selain mereka. Maka janganlah kamu mengangkat mereka sebagai penolong-penolong, karena mereka adalah musuh yang sebenarnya, mereka tidak mempedulikan penderitaanmu bahkan mereka tidak menghemat energy sedikitpun demi menyesatkanmu. Maka tidak ada yang mengangkat mereka menjadi pemimpin-pemimpin kecuali orang yang sama seperti mereka. Oleh karena itu Dia berfirman, “ barang siapa di antara kamu yang mengambil mereka menjadi pemimpin, maka sesungguhnya orang itu termasuk golongan mereka.” Karena pengangkatan mereka menjadi pemimpin secara total menurut perpindahan kepada agama mereka, loyalitas yang sedikit akan mendorong kepada yang banyak, lalu fase demi fase sehingga seorang hamba menjadi satu dengan mereka. “ Sesungguhnya Allah tidak akan memberi petunjuk kepada orang-porang yang zhalim,” yakni dengan kezhaliman sebagai sipat, karena kembali kepadanya dan berpijak kepadanya. Jika kamu hadir kepada membawa satu bukti, niscaya mereka tidak akan mengikuti dan menaatimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 51: Dan saling menolong serta bersatu dalam memusuhi dan memerangi kamu. Hal itu, karena berwala' (memberikan kesetiaan) jika sempurna menjadikan pelakunya pindah ke agama mereka, namun jika berwala' hanya sedikit, maka bisa membawanya kepada sikap sering berwala', dan jika tidak dicegah lama-kelamaan akan menjadikan seorang hamba termasuk mereka (pindah ke agama mereka). Yang memberikan walaa' (kesetiaan) kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 51",
    "description": "Wahai orang-orang yang beriman! ingatlah kamu semua, janganlah sekali-kali kamu menjadikan orang yahudi dan nasrani sebagai teman setiamu karena akibat negatifnya lebih banyak ketimbang positifnya. Selain itu, mereka satu sama lain saling melindungi karena adanya persamaan kepentingan di antara mereka. Oleh karena itu, barang siapa di antara kamu yang tetap saja memilih dan menjadikan mereka sebagai teman setia dengan mengabaikan umat islam, maka sesungguhnya dia termasuk golongan mereka yang sering kali mengabaikan ajaran-ajaran Allah. Sungguh, karena keingkaran mereka, Allah tidak akan memberi petunjuk kepada orang-orang yang ingkar dan zalim karena selalu mengabaikan tuntunan-Nyaorang-orang munafik, yaitu yang antara perkataan dan hatinya berbeda, sesungguhnya mereka akan selalu merasa tidak senang pada umat islam. Bila diperhatikan, maka kamu akan melihat orang-orang yang hatinya berpenyakit itu akan segera mendekati mereka, yaitu kaum yahudi dan nasrani, karena mereka menganggapnya sebagai kelompok yang kuat, sehingga bila hubungannya tidak baik, ada kekhawatiran mereka akan terancam seraya berkata, kami takut akan mendapat bencana. Sesungguhnya sikap mereka menunjukkan ketidakpercayaan pada umat islam. Karena itu, mudah-Mudahan Allah akan mendatangkan kemenangan kepada rasul-Nya dan kaum muslim, atau dia berkenan untuk menetapkan suatu keputusan dari sisi-Nya yang membuktikan kekuasaan dan rahmat-Nya kepada kaum muslim, sehingga mereka betul-betul menjadi menyesal terhadap apa yang selama ini mereka rahasiakan dalam diri mereka."
  }
]