[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengabarkan tentang segolongan dari orang-orang munafik bahwa mereka bersegera menjalin hubungan kasih sayang dengan orang-orang yahudi, karena di dalam hati mereka ada keraguan dan kemunafikan. Dan mereka berkata,”Sesungguhnya kami menjalian hubungn kasih sayang dengan mereka karena kami takut mereka akan mengalahkan kaum Muslimin, akibatnya mereka (orang-orang yahudi) itu akan menghantam kami sekaligus bersamaan dengan kaum Muslimin.” Allah yang Maha tinngi NamaNya berfirman, ”Mudah-mudahan Allah akan membawakan kemenangan, (yaitu menaklukan kota Makkah) dan menolong nabiNYa, dan memenangkan islam dan kaum Muslimin atas orang-orang kafir, serta memudahkan perkara-perkara yang dapat melenyapkan kekuatan kaum yahudi dan nasrani, sehingga mereka nantinya akan tunduk kepada kaum Mukminin. Maka saat itulah kaum munafik akan menyesal atas hal yang mereka sembunyikan di dalam hati mereka berupa adanya loyalitas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Maka kamu -wahai Rasul- akan melihat kaum munafik yang lemah imannya bergegas menjadikan orang-orang Yahudi dan Nasrani sebagai wali mereka seraya berkata, “Kami khawatir kelak mereka akan menang dan berdaulat kemudian kami akan mendapatkan perlakuan yang buruk dari mereka.” Mudah-mudahan Allah memberikan kemenangan kepada rasul-Nya dan orang-orang mukmin, atau mendatangkan sesuatu dari sisi-Nya yang dapat meredam kekuatan orang-orang Yahudi dan sekutunya. Maka orang-orang yang bergegas menjadikan orang-orang Yahudi sebagai wali itu pun menyesali kemunafikan yang mereka sembunyikan di dalam hati mereka akibat gagalnya usaha-usaha lemah yang mereka andalkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Setelah Allah melarang dan memperingatkan orang-orang beriman dari menjadikan orang-orang kafir sebagai kekasih dan pemimpin, kemudian Allah menjelaskan keadaan orang-orang yang memiliki iman yang lemah dan hati yang sakit, bagaimana mereka sangat cepat dan bersegera menjadikan musuh-musuh Islam sebagai kekasih dan pemimpin, dan mencari keridaan mereka, padahal mereka telah diperingatkan sebelumnya? Kamu akan melihat mereka sedikit demi sedikit berpaling menuju musuh-musuh Allah untuk melawan kaum muslimin. Itu merupakan sikap yang hina dari orang munafik yang memiliki keimanan yang lemah, yaitu ketika mereka bersegera bergabung dengan musuh-musuh Allah dengan kerelaan hati maupun terpaksa. Allah Maha Kuasa untuk mengubah keadaan, dan mendatangkan kemenangan yang dapat menghancurkan kekuatan musuh dan memadamkan kejayaan mereka. Kata الفتح (penakhlukan) lebih luas maknanya daripada kata النصر (kemenangan), karena penaklukan yaitu meraih tujuan dan mewujudkan keinginan, sedangkan kemenangan merupakan perantara menuju penaklukan. Kata (عسى) jika berasal dari Allah merupakan sesuatu yang pasti terjadi, karena Allah Yang Maha Pemurah tidak akan menjanjikan sesuatu kecuali pasti akan memberi dan mewujudkannya. Namun kemenangan yang diharapkan mungkin saja tidak terwujud dalam waktu dekat, akan tetapi takdir dan ketetapan Allah yang tak nampak tidak di masa depan pernah terbayang. Oleh sebab itu kata (أمر) diungkapkan dalam bentuk nakirah, untuk mengibaratkan sesuatu yang belum jelas waktu kejadiannya. Ini merupakan hal yang menakjubkan yang berada di luar perkiraan dan perhitungan akal. Dan Allah mengungkapkan firman-Nya dengan kalimat \"من عنده\" (dari sisi-Nya) karena itu merupakan bagian dari rahasia takdir dan keajaiban ketetapan-Nya. Allah akan menghinakan orang-orang munafik dan membalikkan keadaan mereka, sehingga orang-orang kafir akan berlepas diri dari mereka sehingga orang-orang munafik itu menyesal telah menjadikan musuh-musuh Allah sebagai kekasih dan pemimpin. Namun penyesalan mereka tidak tidak bermanfaat lagi, bahkan itu akan menjadi sebab tersingkapnya rahasia mereka. Mereka akhirnya sadar dan mengetahui kebenaran yang sesungguhnya setelah lama terjerumus dalam kegelapan syubhat dan fitnah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. فَتَرَى الَّذِينَ فِى قُلُوبِهِم مَّرَضٌ (Maka kamu akan melihat orang-orang yang ada penyakit dalam hatinya) Yakni penyakit kemunafikan dan keraguan terhadap agama. يُسٰرِعُونَ فِيهِمْ(bersegera mendekati mereka) Yakni untuk menjadikan mereka pemimpin, penolong, dan kekasih. يقولون نخشى أن تصيبنا دائرة (seraya berkata: “Kami takut akan mendapat bencana”) Yakni kami takut orang-orang kafir akan mengalahkan Muhammad sehingga mereka dapat mendirikan negara, dan negara Rasulullah akan hancur, sehingga mereka akan menimpakan kepada kami bencana. بِالْفَتْحِ(dengan kemenangan) Yakni kemenangan Rasulullah atas orang-orang kafir, seperti pembinasaan pasukan perang dari Bani Quraidhah dan menawanan wanita-wanita mereka, dan pengusiran Bani Nadlir. Pendapat lain pengatakan yakni penakhlukan negeri orang-orang kafir ditangan orang-orang Islam. أَوْ أَمْرٍ مِّنْ عِندِهِۦ(atau sesuatu keputusan dari sisi-Nya) Yakni yang mencegah serangan orang-orang Yahudi dan komplotannya dan menghancurkan kekuatan mereka. Pendapat lain mengatakan yakni pembongkaran perihal orang-orang munafik, dan pemberitaan kepada Rasulullah atas apa yang mereka rahasiakan dalam diri mereka, serta perintah untuk memerangi mereka. عَلَىٰ مَآ أَسَرُّوا۟ فِىٓ أَنفُسِهِمْ (terhadap apa yang mereka rahasiakan dalam diri mereka) Berupa kemunafikan yang membawa mereka kepada perbuatan menjadikan orang-orang kafir sebagai pemimpin dan penolong. نٰدِمِينَ(mereka menjadi menyesal) Yakni menyesal atas hal tersebut, karena cara-cara yang mereka bayangkan ternyata tidak benar dan yang terjadi malah sebaliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Lalu kamu akan melihat orang-orang yang di dalam hatinya ada penyakit ragu dan kemunafikan terkait urusan agama. Mereka bergegas bersahabat dengan orang-orang Yahudi dan Nasrani dengan berkata: “Kami takut ditimpa musibah dengan kemenangan orang-orang kafir atas nabi Muhammad SAW sehingga negeri tersebut menjadi milik mereka dan dakwahnya (nabi) tidak bisa berlaku (atas mereka), lalu kesetian kami untuk mereka (orang Kafir) dikorbankan dan kami mendapat kebencian.” Lalu Allah membalas mereka bahwa barangkali pertolonganNya untuk rasulullah dan orang-orang mukmin atas musuh-musuh mereka akan datang, atau akan datang perintah dari Allah untuk memerangi musuh-musuh Islam, menampakkan aib orang-orang munafik, dan menghancurkan kekuasaan orang Yahudi. Lalu orang-orang munafik yang tetap melakukan kemunafikan dengan berdekatan dengan orang yahudi itu akan menyesal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka kamu akan melihat orang-orang yang di dalam hatinya penyakit} kemunafikan {segera mendekati mereka} bersegera untuk menjadi teman setia dan pembantu mereka {mereka berkata,“Kami takut akan tertimpa mara bahaya”} kami takut orang-orang kafir mengalahkan orang-orang muslim sehingga negeri ini menjadi milik mereka, sehingga kami menerima kemalangan {Mudah-mudahan Allah akan mendatangkan kemenangan} dengan kemenangan untuk orang-orang mukmin {atau suatu keputusan dari sisiNya} disegerakan dengan perintah itu serangan terhadap orang-orang kafir dan orang-orang yang bersama mereka dan dihancurkan keraguan mereka {sehingga mereka menyesali atas apa yang mereka rahasiakan} ala yang mereka sembunyikan {dalam diri mereka itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Ketika Allah melarang orang-orang yang beriman untuk mengangkat mereka sebagai pemimpin, maka Allah memberitahukan bahwa di antara orang yang klaim iman adalah sekelompok orang munafik yang manjadikan mereka sebagai pemimpin. Allah berfirman, “Maka kamu akan melihat orang-orang yang di dalam hatinya terdapat penyakit,” yakni penyakit ragu-ragu dan kemunafikan serta kelemahan iman, mereka berkata, “ Kami mengangkat mereka karena ada kepentingan karena kami “takut akan mendapat bencana,” artinya kemenangan orang-orang Yahudi dan Nasrani. Jika memang demikian, maka kami mampunyai jasa atas mereka dan mereka akan memberi balasan buat kami. Ini adalah prasangka buruk terhadap Islam. Allah membantah praduga buruk ini, “mudah-nudahan Allah akan mendatangkan kemenangan,” yang dengannya Allah memuliakan Islam atas orang-orang Yahudi dan NAsrani dan kaum Muslimin pun mengalahkan mereka, “ Atau suatu kaputusan di sisiNya,” yang dengannya orang-orang munafik berputus asa mengarap kemenangan orang-orang kafir dan kalangan orang-orang Yahudi dan yang lainnya, “ maka karena itu mereka menjadi menyesal terhadap apa yang mereka rahasiakan dalam diri mereka.” Mereka menyesal atas apa yang mereka lakukan. Kerugian terjadi kepada mereka tanpa adanya manfaat. Yang terjadi adalah kemenangan yang dengannya Allah Allah memuliakan orang kafir, karena mereka menyesal dan bersedih dengan kesedihan yang hanya Allah yang Mengetahuinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 52: Setelah Allah melarang kaum mukmin berwala' kepada orang-orang kafir, Allah memberitakan bahwa di antara orang-orang yang mengaku beriman ada yang berwala' kepada mereka. Seperti orang-orang munafik atau orang-orang yang lemah iman. Mereka memberikan wala' kepada orang-orang kafir karena khawatir orang-orang kafir yang menang, sehingga mereka tidak jadi diserang karena telah memberikan wala' kepada orang-orang kafir. Mereka tidak yakin bahwa Allah akan memenangkan dan menyempurnakan agama Nabi Muhammad shallallahu 'alaihi wa sallam. Dengan membuka rahasia orang-orang munafik. Berupa syak (keragu-raguan) dan sikap wala' kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 52",
    "description": "Orang-orang munafik, yaitu yang antara perkataan dan hatinya berbeda, sesungguhnya mereka akan selalu merasa tidak senang pada umat islam. Bila diperhatikan, maka kamu akan melihat orang-orang yang hatinya berpenyakit itu akan segera mendekati mereka, yaitu kaum yahudi dan nasrani, karena mereka menganggapnya sebagai kelompok yang kuat, sehingga bila hubungannya tidak baik, ada kekhawatiran mereka akan terancam seraya berkata, kami takut akan mendapat bencana. Sesungguhnya sikap mereka menunjukkan ketidakpercayaan pada umat islam. Karena itu, mudah-Mudahan Allah akan mendatangkan kemenangan kepada rasul-Nya dan kaum muslim, atau dia berkenan untuk menetapkan suatu keputusan dari sisi-Nya yang membuktikan kekuasaan dan rahmat-Nya kepada kaum muslim, sehingga mereka betul-betul menjadi menyesal terhadap apa yang selama ini mereka rahasiakan dalam diri mereka. Melihat keadaan orang-orang munafik itu, umat islam heran dengan kondisi mereka, dan selanjutnya orang-orang yang beriman itu akan berkata, inikah orang yang telah bersumpah setia secara sungguhsungguh dengan nama Allah, bahwa mereka benar-benar beserta kamu dan siap untuk menjalin kerja sama dalam menegakkan kedamaian' ketahuilah bahwa sesungguhnya segala amal dan kegiatan yang mereka kerjakan akan menjadi sia-sia, sehingga sebagai akibatnya mereka betulbetul akan menjadi orang yang rugi."
  }
]