[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada saat itulah sebagian kaum Mukminin akan berkata kepada sebagian yang lain dengan keheranan terhadap keadaan orang-orang munafik (ketika terbongkar urusan mereka), ”Apakah mereka itu adalah orang-orang yang dahulu berani bersumpah dengan sumpah-sumpah yang amat kuat bahwa mereka itu benar-benar bersama kita?” terhapuslah amal-amal kaum munafik yang mereka kerjakan di dunia ini, sehingga tidak ada balasan apapun bagi mereka atas amal-amal itu. Sebab sesungguhnya mereka itu mengerjakannya tanpa landasan keimanan, sehingga mereka merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Orang-orang mukmin merasa heran dengan kondisi orang-orang munafik itu dan berkata, “Inikah orang-orang yang bersumpah dengan sungguh-sungguh bahwa mereka benar-benar bergabung bersama kalian -wahai orang-orang mukmin- dalam keimanan, pertolongan, dan pertemanan?\" Hanguslah amal perbuatan mereka. Maka mereka pun merugi akibat gagal mencapai tujuan mereka. Dan mereka akan ditimpa azab yang telah disiapkan untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Ketika Allah menolong hamba-hamba-Nya, dan kemenangan telah datang, mereka akan berkata kepada orang-orang munafik: Apakah orang-orang Yahudi dan Nasrani itu adalah orang-orang yang kalian bersumpah kepada Allah dengan sumpah yang paling kuat bahwa mereka pasti bersama kalian? Orang-orang munafik itu telah terhapus amalannya, sia-sia usahanya, tersingkap aibnya, dan menjadi orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. أَهٰٓؤُلَآءِ (apakah mereka itu) Ini adalah isyarat yang ditujukan kepada orang-orang munafik. Yakni orang-orang beriman berkata kepada orang-orang Yahudi dengan menunjuk kepada orang-orang munafik. الَّذِينَ أَقْسَمُوا۟ بِاللهِ جَهْدَ أَيْمٰنِهِمْ ۙ إِنَّهُمْ لَمَعَكُمْ ۚ( Inikah orang-orang yang bersumpah sungguh-sungguh dengan nama Allah, bahwasanya mereka benar-benar beserta kamu?) Yakni bersamamu dalam tolong menolong, dan saling membantu dalam peperangan. Makna (جهد الأيمان) yakni sumpah yang sungguh-sungguh. Yakni mereka bersumpah dengan penuh kesungguhan. حَبِطَتْ أَعْمٰلُهُمْ(Rusak binasalah segala amal mereka) Yakni amal-amal mereka rusak, baik itu amal mereka dalam menjadikan orang kafir sebagai pemimpin ataupun amal-amal yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Orang-orang mukmin akan berkata kepada orang-orang Yahudi dengan menunjuk orang-orang munafik, setelah aib mereka tampak: “Inikah orang-orang yang menegaskan keimanan mereka dengan kuat. Sesungguhnya mereka bersama mereka dengan meminta pertolongan dari peperangan. Amal shalih mereka menjadi sia-sia akibat kemunafikan mereka sehingga mereka merugi di dunia dengan aib mereka ditampakkan dan di akhirat dengan diberi hukuman yang menyakitkan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman akan berkata, “Inikah orang yang bersumpah} bersumpah {dengan (nama) Allah secara sungguh-sungguh} sungguh-sungguh {bahwa sesungguhnya mereka benar-benar bersama kalian” menjadi sia-sia} sia-sia {amal mereka sehingga mereka menjadi orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “ Dan orang-orang yang beriman akan mengatakan,” dengan penuh keheranan terhadap keadaan yang di hatinya terdapat penyakit, “ Inikah orang-orang yang bersumpah sungguh-sungguh dengan Nama Allah bahwasanya mereka benar-benar bersamaMu?” Maksudnya, mereka bersumpah, mempertegas, dan memperkuat sumpah dengan berbagai penguat behwa mereka bersamaMu dalam iman dan konsekuensinya: Pertolongan, Kecintaaan, dan loyalitas. Telah Nampak apa yang mereka sembunyikan dalam hati mereka. Telah jelas apa yang mereka rahasiakan. Makar yang mereka susun, prasangka yang mereka tujukan kepada Islam dan pengikutnya telah menjadi batal, maka batallah makar mereka dan batal pula “segala amal mereka” di dunia. “ Lalu mereka menjadi orang-orang yang merugi,” yang mana mereka tidak mendapatkan apa yang mereka cari sementara yang datang justru kesengsaraan dan azab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 53: Dengan heran ketika rahasia orang-orang munafik terbongkar. Di dunia dibuka aibnya dan di akhirat mendapatkan siksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 53",
    "description": "Melihat keadaan orang-orang munafik itu, umat islam heran dengan kondisi mereka, dan selanjutnya orang-orang yang beriman itu akan berkata, inikah orang yang telah bersumpah setia secara sungguhsungguh dengan nama Allah, bahwa mereka benar-benar beserta kamu dan siap untuk menjalin kerja sama dalam menegakkan kedamaian' ketahuilah bahwa sesungguhnya segala amal dan kegiatan yang mereka kerjakan akan menjadi sia-sia, sehingga sebagai akibatnya mereka betulbetul akan menjadi orang yang rugi. Bila sebelumnya dijelaskan tentang larangan untuk tidak menjadikan orang yahudi dan nasrani sebagai teman setia serta tentang buruknya sikap kaum munafik, maka ayat-ayat berikut berbicara tentang orang mukmin. Wahai orang-orang yang beriman! barang siapa di antara kamu yang murtad atau keluar dari agamanya, maka ketahuilah bahwa kelak Allah akan mendatangkan suatu kaum yang benar-benar beriman untuk menggantikanmu. Dia mencintai mereka dan mereka pun mencintai-Nya dengan segenap keikhlasannya, dan mereka juga selalu bersikap lemah lembut terhadap sesama orang-orang yang beriman, tetapi sebaliknya, mereka akan bersikap keras terhadap orang-orang kafir. Selain itu, mereka juga merupakan umat yang selalu siap untuk berjihad di jalan Allah, dan mereka juga termasuk orang-orang yang tidak takut kepada celaan orang yang dengki dan tidak senang yang suka mencela. Itulah salah satu bentuk karunia Allah yang diberikan-Nya kepada siapa yang dia kehendaki dari makhluk-Nya. Karena itu ketahui dan pahami bahwa Allah itu mahaluas pemberian-Nya, lagi maha mengetahui."
  }
]