[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan SyariatNya, barangsiapa dari kalian ada orang yang meninggalkan agamanya dan menggantikannya dengan agama yahudi dan nasrani maupun agama lainnya, maka mereka itu tidak dapat memudaratkan Allah sedikitpun, dan Allah akan mendatangkan kaum yang lebih baik dari mereka, yang Allah mencintai mereka dan mereka mencintaiNYa, mereka mengasihi orang-orang Mukmin dan tegas terhadap orang-orang kafir, berjihad memerangi musuh-musuh Allah dan tidak takut kepada siapapun dijalan Allah. Kenikmatan tersebut termasuk dari bagian dari karunia Allah yang diberikanNYa kepada siapa yang Dia kehendaki,dan Allah Maha luas karunianya lagi Maha Mengetahui orang yang berhak mendapatkannya dari para hambaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Wahai orang-orang yang beriman! Barangsiapa di antara kalian yang meninggalkan agamanya dan kembali kepada kekafiran maka Allah akan mendatangkan kaum lain sebagai penggantinya. Allah mencintai kaum itu dan merekapun mencintai-Nya karena keteguhan hati mereka. Mereka bersikap lemah lembut kepada orang-orang mukmin, namun keras terhadap orang-orang kafir. Mereka berjuang dengan harta dan jiwa mereka untuk menjunjung tinggi kalimat Allah. Mereka tidak takut kepada celaan yang dilontarkan oleh para pencela. Karena mereka lebih mendahulukan rida Allah daripada kerelaan makhluk, Itu merupakan bagian dari anugerah yang Allah berikan kepada hamba-hamba-Nya yang dikehendaki-Nya. Dan Allah Mahaluas anugerah dan kebaikan-Nya, lagi Maha Mengetahui siapa saja yang berhak mendapatkan anugerah-Nya maka Dia pun memberikannya, dan siapa saja yang tidak berhak mendapatkannya maka Dia tidak memberikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Setelah Allah melarang hamba-hamba-Nya yang beriman dari menjadikan orang-orang Yahudi dan Nasrani sebagai pemimpin dan kekasih, dan memperingatkan dari bahaya dan keburukan perbuatan tersebut; kemudian Allah menyeru mereka dan memperingatkan agar tidak meninggalkan agama-Nya atau enggan menolongnya. Karena jika itu mereka lakukan niscaya Allah akan mengganti mereka dengan orang yang mau menolong agamanya dan membangkitkan umat. Salah satu sifat yang paling utama dari generasi impian yang akan menolong agama Allah adalah bahwa Allah mencintai generasi tersebut -ini merupakan kenikmatan yang tidak ada kenikmatan dan karunia yang dapat menandinginya- dan mereka juga mencintai Allah yang merupakan bukti kebenaran keimanan mereka. Dan buah dari rasa cinta ini adalah mereka akan membenci orang yang dibenci Allah dan mencintai orang yang dicintai Allah, bersikap keras terhadap orang-orang kafir, dan tegas dalam menegakkan kebenaran. Dan ini tidak bertolak belakang dengan sikap toleransi dan kasih sayang yang mereka miliki, kelembutan dan tawaddu' terhadap orang-orang beriman. Ini semua tidak akan dapat terealisasi kecuali dengan menegakkan jihad, karena ia merupakan jalan menuju kemuliaan dan sumber kekuatan. Dan barangsiapa yang memiliki rasa cinta yang besar terhadap Allah dalam hatinya niscaya dia akan berusaha untuk meraih keridhaan-Nya dan tidak takut terhadap celaan dan hinaan ketika menegakkan kebenaran, karena keinginan dan tujuannya adalah keridhaan Allah. Dan tidak ada seorang hamba pun yang dapat mencapai derajat ini dan meraih pemahaman yang benar dan amal yang shalih kecuali berkat karunia dari Allah. Dan karunia Allah diberikan kepada hamba-hamba-Nya yang Dia kehendaki. Allah Maha Luas pemberian-Nya, dan Maha Mengetahui keadaan makhluk-Nya. Dan dalam ayat ini terdapat sindiran yang jelas yang ditujukan bagi orang-orang munafik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ مَن يَرْتَدَّ مِنكُمْ (Hai orang-orang yang beriman, barangsiapa di antara kamu yang murtad dari agamanya) Dalam ayat ini Allah mulai membahas hukum-hukum bagi orang-orang murtad setelah menjelaskan bahwa orang islam yang menjadikan orang kafir sebagai pemimpin merupakan kekafiran dan salah satu dari jenis kemurtadan. فَسَوْفَ يَأْتِى اللهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُۥٓ (maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintai-Nya) Mereka adalah Abu Bakar ash-Shiddiq beserta pasukannya dari para shahabat dan tabi’in yang memerangi orang-orang murtad, serta semua orang setelah mereka yang memerangi orang-orang murtad di setiap zaman. أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكٰفِرِينَ(yang bersikap lemah lembut terhadap orang yang mukmin, yang bersikap keras terhadap orang-orang kafir) Yakni mengungkapkan kelemahlembutan, kasih sayang, dan tawadlu kepada orang-orang beriman; dan di sisi lain mereka mengungkapkan sikap keras, kejam, dan lebih mulia kepada orang-orang kafir. Dan senantiasa berjihad di jalan Allah serta tidak takut pada cibiran saat melakukan tugas agama, namun mereka teguh dan tak menghuraukan apa yang dilakukan musuh-musuh islam dan pasukan setan itu, seperti hinaan kepada para pemeluk agama islam, dan anggapan buruk mereka terhadap perbuatan baik orang-orang islam, sebagai bentuk kedengkian dan kemurkaan mereka terhadap kebenaran dan orang-orang yang berada didalamnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Betapa mengherankan ketika kamu mengenal-Nya tetapi kamu tidak mencintainya, dan ketika kamu mendengar seruan-Nya tetapi kamu tidak bersegera menjawab seruan itu, dan ketika kamu mengetahui keuntungan bermuamalah dengan-Nya tetapi kamu bermuamalah dengan selain-Nya, dan yang lebih mengeherankan dari itu.. bahwasanya Dia telah mengajarkanmu segala pengetahuan, dan hakikatnya kamu butuh dengan-Nya, tetapi kamu berpaling dari-Nya dan kepada sesuatu yang menjauhkanmu dari-Nya kamu berharap. 2 ). Cinta dalam kamus ahli qur'an tidak dapat serupakan dengan cinta lain, yaitu cinta yang tertuju kepada sang Maha kuasa : { فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ } \"maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintai-Nya\", dan Imam mereka dalam cinta ini adalah Rasulullah Muhammad : { قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ } \"Katakanlah: “Jika kamu (benar-benar) mencintai Allah, ikutilah aku, niscaya Allah mengasihi\" [Ali-Imran : 31]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Kemudian Allah memberi penjelasan hukum orang-orang yang murtad (berkhianat) setelah adanya penjelasan tentang hukum berdekatan dengan orang kafir, “Wahai orang-orang mukmin, barangsiapa di antara kalian ada yang kembali dari agama Islam menuju kekufuran, maka Allah akan mendatangkan kaum lain yang lebih baik dari kalian yang mana Allah meridhai mereka, dan mereka ikhlas kepada Allah dalam beramal dan menaatinya dalam setiap perintah dan laranganNya yang mana mereka berendah hati dengan saudara mukmin mereka, dan tegas dengan orang-orang kafir. Mereka berperang untuk meninggikan kalimat Allah dam tidak takut dengan cemoohan orang tentang pertolongan mereka atas agamanya, bahkan mereka semakin solid. Itulah keutamaan Allah yang diberikan kepada hamba-hambaNya yang dikehendaki. Allah itu Maha Luas keutamaanNya dan Maha Mengetahui orang yang berhak menerima nikmat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, siapa di antara kalian yang murtad dari agamanya} di antaara kalian kembali dari agama Islam menjadi kafir {maka Allah akan mendatangkan suatu kaum yang Dia mencintai mereka dan mereka pun mencintaiNya, yang bersikap lemah lembut terhadap orang-orang mukmin} bersikap lemah lembut dan menyayangi orang-orang mukmin {dan bersikap tegas} bersikap tegas dan kaku {terhadap orang-orang kafir. Mereka berjihad di jalan Allah dan tidak takut pada celaan orang yang mencela} mereka tidak takut rintangan orang yang merintangi di jalan Allah {Itulah karunia Allah yang Dia berikan kepada siapa saja yang Dia kehendaki. Allah Maha luaslagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Allah memberitkan bahwa Dia MahaKaya terhadap alam semesta dan bahwa barang siapa yang murtad dari agamanya, maka Dia tidak merugikan Allah sedikitpun, akan tetapi merugikan dirinya sendiri. Dan bahwasanya Allah mempunyai hamba-hamba yang ihklas, dan jujur dalam imannya dan Allah yang Maha Pengasih Lagi Maha Penyayang telah menjamin hidayah bagi mereka. Mereka adalah makhluk dengan sipat yang sempurna dengan jiwa yang paling kuat, dan dengan ahklak yang paling baik. Sipat pertama mereka yang paling mulia adalah bahwa Allah “ mencintai mereka dan bahwa mereka mencintai Allah.” Karena kecintaan Allah kepada seorang hamba adalah nikmat yang paling mulia yang di berikan kepadanya dan keutamaan yang paling utama yang Dia anugrahkan kepadanya. Jika Allah mencintai seorang hamba, maka dia akan memudahkan sebab-sebab untuk meraih yang benar, memudahkan semua baginya yang sulit, memberinya taufik untuk melakukan kebaikan dan meninggalkan kemungkaran dan menyambut hati hamba-hambaNya dengan kecintaan dan kasih sayang. Di antara konsekuensi kecintaan seorang hamba kepada Tuhannya adalah bahwa Dia harus siap mengikuti RasulNya, lahir dan batin, pada perkataan, perbuatan, dan seluruh kepadaanya sebagaimana firman Allah, \"katakanlah: jika kalian mencintai Allah maka ikutilah aku, maka Allah akan mencintai kalian\" (Ali-Imran: 31). Sebagaimana konsekuensi kecintaan Allah kepada hambanya adalah seorang hamba memperbanyak mendekatkan diri kepada Allah dengan oabadah-ibadah fardu dan ibadah-ibadah Sunnah sebagaimana sabda Nabi dalam hadits shahih dari Allah, “ Tidaklah hambaKu mendekatkan diri kepadaKu dengan sesuatu yang lebih aku cintai daripada dengan sesuatu yang telah aku wajibkan kepadanya. HambaKu senantiasa mendekatkan diri kepadaKu dengan ibadah-ibadah Sunnah sehingga aku mencintainya. Jika Aku mencintaiNya maka Aku akan menjadi pengdengarannya yang denganya dia medengarkan, penglihatan yang dengannya dia melihat, tangannya yang dengan tangannya dia bekerja dan kakiNya yang dengannya dia berjalan. Jika dia meminta kepadaKu, niscaya Aku memberinya, dan jika dia memohon perlindungan kepadaKu niscaya Aku melindunginya.” Diantara konsekuensi kecintaan kepada Allah adalah mengenal Allah, memperbanyak dzikit kepadaNya, karena kecintaan tanpa mengenal sangatlah kurang bahkan tidak ada walaupun dia di klaim, dan barang siapa yang mencintai Allah, maka Dia akan banyak menyebutNya. Dan jika Allah mencintai seorang hamba, maka Dia meneriman amal yang sedikit dan memaafkan kesalahan yang banyak. Yang kedua dari sipat mereka adalah, “ bersikap lemah lembut terhadap orang-orang Mukmin dan bersikap keras terhadap orang-orang kafir.” Mereka bersikap lembut kapada orang-orang Mukmin, mencintai, memberi nasihat, bersikap lunak dan halus, mengasihi, menyayangi, memperlakukan orang-orng Mukmin dengan baik dana pa yang diharapkan dari mereka begitu dekat di gapai. Sebaliknya mereka bersikap keras terhadap orang-orang yang kafir kepada Allah, yang menetang ayat-ayatNya yang medustakan RasulNya. Semangat dan keiman mereka terkonsentrasi pada permusuhan terhadap mereka. Mereka mengeluarkan segala upaya demi meraih sarana yang menjadi kemenangan atas mereka Firman Allah, \"Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi dan dari kuda-kuda yang ditambat untuk berperang (yang dengan persiapan itu) kamu menggentarkan musuh Allah dan musuhmu\" (Al Anfal: 60). Dan \"dia adalah keras terhadap orang-orang kafir, tetapi berkasih sayang sesama mereka\" (Al-Fath:29). Bersikap keras dan tegas kepada musuh-musuh Allah termasuk perkara yang mendekatkan seorang hamba kepada Allah, seorang hamba menyepakati Tuhannya dalam kemarahanNya kepada mereka. Sikap keras dan tegas tidak menghalanginya mengajak mereka ke dalam agama Islam dengan cara yang lebih baik. Keras terhadap mereka sekaligus lunak dalam mendakwahi mereka, keduanya bermanfaat dan bermaslahat bagi mereka. Yang ketiga, “ berjiahad di jalan Allah,” dengan harta dan jiwa mereka, dengan ucapan dan perbuatan mereka. “ Tidak takut kepada celaan orang-orang yang suka mencela,” justru mereka mendahulukan rida Allah dan takut kepada celaaNya daripada celaan mahkluk. Ini membuktikan kuatnya semangat dan keinginan mereka, karena orang yang hatinya lemah, maka semangatnya juga lemah. Semangatnya akan goyah jika Dia mengahapai orang yang mencela, dan kekuatannya akan luluh jika dia menjadi sasaran cibiran. Di dalam hati merekaterdapat penghambaan kepada selain Allah sesuai dengan kadar perhatiannya kepada kerelaan mahkluk, mendahulukan keridhaan mereka dan celaan mereka atas perintah Allah. Hati seseorang tidak akan bersih dari penghambaan kepada selain Allah, sehingga ia tidak takut celaan orang yang mencela di jalan Allah. Manakala Allah menyanjung mereka dengan sipat-sipat yang luhur dan perangai yang mulia yang Dia berikan kepada mereka, di mana sipat dan perangai itu menuntut sipat-sipat lain yang belum di sebut, maka Dia memberitakan bahwa hal itu termasuk karunia dan kebaikanNya kepada mereka agar mereka tidak membanggakan diri mereka, dan agar mereka mensyukuru apa yang telah manganugrahkan itu kepada mereka supaya Dia menambah karunia itu. Dia samping itu agar selain mereka mengetahui bahwa karunia Allah tidak terdapat penghalang padanya. Dia berfirman, “ Itulah karunia Allah, diberikanNya kepada siapa yang dikehendakiNya, dan Allah Maha Luas pemberianNya Lagi Maha Mengetahui.” Maksudnya, luas karunia dan kebaikanNya, besar nikmatNya, dan rahmatNya meliputi segala sesuatu, melapangkan karuniaNya kepada para waliNya yang tidak di berikanNya kepada selain mereka. Akan tetapi Dia mengetahui siapa yang berhak mendapatkan karunia itu, maka Dia memberiNya. Allah kebih mengetahui dimana Dia meletakakan risalahnya; pokok maupun cabangnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 54: Di dalamnya terdapat pemberitahuan Allah terhadap sesuatu yang mungkin terjadi, sebagaimana murtadnya orang-orang yang sudah masuk Islam setelah Nabi Muhammad shallallahu 'alaihi wa sallam wafat sehingga mereka diperangi oleh Abu Bakar Ash Shiddiq. Sebelum terjadi perbuatan itu (murtad), Allah Subhaanahu wa Ta'aala mengingatkan dalam ayat ini agar mereka jangan sampai kembali kafir. Di samping itu, yang demikian tidaklah merugikan Allah sedikit pun, bahkan Allah akan mendatangkan pengganti mereka, yaitu orang-orang yang Allah mencintai mereka dan mereka pun mencintai Allah. Sesungguhnya cinta Allah kepada hamba merupakan nikmat yang paling besar dan keutamaan yang paling utama yang Allah berikan kepada hamba. Jika Allah mencintai seorang hamba, maka Allah akan memudahkan semua sebab baginya, memudahkan yang susah, memberinya taufik untuk mengerjakan kebaikan dan meninggalkan kemungkaran dan menjadikan manusia cinta kepadanya. Faedah: Seseorang apabila ingin dicintai Allah harus mengikuti Rasulullah shallallahu 'alaihi wa sallam baik zahir maupun batin, baik dalam ucapan maupun perbuatan dan dalam semua keadaannya (lihat Ali Imran: 31). Di antara contoh sebab agar dicintai Allah adalah membaca Al Qur’an dengan mentadabburi dan memahami maknanya, mendekatkan diri kepada Allah dengan melakukan amalan sunnah setelah amalan wajib, selalu berdzikr kepada Allah, mendahulukan apa yang dicintai Allah apabila dihadapkan dua hal yang dicintainya, mempelajari nama Allah dan sifat-Nya, memperhatikan nikmat Allah baik yang nampak maupun tersembunyi serta memperhatikan pemberian-Nya kepada kita agar membantu kita bersyukur, pasrah kepada Allah dan menampakkan sikap butuh kepada-Nya, qiyamullail di sepertiga malam terakhir dengan disudahi istighfar dan taubat, duduk bersama orang-orang shalih yang cinta karena Allah serta mengambil nasehat dari mereka dan menjauhi sebab yang menghalangi hati dari mengingat Allah. Ada yang mengatakan, bahwa mereka ini adalah Abu Bakar Ash Shiddiq dan kawan-kawannya ketika memerangi orang-orang yang murtad. Ada pula yang mengatakan, bahwa mereka ini adalah kaum Abu Musa Al Asy'ariy. Demikian pula orang yang mencintai Allah dan memiliki sifat-sifat di atas. Berdasarkan ayat ini, bersikap lemah lembut kepada kaum mukmin dan bersikap keras kepada orang-orang kafir termasuk amalan yang mendekatkan diri kepada Allah. Namun demikian, sikap keras terhadap orang-orang kafir tidaklah menghalangi kita untuk mendakwahi mereka dengan cara yang baik. Mereka lebih mendahulukan ridha Tuhan mereka, takut celaan-Nya daripada celaan orang yang mencela. Hal ini menunjukkan kuatnya pendirian dan tekad mereka. Adapun orang yang lemah hatinya, maka lemah pula pendiriannya, semangatnya mengendor ketika dicela, pendiriannya lemah ketika dicela dan tekadnya menciut. Hal ini mewnunjukkan bahwa dalam hati mereka terdapat peribadatan kepada selain Allah sesuai keadaan hatinya yang memperhatikan perasaan makhluk, menunjukkan sikap mereka mendahulukan keridhaan manusia dan takut celaan mereka. Oleh karena itu, seorang hamba belum lepas dari peribadatan kepada selain Allah, sampai ia tidak takut celaan orang yang mencela dalam menjalankan agama Allah. Yakni semua sifat mulia tersebut merupakan karunia Allah kepada mereka agar mereka tidak ujub terhadap diri mereka dan agar mereka mensyukuri nikmat tersebut. Siapa yang layak memperoleh karunia tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 54",
    "description": "Bila sebelumnya dijelaskan tentang larangan untuk tidak menjadikan orang yahudi dan nasrani sebagai teman setia serta tentang buruknya sikap kaum munafik, maka ayat-ayat berikut berbicara tentang orang mukmin. Wahai orang-orang yang beriman! barang siapa di antara kamu yang murtad atau keluar dari agamanya, maka ketahuilah bahwa kelak Allah akan mendatangkan suatu kaum yang benar-benar beriman untuk menggantikanmu. Dia mencintai mereka dan mereka pun mencintai-Nya dengan segenap keikhlasannya, dan mereka juga selalu bersikap lemah lembut terhadap sesama orang-orang yang beriman, tetapi sebaliknya, mereka akan bersikap keras terhadap orang-orang kafir. Selain itu, mereka juga merupakan umat yang selalu siap untuk berjihad di jalan Allah, dan mereka juga termasuk orang-orang yang tidak takut kepada celaan orang yang dengki dan tidak senang yang suka mencela. Itulah salah satu bentuk karunia Allah yang diberikan-Nya kepada siapa yang dia kehendaki dari makhluk-Nya. Karena itu ketahui dan pahami bahwa Allah itu mahaluas pemberian-Nya, lagi maha mengetahui. Allah sangat mencela orang yang menjadikan kaum yahudi dan nasrani sebagai teman setia atau penolongnya, karena sesungguhnya penolongmu yang dapat diandalkan itu hanyalah Allah, rasul-Nya, dan orang-orang yang beriman, yang melaksanakan salat secara rutin, dan menunaikan zakat dengan ikhlas, seraya tunduk dan patuh kepada Allah."
  }
]