[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya penolong kalian (wahai kaum Mukminin), hanyalah Allah, RasulNya dan kaum mukminin yang menjaga shalat-sahalat wajib mereka, membayarkan zakat dengan keridoan jiwanya ,sedang mereka itu tunduk kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. \"Orang-orang Yahudi, orang-orang Nasrani, dan orang-orang kafir lainnya bukanlah wali kalian. Sesungguhnya wali dan penolongmu hanyalah Allah, rasul-Nya, dan orang-orang mukmin yang menunaikan salat secara sempurna, membayarkan zakat harta mereka, dan tunduk serta patuh kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Hanya Allah-lah penolong Rasulullah dan orang-orang beriman yang senantiasa menjaga shalat dengan mendirikannya pada waktu-waktu yang telah ditetapkan, menyempurnakan bersucinya, dan rukun-rukunnya; dan membayar zakat kepada orang-orang yang berhak menerimanya sebagaimana yang diwajibkan oleh Allah; serta senantiasa ruku' dan tunduk kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. إِنَّمَا وَلِيُّكُمُ اللهُ (Sesungguhnya penolong kamu hanyalah Allah) Dan Dia-lah penolong yang wajib dijadikan sebagai penolong yang sesungguhnya. وَهُمْ رٰكِعُونَ (seraya mereka tunduk) Yakni taat dan tunduk kepada Allah. Yakni mereka menegakkan shalat dengan penuh kekhusyu’an dan ketundukan; tidak menyombongkan diri dihadapan orang-orang beriman; menunaikan zakat dengan menyalurkannya kepada yang berhak, tanpa bersikap congkak pada orang-orang fakir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Wahai orang-orang mukmin, tiada penolong bagi kalian selain Allah, rasulallah, dan orang-orang beriman yang menunaikan shalat dengan sempurna pada waktunya, menunaikan zakat yang diwajibkan untuk orang-orang yang berhak menerimanya, mereka itu adalah orang-orang yang tunduk kepada perintah Tuhannya, sehingga tidak akan meremehkan orang fakir. Al-Wali adalah orang yang harus didekati, dan yang dimaksud dengan ruku’ disini adalah khusyu’ dan khudhu’. Ayat-ayat ini turun untuk orang-orang dari beberapa suku yang mengkhianati janji Nabi SAW Mereka itu ialah Bani Midlaj, Bani Hanifah dan Bani Asad. Jabir berkata: “Ayat ini turun terkait Abdullah bin Salam dan para sahabatnya yang mengeluh kepada Nabi tentang datangnya bani Quraidzah dan Bani Nadhir kepada mereka, dan bersumpah tidak akan duduk bersama mereka, Lalu Ibnu Salam berkata:”Kami ridha dengan Allah, rasulullah dan orang-orang mukmin sebagai wali (kami)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya penolong kalian adalah Allah, RasulNya, dan orang-orang yang beriman yang menegakkan shalat dan menunaikan zakat dan mereka tunduk} tuntuk kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. ketika Allah melarang mengangkat orang kafir, Yahudi, Nasrani dan lain-lain sebagai pemimpin dan menjelaskan akibat dari pengangkatan itu yaitu kerugian yang nyata, maka Allah menjelaskan siapa yang wajib dan harus di pilih menjadi pemimpin dan sekaligus menjelaskan manfaat dan apa nasihatnya. Dia berfirman, “Sesungguhnya penolong (wali) kamu hanyalah Allah dan RasulNya.” Perwalian Allah didapat dengan iman dan takwa. Siapa pun yang beriman dan bertakwa, maka dia adalah wali Allah, siapa yang menjadi wali Allah, maka dia adalah wali RasulNya. Barangsiapa yang berwala’ kepada Allah dan RasulNya, maka termasuk kesempurnaan hal itu adalah mengangkat siapa yang diangkat oleh keduanya yaitu orang-orang Mukmin orang yang menjunjung iman lahir dan batin dan mengikhlaskan diri kepada Allah dengan mendirikan shalat lengkap dengan syarat-syaratnya, kewajiban-kewajibannya dan pelengkap-pelengkapnya, mereka juga berbuat baik kepada makhluk dengan membayarkan zakat harta mereka kepada yang berhak dari mereka. firmanNYa, “seraya mereka tunduk (kepada Allah),” yakni patuh dan pasrah kepadaNya. Perangkat pembatas (adat al-Hashr) pada FirmanNya, “Sesungguhnya penolong kamu hanyalah Allah, RasulNya, dan orang-orang yang beriman,” menunjukkan bahwa perwalian harus dibatasi hanya pada mereka yang disebutkan dan anti (bara’) dari perwalian kepada selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 55: Setelah menyebutkan larangan memberikan walaa' (kesetiaan) kepada orang-orang kafir, maka dalam ayat ini Allah Subhaanahu wa Ta'aala menerangkan siapa sebenarnya yang berhak diberikan wala'. Tentang turun ayat ini ada yang berpendapat, bahwa ayat ini turun berkenaan dengan Abdullah bin Salam ketika ia dijauhi oleh orang-orang Yahudi Bani Quraizhah dan Bani Nadhir. Ada pula yang berpendapat, bahwa ayat ini turun berkenaan dengan Ubadah bin Ash Shaamit ketika ia berlepas diri dari orang-orang Yahudi, wallahu a'lam. Yakni khusyu' atau menambah dengan shalat sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 55",
    "description": "Allah sangat mencela orang yang menjadikan kaum yahudi dan nasrani sebagai teman setia atau penolongnya, karena sesungguhnya penolongmu yang dapat diandalkan itu hanyalah Allah, rasul-Nya, dan orang-orang yang beriman, yang melaksanakan salat secara rutin, dan menunaikan zakat dengan ikhlas, seraya tunduk dan patuh kepada Allah tuntunan Al-Qur'an tentang penolong dan pemimpin mesti dipahami dan diikuti, karena itu barang siapa yang menjadikan Allah, rasulnya, dan orang-orang yang beriman sebagai penolongnya dalam menyelesaikan segala urusannya, maka sungguh mereka akan mendapatkan bukti bahwa pengikut agama Allah itulah yang akan menangq."
  }
]