[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa percaya kepada Allah dan setia kepada Allah, RasulNya dan kaum mukminin, niscaya dia termasuk pengikut golongan Allah dan golongan Allah itulah orang-orang yang (pasti) menang lagi mendapat pertolongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Barangsiapa yang menjadikan Allah, rasul-Nya, dan orang-orang mukmin sebagai walinya dengan memberikan dukungan dan pertolongannya maka dia termasuk golongan Allah. Dan golongan Allah adalah golongan yang menang. Karena Allah-lah sang penolong mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Allah menjanjikan orang-orang yang menjadikan Allah, rasul-Nya dan hamba-hamba-Nya yang beriman sebagai kekasih dan pemimpin berupa kemenangan dan kejayaan. Karena golongan Allah pasti akan menang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَمَن يَتَوَلَّ اللهَ وَرَسُولَهُۥ (Dan barangsiapa mengambil Allah dan Rasul-Nya sebagai penolong) Ini merupakan janji Allah bagi orang-orang yang menjadikan Allah, Rasulullah dan orang-orang beriman sebagai penolong bahwa mereka akan menang dan unggul atas musuh mereka. فَإِنَّ حِزْبَ اللهِ هُمُ الْغٰلِبُونَ (maka sesungguhnya pengikut (agama) Allah itulah yang pasti menang) Pengikut Allah adalah orang-orang beriman yang senantiasa membela syari’at Allah. Sebab turunnya ayat ini adalah ketika Bani Qainuqa’ memerangi Rasulullah, Abdullah bin Ubay tetap berpegang pada sekutunya dari bani Qainuqa’, adapun Ubadah bin Shamit bergabung bersama Rasulullah dan berlepas diri dari sekutunya padahal ia memiliki sekutu yang sama banyaknya dengan sekutu yang dimiliki Abdullah bin Ubay, namun ia tetap meninggalkan mereka untuk bergabung bersama Rasulullah, ia berkata: aku berlepas diri dari sekutuku yaitu orang-orang kafir menuju Allah dan Rasul-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ini adalah kabar gembira yang besar bagi siapa yang menjalanakan perintah Allah dan menjadi bagian dari pejuang agama-Nya, bahwasanya ia akan meraih kemenangan, meskipun terkadang ia menghadapi rintangan (tentunya dengan hikmah yang Allah berikan) tetapi segala urusan-urusannya yang lain akan senantisa meraih kemenangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Barangsiapa meminta pertolongan kepada Allah, rasulullah, dan orang-orang mukmin yang mau menolong syariat Allah, maka sesungguhnya para penolong agama Allah itu adalah orang-orang yang menang dengan adanya dukungan Allah terhadap mereka karena telah menolong agamaNya. Sebab turunnya adalah keteguhan Abdullah bin Ubay dengan bersekutu dengan Bani Qaynuqa’, lalu Ubadah keluar dari persekutuan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa yang menjadikan Allah, Rasul-Nya, dan orang-orang yang beriman sebagai penolongnya, sesungguhnya para pengikut Allah} penolong agama Allah {itulah orang-orang yang menang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Kemudian Dia menyebutkan manfaat perwalian ini, Dia berfirman, “Dan barangsiapa menjadikan Allah, RasulNya dan orang-orang yang beriman sebagai penolongnya, maka sesungguhnya pengikut (agama) Allah itulah yang pasti menang,” yakni ia termasuk pengikut yang disandarkan kepada Allah dengan penyandaran ubudiyah dan perwalian. Dan pengikutNya adalah orang-orang yang menang yang meraih akibat baik di dunia dan di akhirat, sebagaimana Firman Allah, \"dan sesungguhnya tentarakulah mereka yang menang\" (Ash-Shaffat:173). Ini adalah berita gembira yang besar bagi orang yang menegakkan agama Allah dan dia termasuk pengikut dan tentaraNYa. Dia mendapatkan kemenangan walaupun terkadang dia kalah karena hikmah yang diinginkan oleh Allah, tetapi ujungnya tetaplah kemenangan dan kejayaan. Dan siapa yang lebih benar perkataannya daripada Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 56: Yaitu orang-orang yang menjadikan Allah, Rasul-Nya dan orang-orang yang beriman sebagai penolongnya atau ia hanya memberikan wala' (kesetiaan) dan pembelaan kepada mereka, tidak kepada orang-orang kafir. Ayat ini merupakan kabar gembira bagi orang yang menjalankan perintah Allah dan masuk ke dalam pengikut agama-Nya dan sebagai tentara-Nya, bahwa ia akan memperoleh kemenangan meskipun terkadang mengalami kekalahan karena hikmah Allah, namun di akhirnya ia akan memperoleh kemenangan, dan siapakah yang lebih benar perkataannya daripada Allah?."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 56",
    "description": "Tuntunan Al-Qur'an tentang penolong dan pemimpin mesti dipahami dan diikuti, karena itu barang siapa yang menjadikan Allah, rasulnya, dan orang-orang yang beriman sebagai penolongnya dalam menyelesaikan segala urusannya, maka sungguh mereka akan mendapatkan bukti bahwa pengikut agama Allah itulah yang akan menangq pada ayat-ayat yang lalu Allah melarang orang beriman untuk menjadikan orang yahudi dan nasrani sebagai teman akrab, penolong, atau pelindung, sedang pada ayat-ayat berikut dijelaskan tentang sebab-sebabnya. Wahai orang-orang yang beriman! janganlah sekali-kali kamu menjadikan pemimpinmu dari orang-orang yang membuat syariat atau ajaran agamamu jadi bahan ejekan dan permainan, sebab hal ini hanya akan menyebabkan terjadinya pelecehan terhadap tuntunan ilahi. Mereka yang termasuk kelompok demikian adalah sebagian di antara orangorang yang telah diberi kitab sebelummu, yaitu orang yahudi dan nasrani, dan orang-orang kafir yang di antaranya adalah orang musyrik. Karena itu, tetaplah teguh dalam islam dan bertakwalah hanya kepada Allah jika kamu semua memang benar-benar merupakan orang-orang beriman."
  }
]