[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, janganlah kalian menjadikan orang-orang yang memperolok dan mempermainkan agama kalian dari kalangan ahli kitab dan orang-orang kafir sebagai orang yang kalian berikan loyalitas kalian. Dan takutlah kepada Allah jika kalian benar-benar beriman kepada Nya dan kepada syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Wahai orang-orang yang beriman! Janganlah kalian menjadikan orang-orang ahli Kitab sebelum kalian dari kalangan Yahudi dan Nasrani, dan orang-orang musyrik yang suka menghina dan mempermainkan agama kalian sebagai sekutu dan teman setia. Dan bertakwalah kalian kepada Allah dengan menjauhi larangan-Nya, tidak menjadikan orang-orang tersebut sebagai teman setia, jika kalian benar-benar beriman kepada-Nya dan kepada kitab suci yang Dia turunkan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Ini adalah seruan bagi orang-orang beriman yang mengandung larangan dan peringatan agar tidak menjadikan kekasih dan pemimpin dari golongan musuh-musuh Allah yang senantiasa menghina syariat-syariat dan syiar-syiar-Nya, yaitu para Ahli kitab dan orang-orang kafir lainnya. Dan tidak ada hal yang lebih menyakitkan daripada mendengar hinaan dan celaan terhadap sesuatu yang kamu agungkan. Dan orang yang meremehkan dan menghina syiar-syiar Allah tidak layak untuk dijadikan kekasih dan pemimpin. Oleh sebab itu, larangan ini diungkapkan dengan penuh keburukan untuk menjelaskan sebab adanya hukum ini. Dan perintah untuk bertakwa kepada Allah dalam ayat ini mengandung peringatan untuk tidak menjadikan orang-orang kafir sebagai pemimpin dan kekasih, karena ini tidak layak untuk dilakukan oleh orang beriman. Yakni, jika kalian adalah orang-orang yang beriman maka bertakwalah kepada Allah dan janganlah menjadikan orang kafir sebagai pemimpin dan kekasih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَا تَتَّخِذُوا۟ الَّذِينَ اتَّخَذُوا۟ دِينَكُمْ هُزُوًا (janganlah kamu jadikan, orang-orang yang membuat agamamu jadi buah ejekan) Ini merupakan larangan untuk menjadikan orang-orang yang mengejek dan mempermainkan agama sebagai penolong; yakni orang-orang melakukan hal itu dari golongan orang-orang musyrik, ahli kitab, dan ahli bid’ah yang mengaku condong kepada Islam. وَالْكُفَّارَ (dan orang-orang yang kafir) Yakni dan jangan pula jadikan orang-orang kafir lainnya. أَوْلِيَآءَ ۚ (sebagai pemimpin) Yakni yang menolong kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Wahai orang-orang mukmin, janganlah kalian mendukung orang-orang yang menjadikan agama sebagai gurauan dan permainan, dari golongan orang-orang musyrik dan para pendusta, Dan jangan sampai menjadikan mereka penolong yang kalian sukai, sekalipun mereka menunjukkan kecintaan dan kasih sayang kepada kalian, serta takutlah kepada azab Allah karena mendekati mereka, jika kalian benar-benar beriman, karena orang mukmin itu takut kepada Allah dan tidak akan mendukung musuh-musuhNya. Ayat ini turun untuk para lelaki muslim yang senang dengan dua laki-laki yang menampakkan keislamannya kemudian berkhianat (melakukan kemunafikan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian menjadikan orang-orang yang menjadikan agama kalian bahan ejekan} menjadikan agama kalian bahan ejekan {dan permainan di antara orang-orang yang telah diberi kitab sebelum kalian dan orang-orang kafir, sebagai teman setia. Bertakwalah kepada Allah jika kalian adalah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-58. Allah melarang hamba-hambaNya yang beriman untuk mengangkat Ahli KItab, Yahudi dan Nasrani dan orang-orang kafir yang lain menjadi pemimpin, di mana orang-orang Mukmin itu mencintai dan memberikan loyalitas kepada mereka, membocorkan rahasia orang-orang Mukmin kepada mereka, membantu mereka dalam sebagian perkara yang merugikan Islam dan kaum Muslimin. Ilmu yang dimiliki oleh orang-orang yang beriman menuntut mereka untuk tidak mengangkat mereka sebagai pemimpin dan mendorong mereka untuk memusuhi mereka. Begitu pula ketakwaan mereka kepada Allah yang berarti menjalankan perintah-perintahNya dan menghindari larangan-laranganNya, termasuk yang mendorong mereka untuk memusuhi mereka. Begitu pula keadaan orang-orang kafir, orang-orang mesyirik yang memusuhi orang-orang Muslimin; mereka mencaci agama Islam, menjadikannya sebagai bahan pelecehan dan permainan, penghinaan dan peremahan, khususnya shalat, yang merupakan syiat Islam yang paling jelas dan ibadah yang paling mulia. Jika mereka di ajak shalat, mereka menjadikannya sebagai ejekan dan penghinaan, hal itu karena mereka tidak memahami dank arena kebodohan besar mereka, kalau seandaunya mereka mempunyai akal, niscaya mereka akan tunduk kepadanya, dan niscaya mereka mengetahui bahwa ia adalah lebih besar daripada seluruh keutamaan yang menjadi hiasan jiwa. Jika kamu mengetahui wahai orang-orang yang beriman keadaan orang-orang kafir dan kerasnya permusuhan mereka kepadaMu dan kepada agamaMu, maka barangsiapa tidak memusuhi mereka, maka hal itu menunjukan bahwa Islam baginya adalah murah, dia tidak peduli terhadap irang yang menghina agama atau melecehkannya dengan kekufuran dan kesesatan, dia tidak memiliki harga diri sedikit dan kemanusiaan. Bagaimana kamu mengklaim agama yang lurus pada dirirmu, dan bahwa ia adalah agama yang benar dan yang selainnya adalah bathil, semantara kamu rela mengangkat orang yang menjadikan agama sebagai bahan ejekan dan cemoohan sebagai pemimpin, dan dia menggolongkan agama tersebut dan pengikitnya sebagai orang-orang yang bodoh dan dungu? Ini mengandung dorongan yang kuat untuk memusuhi mereka, hal ini diketahui oleh orang-orang yang memiliki pemahaman yang paling ringan sekalipun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 57: Dalam ayat ini, Allah Subhaanahu wa Ta'aala melarang kaum mukmin menjadikan orang-orang Ahli Kitab (Yahudi dan Nasrani) serta orang-orang musyrik sebagai wali, dengan mencintai dan menolong mereka, bersikap setia kepada mereka, menampakkan rahasia kaum muslimin kepada mereka dan menolong mereka dalam hal yang merugikan Islam dan kaum muslimin. Demikian pula, Allah memerintahkan mereka untuk tetap bertakwa kepada Allah dengan menjalankan perintah-Nya dan menjauhi larangan-Nya, di antaranya adalah dengan berlepas diri dari mereka dan memusuhi mereka. Hal itu, karena sikap mereka mencela agama kaum muslimin, menjadikannya bahan ejekan dan permainan, menghina dan meremehkan, yang salah satunya adalah ibadah shalat yang menjadi syi'ar besar kaum muslimin, di mana mereka mengejeknya saat azan shalat dikumandangkan. Hal ini tidak lain karena kurang akal dan bodohnya mereka. Oleh karena itu, jika mereka masih diberikan wala' padahal keadaan mereka (Ahli Kitab) seperti ini; yakni memusuhi dan menghina ajaran Islam, maka yang demikian menunjukkan keimanan orang yang memberikan wala' begitu lemah dan tidak memiliki muruu'ah (kehormatan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 57",
    "description": "Pada ayat-ayat yang lalu Allah melarang orang beriman untuk menjadikan orang yahudi dan nasrani sebagai teman akrab, penolong, atau pelindung, sedang pada ayat-ayat berikut dijelaskan tentang sebab-sebabnya. Wahai orang-orang yang beriman! janganlah sekali-kali kamu menjadikan pemimpinmu dari orang-orang yang membuat syariat atau ajaran agamamu jadi bahan ejekan dan permainan, sebab hal ini hanya akan menyebabkan terjadinya pelecehan terhadap tuntunan ilahi. Mereka yang termasuk kelompok demikian adalah sebagian di antara orangorang yang telah diberi kitab sebelummu, yaitu orang yahudi dan nasrani, dan orang-orang kafir yang di antaranya adalah orang musyrik. Karena itu, tetaplah teguh dalam islam dan bertakwalah hanya kepada Allah jika kamu semua memang benar-benar merupakan orang-orang beriman. Selain menjadikan ajaran agama sebagai ejekan, sikap buruk lain dari mereka dan yang sering dapat disaksikan adalah apabila kamu menyeru mereka dengan azan untuk melaksanakan salat, maka mereka akan menjadikannya sebagai bahan ejekan dan permainan. Perilaku mereka yang demikian itu adalah karena sesungguhnya mereka merupakan orangorang yang tidak mengerti."
  }
]