[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang-orang yang berolok-olok dari ahli kitab itu, ”apa yang kalian dapati itu sebagai celaan dan aib adalah pujian bagi kami, yaitu keimanan kami kepada Allah dan kitab-kitabNYa yang diturunkan kepada kami, dan kepada orang-orang sebelum kami, dan keimanan kami bahwa kebanyakan kalian keluar dari jalan yang lurus.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Katakanlah -wahai Rasul- kepada orang-orang ahli Kitab yang suka mengolok-olok itu, “Apakah kalian mencela kami hanya karena kami beriman kepada Allah, kepada kitab suci yang diturunkan kepada kami, kitab suci yang turunkan kepada umat-umat sebelum kami, dan karena kami percaya bahwa sebagian besar dari kalian tidak taat kepada Allah lantaran kalian tidak mau beriman dan enggan menjalankan perintah-Nya?! Celaan yang kalian lontarkan kepada kami itu sejatinya sebuah pujian bagi kami, bukan celaan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Allah memerintahkan Rasulullah untuk bertanya kepada Ahli kitab dengan nada pengingkaran: Mengapa kalian mencela kami? Apakah karena kami beriman kepada Allah serta beriman kepada al-Quran dan kitab-kitab sebelumnya? Atau karena kalian telah keluar dari lingkaran keimanan, dan berpaling dari sunnah-sunnah para nabi dan fitrah keislaman?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. قُلْ يٰٓأَهْلَ الْكِتٰبِ هَلْ تَنقِمُونَ مِنَّآ (Katakanlah: “Hai Ahli Kitab, apakah kamu memandang kami salah) Yakni bukankah kalian menyalahkan, membenci, dan murka kepada kami kecuali karena keimanan kami kepada Allah dan kitab-kitab yang Dia turunkan; padahal kalian mengetahui bahwa kami berada dalam kebenaran. وَأَنَّ أَكْثَرَكُمْ فٰسِقُونَ (sedang kebanyakan di antara kamu benar-benar orang-orang yang fasik?) Karena kalian meninggalkan keimanan dan menolak untuk taat dalam menjalankan perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Wahai nabi, katakanlah: “Wahai orang-orang Yahudi dan Nasrani, apakah kalian membenci kami dan menyalahkan kamu hanya karena keimanan kami kepada Allah, Al-Qur’an dan kitab-kitab yang diturunkan kepada para nabi sedangkan kebanyakan kalian tidak mau menaati Allah dengan tidak mau beriman dan tidak mau mengerjakan perintah-perintah Allah SWT?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Ahlul kitab, apakah kalian memandang salah} mengingkari dan mencela {kami hanya karena beriman kepada Allah, pada apa yang diturunkan kepada kami, dan pada apa yang diturunkan sebelumnya. Sesungguhnya kebanyakan kalian adalah orang-orang fasik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Maksudnya, “katakanlah” wahai Rasul, “Hai ahli kitab,” dengan menegaskan kepada mereka bahwa agama Islam adalah agama yang benar dan bahwaa pelecehan mereka kepadanya adalah pelecehan terhadap agama yang semestinya di sanjung. “ Apakah kamu memandang kami salah, hanya lantaran kami beriman kepada Allah, kepada apa yang di turunkah kepada kami dan kepada yang di turunkan sebelumnya, sedang kebanyakan di anatara kamu benar-benar orang- orang yang fasik?” artinya, apakah kami mempunyai kesalahan kecuali kami iman kepada Allah, kitab-kitabNya yang terdahulu dan yang sekarang dan kepada nabi-nabiNya yang terdahulu dan yang sekarang? Dan bahwa kami meyakini bahwa barangsiapa yang tidak beriman dengan iamn yang seperti ini, maka dia adalah kafir lagi fasik? Apakah kamu memandang kami salah hanya karena kami melakukan hal yang paling wajib atas para kukallaf? Padahal mayoritas dari kalian adalah, “ orang-orang yang fasik,” yakni keluar dari ketaatan kepada Allah, berani melakukan kemaksiatan? Maka kamu lebih baik diam wahai orang fasik. Seandainya kami mencela kami sementara kamu sendiri selamat dari kefasikan dan itu tidak mungkin niscaya keburukannya lebih ringan daripada kamu mnecela kami sementara kamu adalah fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 59: Ayat ini dan ayat setelahnya (59 dan 60) merupakan bantahan terhadap celaan mereka kepada agama Islam dan kaum muslimin. Yakni apakah menurutmu kami salah dan tercela hanya karena kami beriman kepada Allah, semua kitab-Nya dan semua rasul-Nya dan menyatakan bahwa orang yang tidak beriman kepada semua itu kafir lagi fasik? Apakah kamu mencela kami karena melakukan kewajiban yang paling utama ini? Di samping itu, kamu sendiri adalah orang-orang yang fasik, yang seharusnya diam. Jika kamu tidak fasik lalu mencela, maka hal itu lebih ringan daripada kamu mencela sedangkan diri kamu sendiri adalah orang-orang fasik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 59",
    "description": "Karena perilaku yang buruk itu, kemudian Allah memerintahkan kepada nabi Muhammad untuk memperingatkan mereka. Katakanlah, wahai ahli kitab! apakah kamu memandang kami salah dengan semua ajaran islam yang kami laksanakan, apakah kami juga keliru hanya karena kami beriman kepada Allah yang maha esa, percaya kepada apa yang diturunkan kepada kami, yaitu Al-Qur'an, dan juga beriman kepada apa yang diturunkan sebelumnya, yaitu taurat, zabur, dan injil' bila tidak ada alasan yang kuat dari sikap-sikap tersebut, sungguh, kebanyakan dari kamu ternyata adalah orang-orang yang fasik. Sebagai kelanjutan dari teguran itu, Allah memerintahkan rasulnya. Katakanlah, wahai Muhammad, apakah sebaiknya akan aku beritakan kepadamu semua tentang orang yang lebih buruk pembalasannya akibat dari perilakunya yang menyimpang dan perbuatannya yang bertentangan dengan jalan lurus dari balasan orang fasik di sisi Allah' yang dimaksud yaitu orang yang dilaknat dan dimurkai Allah karena melanggar larangan, di antara mereka ada yang dijadikan kera dan ada pula yang dijadikan babi, dan juga orang yang menyembah thagut. Sesungguhnya keadaan mereka itu lebih buruk tempatnya ketimbang orang mukmin dan lebih tersesat dari jalan yang lurus."
  }
]