[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman, bila kalian hendak mendirikan shalat, sedang kalian sedang tidak dalam keadaan suci, maka basuhlah wajah kalian, tangan kalian hingga siku (siku adalah pemisah antara lengan bawah dan lengan atas), dan usaplah kepala kalian, dan basuhlah kaki kalian hingga mata kaki (yaitu, tulang yang menonjol pada pertemuan antara tulang betis dan tulang telapak kaki). Dan apabila kalian terkena hadast besar, maka bersucilah dengan cara mandi darinya sebelum mengerjakan shalat. Dan apabila kalian sedang sakit atau dalam perjalanan jauh saat sehat, atau salah seorang diantara kalian membuang hajatnya atau sehabis mencampuri istrinya, kemudian kalian tidak menjumpai air, maka tepuklah kedua telapak tangan kalian ke permukaan tanah dan usaplah muka dan tangan kalian dengannya. Allah tidak menghendaki pada urusan bersuci ini untuk tidak mempersulit kalian. Bahkan sebaliknya, Dia membolehkan tayamum demi melonggarkan kalian dan sebagai rahmat bagi kalian, sebab dia menjadikannya sebagai pengganti air untuk bersuci. Maka rukhsah (keringanan) untuk bertayamum termasuk kesempurnaan nikmat-nikmat yang menuntut sikap bersyukur kepada Dzat yang memberikannya, dengan cara taat kepadaNya dalam perkara yang Dia perintahkan dan dalam perkara yang Dia larang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Wahai orang-orang yang beriman kepada Allah! Apabila kalian hendak menunaikan salat dan kalian sedang berhadas kecil, maka berwudulah. Yaitu dengan cara membasuh wajah kalian, membasuh tangan beserta sikunya, mengusap kepala dan membasuh kaki kalian beserta mata kaki yang menonjol di pergelangan kaki. Tetapi bila kalian berhadas besar, maka mandilah. Dan jika kalian menderita sakit yang kalian takutkan akan bertambah parah atau tertunda kesembuhannya (bila terkena air), atau kalian sedang bepergian dalam keadaan sehat walafiat, atau kalian sedang berhadas kecil karena buang hajat misalnya, atau berhadas besar karena bersetubuh dengan istri, dan kalian tidak menemukan air untuk bersuci setelah berusaha mencarinya, maka pergilah menuju permukaan tanah kemudian tepuklah dengan kedua telapak tangan kalian dan usapkanlah ke wajah kalian dan usapkanlah ke kedua tangan kalian. Allah tidak ingin menyulitkan kalian dalam ketentuan hukum-hukum-Nya dengan (tidak) mewajibkan kalian (bersuci dengan) menggunakan air bila membahayakan kalian. Maka Dia menetapkan syariat baru sebagai penggantinya ketika ada kesulitan dalam menggunakan air karena sakit atau tidak ada air. Hal itu dalam rangka menyempurnakan nikmat-Nya kepada kalian, supaya kalian bersyukur atas nikmat yang telah Allah berikan kepada kalian, dan tidak mengingkarinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Ini merupakan seruan Allah kepada orang-orang beriman untuk menjelaskan syariat wudhu jika hendak mendirikan salat. Sebab keadaan suci dari hadast merupakan salah satu syarat sahnya shalat, tanpa bersuci shalat itu tidak akan sah dan tidak akan diterima, dan ini berlaku pada semua shalat. Allah memerintahkan untuk mencuci muka, dan kedua tangan sampai siku. Adapun batas wajah yang harus dicuci adalah dari telinga kiri sampai telinga kanan dan dari batas rambut di dahi sampai dagu. Wajah dan kedua tangan wajib dicuci, sedangkan kepala harus dibasuh dengan air secara keseluruhan atau sebagian. Firman Allah: (وأرجلكم إلى الكعبين) berhubungan dengan perintah (فاغسلوا وجوهكم وأيديكم إلى المرافق), sehingga kewajiban terhadap kaki ketika berwudhu adalah dengan mencucinya karena keterhubungan dua ibarat ini menunjukkan kesamaan hukumnya. Dan Allah memerintahkan untuk mandi junub setelah keluarnya mani atau melakukan hubungan intim. Dalam ayat ini Allah juga menjelaskan hikmah wudhu, yaitu untuk kebersihan diri dan memberi kemudahan kepada umat serta untuk menyempurnakan kenikmatan bagi mereka. Allah memberi kemudahan bagi hamba-hamba-Nya berupa syariat yang mengandung kesucian, kemuliaan, kebaikan, dan keselamatan bagi mereka, yang berbentuk syariat bersuci ketika akan mendirikan shalat, karena shalat merupakan wasilah untuk berhubungan dengan Yang Maha Kuasa; sehingga seorang hamba wajib untuk menyiapkan kesucian jiwa dan raganya ketika akan mendirikan shalat, agar menjadi orang yang layak untuk berdiri di kedudukan yang suci dan agar tetap berada dalam tuntunan Allah dan rasul-Nya. Allah mensyariatkan tayammum untuk memberi kemudahan bagi hamba-hamba-Nya yang beriman dan mengangkat kesusahan dari mereka apabila mereka tidak mendapatkan air, atau ketika sedang sakit, atau saat cuaca yang sangat dingin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِذَا قُمْتُمْ إِلَى الصَّلَوٰةِ (apabila kamu hendak mengerjakan shalat) Melakukan wudhu disetiap akan melakukan shalat hukumnya sunnah. Diwajibkannya wudhu hanya ketika ia dalam keadaan berhadast. Anas bin Malik berkata: “dahulu Rasulullah berwudhu setiap akan melakukan shalat”. Maka Anas bin Malik ditanya: “lalu apa yang dulu kalian (para sahabat) lakukan?” ia menjawab: “kami dahulu melakukan shalat dengan satu wudhu selama kami belum berhadast”. فَاغْسِلُوا۟ وُجُوهَكُمْ (maka basuhlah mukamu) Yakni dengan air. Pendapat menyebutkan berkumur dan menghirup air lewat hidung termasuk dari membasuh muka. Terdapat juga dalil yang menunjukkan disyari’atkannya menyela-nyela jenggot dengan air ketika berwudhu. وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ (dan tanganmu sampai dengan siku) Makna (المرفق) yakni sendi yang ada diantara lengan dan bahu. Apabila seseorang berwudhu hendaklah ia memutar (membasuh-basuhkan) air di kedua sikunya. وَامْسَحُوا۟ بِرُءُوسِكُمْ (dan sapulah kepalamu) Yakni mengusap kepada dengan air. وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ (dan kakimu sampai dengan kedua mata kaki) Yakni dan basuhlah (cucilah) kaki kalian sampai kedua mata kaki. Dan disetiap kaki terdapat dua mata kaki, yakni dua tulang yang menonjol yang ada di tulang betis bagian bawah. Dan hukum mengusap air diatas terumpah (alas kaki) banyak disebutkan dalam hadist-hadist mutawatir. وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا۟ ۚ( dan jika kamu junub maka mandilah) Yakni mandilah dengan air. وَإِن كُنتُم مَّرْضَىٰٓ أَوْ عَلَىٰ سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ الْغَآئِطِ (dan jika kamu sakit atau dalam perjalanan atau kembali dari tempat buang air) Penjelasan tafsir ayat ini telah disebutkan dalam surat an-Nisa: 43 dengan lengkap. Begitu pula telah dijelaskan hukum menyentuh perempuan, bertayammum, dan penjelasan tentang tanah untuk bertayammum. مَا يُرِيدُ اللهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ (Allah tidak hendak menyulitkan kamu) Yakni Allah tidak menghendaki dalam perintahnya untuk bersuci dengan air atau tanah sebagai hal yang menyusahkan kalian dalam menjalankan agama. وَلٰكِن يُرِيدُ لِيُطَهِّرَكُمْ(tetapi Dia hendak membersihkan kamu) Yakni dari segala kotoran dan dosa. وَلِيُتِمَّ نِعْمَتَهُۥ عَلَيْكُمْ(dan menyempurnakan nikmat-Nya bagimu) Yakni dengan memberi kalian keringanan dengan bertayammum ketika tidak terdapat air, atau kenikmatan pahala atas pelaksanaan syari’at-syari’at yang Dia perintahkan. لَعَلَّكُمْ تَشْكُرُونَ(supaya kamu bersyukur) Yakni bersyukur atas nikmat Allah yang Dia berikan kepada kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat wudhu' memberi pelajaran penting bagi kita : ada tujuh ushul penting yang terkandung di didalamnya, dan setiap ushul terbagi menjadi dua bagian : dua suci : wudhu' dan tayammum, dan dua dzat yang mensucikan : air dan debu, dan dua cara : mencuci dan membasuh, dan dua sebab diwajibkannya bersuci : hadats dan junub, dan ada dua hal yang membolehkannya tayammum : sakit dan safar. Dan dua kinayah : ghait dan mulamasah. Dan dua karomah : pensucian dosa dan kecukupan nikmat. 2 ). Pada akhir ayat dari ayat wudhu : { مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَٰكِنْ يُرِيدُ لِيُطَهِّرَكُمْ } \"Allah tidak hendak menyulitkan kamu, tetapi Dia hendak membersihkan kamu\", adalah dalil bahwa apa yang sulit dihindari oleh setiap muslim dari pembatal-pembatal wudhu, dan penghalang kesempurnaan kesucian diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6 Hai orang-orang yang beriman, apabila kamu hendak mengerjakan shalat, maka berwudhulah ketika kalian sedang berhadas. Basuhlah mukamu dengan air. Wajah dibasuh mulai awal tumbuhnya rambut sampai sepanjang bawah janggut juga hingga antara dua telinga. Juga basuhlah tanganmu sampai dengan siku, Siku adalah penyambung antara lengan atas dan lengan bawah, serta sapulah kepalamu atau sebagiannya dengan air. Dan basuh kakimu sampai dengan kedua mata kaki, yaitu dua tulang yang menonjol pada bawa tulang kering. Jika kamu keadaan junub sebab jima’ atau mengeluarkan mani, maka mandilah dengan air. Jika kamu sakit yang parah jika terkena air atau dalam perjalanan atau kembali dari tempat buang air (kakus) atau menyentuh perempuan (menurut Syafii), lalu kamu tidak memperoleh air, maka bertayammumlah dengan tanah/debu yang baik/bersih pada wajah, dan dua tangan dengan dua kali sapuan; sapulah mukamu dan tanganmu dengan tanah itu. Satu sapuan untuk wajah dan sisanya untuk dua lengan, atau untuk dua telapak tangan menurut Maliki dan Hambali. Allah tidak hendak menyulitkan kamu dengan air ataupun debu, tetapi Dia hendak membersihkan kamu dari dosa dan menyempurnakan nikmat-Nya bagimu dengan menentukan syariat hukum Islam, diantaranya berupa keringanan untuk bertayamum jika tidak ada air, supaya kamu bersyukur atas nikmat Allah dan memberi pahala atas rasa syukurmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila kalian berdiri} Ketika kalian hendak mendirikan {melaksanakan shalat, maka basuhlah wajah kalian dan tangan kalian sampai ke siku serta usaplah kepala kalian dan kedua kaki kalian sampai kedua mata kaki. Jika kalian dalam keadaan junub} dalam keadaan junub {maka bersucilah {mandilah} Jika kalian sakit, dalam perjalanan, kembali dari tempat buang air} tempat menunaikan hajat {atau menyentuh} berjimak {perempuan, lalu tidak mendapati air, maka bertayamumlah} maka sederhanakanlah {dengan debu} debu {yang baik} suci {maka usaplah wajah kalian dan tangan kalian dengan itu. Allah tidak ingin menjadikan bagi kalian sedikit pun kesulitan} kesulitan{tetapi Dia hendak membersihkan kalian dan menyempurnakan nikmatNya bagi kalian agar kalian bersyukur"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 6: Imam Bukhari meriwayatkan dari Aisyah radhiyallahu 'anha, ia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wa sallam dalam sebagian safar Beliau, sehingga ketika kami berada di tengah lapangan atau berada dalam pasukan, tiba-tiba kalungku lepas, maka Rasulullah shallallahu 'alaihi wa sallam mengirim beberapa orang untuk mencari kalung itu, sedangkan sebagian lagi tetap bersama Beliau. Saat itu, mereka tidak berada di dekat air dan tidak ada orang yang membawa air, lalu sebagian orang mendatangi Abu Bakar Ash Shiddiq dan berkata, \"Tidakkah kamu melihat apa yang dilakukan Aisyah, ia telah membuat Rasulullah shallallahu 'alaihi wa sallam diam di tempat, demikian juga para sahabatnya padahal mereka tidak di dekat air dan tidak ada yang memilikinya.\" Maka Abu Bakar datang, sedangkan Rasulullah shallallahu 'alaihi wa sallam tertidur meletakkan kepalanya di pahaku. Abu Bakar berkata, \"Kamu telah membuat Rasulullah shallallahu 'alaihi wa sallam dan para sahabat berhenti, padahal mereka tidak di dekat air dan tidak membawa air.\" Aisyah berkata, \"Abu Bakar mencelaku dan berkata kepadaku apa yang dikehendaki Allah. Ia memicit pinggangku dengan tangannya dan tidak ada yang menghalangiku untuk bergerak kecuali karena Rasulullah shallallahu 'alaihi wa sallam sedang berada di atas pahaku. Rasulullah shallallahu 'alaihi wa sallam bangun di pagi harinya tanpa memiliki air, maka Allah menurunkan ayat tayammum, lalu mereka pun bertayammum.\" Usaid bin Khudhair berkata, \"Ini bukanlah berkah pertama kali yang datang kepadamu wahai Abu Bakar.\" Aisyah berkata, \"Maka kami bangunkan unta, di mana aku berada di atasnya, lalu kami menemukan kalung di bawahnya.\" Imam Bukhari juga meriwayatkan di beberapa tempat dalam kitab shahihnya, namun di sana (juz 9 hal. 321) disebutkan, \"Kalung milik Asmaa' hilang, lalu Rasulullah shallallahu 'alaihi wa sallam mengirim beberapa orang untuk mencarinya…dst.\", sedangkan di juz 11 hal. 135 disebutkan, bahwa Aisyah meminjam kalung itu dari Asmaa'. Dengan demikian kalung tersebut milik Asmaa' yang dipinjam oleh Aisyah radhiyallahu 'anha. Sedangkan kamu berhadats kecil. Yakni berhadats besar. Maksudnya sakit yang tidak boleh terkena air. Yang menjadikan dirinya berhadats kecil. Menurut sebagian ulama \"menyentuh perempuan\" di sini adalah bersentuhan kulit, yang lain berpendapat \"bersentuhan kulit disertai syahwat\", sedangkan yang lain lagi berpendapat, bahwa maksudnya adalah berjima', inilah pendapat yang rajih, karena sebelumnya menyebutkan tentang hadats kecil karena buang air, dan kemudian menyebutkan tentang hadats besar karena menyentuh perempuan, yakni berjima', maka jika tidak ada air, lakukanlah tayammum, di mana ia (tayammum) dapat menyucikan diri kita dari hadats kecil dan hadats besar. Di samping itu, jika menyentuh perempuan membatalkan wudhu', tentu Rasulullah shallallahu 'alaihi wa sallam akan berwudhu' lagi setelah mencium istrinya, namun ternyata Beliau langsung melaksanakan shalat tanpa berwudhu' (sebagaimana dalam hadits Aisyah yang diriwayatkan oleh Ahmad dan Tirmidzi, dan dishahihkan oleh Syaikh Al Albani dalam Shahih At Tirmidzi). Setelah mencarinya. Dari hadats dan dari dosa-dosa. Dengan menerangkan ajaran-ajaran Islam. Syaikh As Sa'diy membuat lima puluh kesimpulan dari ayat ini, yang kami ringkas sbb.: 1. Mengamalkan apa yang disebutkan dalam ayat di atas termasuk bagian dari keimanan, karena Allah memulainya dengan kata-kata \"Wahai orang-orang yang beriman!...dst\" yakni wahai orang-orang yang beriman! Kerjakanlah apa yang disyrai'atkan kepadamu sebagai konsekwensi imanmu. 2. Perintah mendirikan shalat. 3. Perintah memasang niat ketika hendak shalat. Hal ini diambil dari kata-kata \"Idzaa qumtum ilash shalaah\". 4. Suci (dari hadats kecil dan hadats besar) termasuk syarat sah shalat. 5. Bersuci tidaklah wajib karena masuknya waktu shalat, tetapi wajib karena hendak mengerjakan shalat. 6. Semua perbuatan yang disebut sebagai shalat, baik shalat fardhu maupun sunat, demikian juga yang fardhu kifayah seperti shalat jenazah disyaratkan harus bersuci. Bahkan menurut kebanyakan ulama untuk sujud (saja) disyaratkan harus suci, seperti untuk sujud syukur dan sujud tilawah. 7. Perintah membasuh wajah. Wajah itu panjangnya dari atas kepala tempat tumbuh rambut sampai ke bagian bawah rahang dan dagu, sedangkan lebarnya dari telinga yang satu ke telinga yang satunya lagi. Termasuk di dalamnya berkumur-kumur dan menghirup air ke hidung berdasarkan As Sunnah, dan termasuk pula rambut yang ada di wajah. Jika rambutnya tipis, maka air harus sampai ke kulit, tetapi jika lebat, maka cukup bagian atasnya saja. 8. Perintah membasuh kedua tangan sampai siku. Kata \"Ilaa\" (sampai) di sini menurut jumhur mufassir berarti \"ma'a\" (beserta) sebagaimana ayat \"Wa laa ta'kuluu amwaalahum ilaa amwaalikum\" (An NIsaa': 2), di samping itu kewajiban itu tidaklah sempurna kecuali dengan membasuh semua siku. 9. Perintah mengusap kepala. 10. Wajibnya mengusap seluruh kepala. 11. Dalam mengusap dianggap cukup bagaimana pun caranya, baik dengan kedua tangan atau hanya satu tangan, bahkan dengan kain pun dipandang cukup.. 12. Yang wajib adalah mengusap (untuk kepala), oleh karenanya jika seseorang mencuci kepalanya dan tidak menjalankan tangannya, maka belum cukup, karena sama saja ia tidak mengerjakan yang diperintahkan Allah. 13. Perintah membasuh kedua kaki sampai mata kaki, dan dalam hal ini pembahasannya sama dengan membasuh tangan. 14. Di dalam ayat tersebut terdapat bantahan kepada kaum Rafidhah jika menggunakan qira'at (bacaan) jumhur yaitu dengan difat-hahkan lafaz \"arjulakum\", dan tidak bolehnya mengusap kedua kaki ketika terbuka. 15. Di dalamnya terdapat isyarat menyapu kedua sepatu (khuffain) ketika memakai sepatu, jika lafaz \"arjulakum\" dikasrahkan menjadi \"arjulikum\". 16. Perintah tertib dalam berwudhu', karena Allah menyebutkan secara tertib. 17. Perintah tertib adalah dalam keempat anggota badan yang disebutkan dalam ayat di atas (wajah, tangan, kepala dan kaki), adapun tertib dalam hal berkumur-kumur dan beristinsyaq (menghirup air ke hidung), atau antara yang kanan dengan kiri (baik tangan atau kaki), maka tidak wajib, namun dianjurkan mendahulukan berkumur-kumur, lalu beristinsyaq dan mendahulukan yang kanan daripada yang kiri serta mendahulukan mengusap kepala daripada mengusap telinga. 18. Perintah memperbarui wudhu' untuk setiap shalat. 19. Perintah mandi dari junub. 20. Wajib meratakan membasuh ke seluruh badan dalam mandi (yakni meratakan air ke seluruh badan), karena Allah menyandarkan kata \"tathahhur\" (menjadi suci) kepada badan. 21. Perintah membasuh bagian luar kepala dan dalamnya dalam mandi junub. 22. Hadats kecil ikut masuk ke dalam hadats besar, oleh karenanya hal itu dapat diwakili dengan memasang niat untuk mandi, lalu meratakan air ke seluruh badan, karena Allah tidak menyebut selain \"faththahharuu\" dan tidak menyebutkan harus mengulangi wudhu'. 23. Junub mencakup kepada orang yang keluar mani baik dalam keadaan sadar atau sedang tidur atau berjima' meskipun tidak keluar maninya. 24. Barang siapa yang ingat bahwa dirinya mimpi, namun tidak mendapatkan basahnya, maka ia tidak wajib mandi karena belum terwujud junub. 25. Disebutkan nikmat Allah kepada hamba-hamba-Nya dengan adanya syari'at tayammum. 26. Termasuk sebab yang membolehkan tayammum adalah sakit yang membahayakan dirinya jika menggunakan air. 27. Termasuk sebab yang membolehkan tayammum adalah safar dan selesai dari buang air kecil atau besar ketika tidak ada air. Untuk sakit boleh bertayammum meskipun ada air jika merasa bahaya menggunakannya, sedangkan yang lain (safar dan buang air) membolehkan tayammum ketika tidak ada air meskipun tidak safar. 28. Yang keluar dari dua jalan; buang air kecil atau buang air besar dapat membatalkan wudhu'. 29. Sebagian ulama berdalil dengan ayat ini untuk menetapkan tidak batalnya wudhu' kecuali karena dua perkara ini (keluar dari dua jalan), oleh karenanya tidak batal karena memegang kemaluan. 30. Dianjurkan menggunakan kata-kata kiasan untuk hal-hal yang nampak buruk jika diucapkan. 31. Menyentuh wanita dengan syahwat membatalkan wudhu' pembahasan lebih jelasnya lihat catatan kaki sebelumnya]. 32. Syarat tidak adanya air untuk sahnya tayammum. 33. Ketika ada air meskipun sedang dalam shalat, menjadikan tayammumnya batal. 34. Jika telah masuk waktu shalat dan tidak ada air, maka seseorang harus mencarinya di tempatnya atau di sekitarnya, berdasarkan kata-kata \"lam yajid\". 35. Barang siapa yang mendapatkan air namun kurang cukup untuk menyucikan sebagiannya anggota badannya, maka ia tetap menggunakan air itu, selebiihnya ia tayammumkan. 36. Air yang berubah karena sesuatu yang suci lebih didahulukan daripada bertayammum. Hal itu, karena air yang berubah, tetap dianggap sebagai air sehingga masih masuk dalam kata-kata \"falam tajiduu maa'an\". 37. Bertayammum harus disertai niat, berdasarkan kata-kata \"Fa tayammamuu\". 38. Tayammum dianggap cukup dengan segala sesuatu yang nampak di permukaan bumi baik berupa tanah maupun lainnya. Oleh karena itu, ayat \"famsahuu biwujuuhikum wa aidiikum minh\" bisa karena melihat kepada ghalibnya, yakni pada umumnya ada debu, di mana ia mengusap wajah darinya, bisa juga sebagai pengarahan kepada yang lebih utama, yakni jika permukaan bumi itu ada debunya, maka hal itu lebih utama. 39. Tidak sah bertayammum dengan debu yang bernajis. 40. Yang ditayammumkan adalah wajah dan tangan saja, tidak anggota badan yang lain. 41. Lafaz \"Biwujuuhikum\" mencakup semua wajah, yakni semua wajahnya dikenakan dalam tayammum, hanya saja dikecualikan bagian hidung dan mulut serta yang berada di bawah rambut meskipun tidak lebat. 42. Kedua tangan yang diusap adalah sampai pergelangan saja, karena \"kedua tangan\" jika disebut secara mutlak adalah sampai pergelangan. Jika disyaratkan sampai ke siku tentu Allah akan sebutkan sebagaimana dalam wudhu'. 43. Ayat ini umum tentang bolehnya bertayammum untuk semua hadats, baik hadts besar maupun hadats kecil, bahkan ketika badan bernajis. Karena Allah menjadikan tayammum sebagai pengganti bersuci dengan menggunakan air. Namun menurut jumhur ulama, tayammum tidak ditujukan jika badan bernajis, karena susunan ayat ini berkenaan dengan hadats. 44. Bagian yang diusap dalam tayammum baik untuk hadats besar maupun hadats kecil adalah sama, yaitu wajah dan tangan. 45. Jika seseorang berniat dalam tayammum untuk menyucikan diri dari kedua hadats, maka hal itu sah. 46. Mengusap dalam tayammum dikatakan cukup dengan apa saja, baik dengan tangan atau lainnya, karena Allah berfirman, \"fam sahuuu\" dan tidak menyebutkan sesuatu yang digunakan untuk mengusap, sehingga dengan apa saja boleh. 47. Disyaratkan harus tertib dalam bertayammum sebagaimana dalam wudhu', karena Allah memulainya dengan wajah kemudian kedua tangan. 48. Syari'at yang ditetapkan Allah tidak ada sedikit pun kesempitan dan kesulitan, bahkan hal itu merupakan rahmat untuk menyucikan mereka dan menyempurnakan nikmat-Nya kepada mereka. 49. Sucinya bagian luar dengan air atau tanah merupakan penyempurnaan terhadap kesucian batin seseorang dengan tauhid dan tobat yang sesungguhnya. 50. Bertayammum, mesakipun tidak dirasa dan dilihat kesucian seseorang, namun di dalamnya terdapat penyucian maknawi yang muncul dari mengikuti perintah Allah. 51. Sepatutnya seorang hamba mentadabburi hikmah dan rahasia di balik syari'at Allah, baik dalam syari'at bersuci maupun syari'at lainnya agar bertambah pengetahuan dan ilmunya, serta bertambah rasa syukur dan cinta kepada-Nya, di mana syari'at-syari'at itu mencapaikan seseorang kepada derajat-derajat yang tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 6",
    "description": "Setelah Allah menjelaskan hukum tentang makanan dan hewanhewan sembelihan yang dihalalkan dan menjelaskan ketentuan menyangkut wanita-wanita yang boleh dinikahi, pada ayat ini Allah menjelaskan hukum-hukum yang berkaitan dengan tata cara beribadah kepada Allah dimulai dengan salat sebagai ibadah yang paling mulia. Ayat ini memberikan petunjuk tentang persiapan yang harus dilakukan ketika hendak melakukan salat, yaitu cara menyucikan diri dengan berwudu, tayamum, dan mandi. Wahai orang-orang yang beriman! apabila kamu telah membulatkan hati hendak melaksanakan salat, sedangkan kamu saat itu dalam keadaan tidak suci atau berhadas kecil, maka berwudulah, yaitu dengan cara basuhlah wajahmu dengan air dari ujung tempat tumbuhnya rambut kepala sampai ke ujung dagu dan bagian antara kedua telinga, dan basuhlah tanganmu sampai ke siku, dan sapulah sedikit atau sebagian atau seluruh kepalamu dan basuhlah kedua kakimu sampai kedua mata kaki. Dan jika kamu dalam keadaan junub, yakni keluar mani karena bersetubuh atau karena sebab lain, maka mandilah, yakni basuhlah dengan air seluruh badanmu. Dan jika kamu sakit yang menghalangi kamu menggunakan air karena khawatir penyakitmu bertambah parah atau memperlambat kesembuhan kamu, atau kamu berada dalam perjalanan yang dibenarkan agama dan dalam jarak tertentu, atau kembali dari tempat buang air, yakni kakus, setelah selesai membuang hajat, atau menyentuh perempuan, yakni persentuhan dalam arti pertemuan dua alat kelamin yang berbeda atau dalam arti persentuhan kulit seorang laki-laki dan perempuan, lalu kamu tidak memperoleh air, tidak dapat menggunakannya, baik karena tidak ada, tidak cukup, atau karena sakit, maka bertayamumlah dengan debu yang baik, yakni debu yang bersih dan suci; yaitu dengan cara sapulah wajahmu dan tanganmu dengan debu itu. Allah yang mahakuasa tidak ingin menyulitkan kamu dan tidak menghendaki sedikit pun kesulitan bagimu dengan mengharuskan kamu berwudu ketika tidak ada air atau ketika dalam keadaan sakit yang dikhawatirkan kamu bertambah sakit apabila anggota badanmu terkena air, tetapi dia hendak membersihkan kamu, menyucikan kamu dari dosa maupun dari hadas, dan menyempurnakan nikmat-Nya bagimu, dengan meringankan apa yang menyulitkan kamu agar kamu bersyukur atas nikmat yang dianugerahkan-Nya kepadamutuntunan tersebut di atas merupakan bagian dari nikmat Allah yang harus disyukuri sekaligus merupakan perjanjian yang harus ditaati sebagaimana tersebut pada permulaan surat ini. Dan ingatlah akan karunia Allah kepadamu, berupa tuntunan agama dan nikmat-Nya yang bermacam-macam yang dianugerahkan kepadamu dan perjanjiannya yang telah diikatkan dengan kamu, yakni perjanjian yang diambil melalui rasulullah berupa ketaatan kepada Allah, baik dalam hal yang mudah maupun yang sulit, dan perjanjian-perjanjian lain yang diikatkan dengan kamu ketika kamu mengatakan, kami dengar, yakni kami mengetahui dan memahami perjanjian itu, dan kami taati semua yang dinyatakan dalam perjanjian itu, baik berupa perintah maupun larangan. Dan bertakwalah kepada Allah, janganlah kamu melanggar perjanjian itu, sungguh, Allah maha mengetahui segala isi hati setiap makhluk-Nya."
  }
]