[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai nabi),kepada orang-orang Mukminin, ”maukah aku kabarkan kepada kalian tentang orang yang akan ditimpakan balasan pada hari kiamat dengan balasan yang lebih berat dari balasan orang-orang fasik itu? Sesungguhnya mereka adalah para pendahulu mereka yang Allah usir dari rahmatNya dan Dia murka terhadap mereka, lalu merubah bentuk fisik mereka dan menjadikan mereka kera-kera dan babi-babi, karena kemaksiatan, kedustaan mereka dan kesombongan mereka, sebagaimana di antara mereka ada para penyembah thaghut, (yaitu setiap apa saja yang disembah selain Allah sedangkan dia ridha). Sungguh buruk tempat mereka di akhirat, dan tersesatlah usaha mereka di dunia dari jalan yang benar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Katakanlah -wahai Rasul-, “Maukah kuberitahukan kepada kalian siapa yang lebih pantas dicela dan lebih berat hukumannya dari mereka? Mereka adalah para pendahulu mereka yang diusir oleh Allah dari rahmat-Nya dan diubah wujudnya menjadi monyet dan babi. Dan Allah menjadikan sebagian dari mereka sebagai penyembah tagut. Dan yang disebut tagut ialah segala sesuatu yang disembah secara sukarela selain Allah. Orang-orang tersebut akan mendapatkan tempat yang paling buruk di hari Kiamat. Dan mereka adalah orang-orang yang paling tersesat dari jalan yang benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai Muhammad, katakanlah kepada mereka: Apakah kalian mau aku tunjukkan sesuatu yang lebih buruk dari keadaan kalian yang jauh dari kebenaran itu? Jika keadaan kami lebih buruk seperti yang kalian kira, maka bagaimana dengan keadaan para pendahulu kalian yang telah dilaknat, dimurkai, dan dikutuk oleh Allah? Sungguh betapa beratnya balasan itu! Ketika terdapat pada suatu kaum laknat, kemurkaan, dan kutukan menjadi makhluk yang sangat jelek; dan yang paling jelek adalah dikutuk menjadi kera dan babi akibat pembangkangan, kemaksiatan, dan penyembahan mereka kepada setan dari golongan jin dan manusia. Orang-orang yang jauh dari rahmat Allah tersebut lebih buruk derajatnya, dan lebih sesat dari jalan kebenaran. Sungguh Keburukan dan kesesatan mereka tidak ada yang menandingi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. قُلْ هَلْ أُنَبِّئُكُم بِشَرٍّ مِّن ذٰلِكَ (Katakanlah: “Apakah akan aku beritakan kepadamu tentang orang-orang yang lebih buruk pembalasannya dari (orang-orang fasik) itu disisi Allah) Allah menjelaskan bahwa ada sekelompok orang yang lebih layak untuk mendapatkan hinaan dan celaan kerena kekafiran mereka yang layak mendapatkan laknat dan kemurkaan Allah. مَثُوبَةً (balasan) Yakni balasan yang ditetapkan bagi mereka. مَن لَّعَنَهُ اللهُ (yaitu orang-orang yang dikutuki) Yakni yang ia jauhkan dari rahmat-Nya. وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ(di antara mereka (ada) yang dijadikan kera dan babi) Allah mengubah orang-orang yang melanggar aturan pada haari sabtu menjadi kera-kera. Pendapat lain mengatakan Allah juga mengubah orang-orang Nasrani yang meningkari hidangan dari Isa menjadi babi. وعبد الطاغوت (dan penyembah thaghut) Dan Allah menjadikan sebagaian mereka orang yang berlarut-larut dalam menyembah thaghut. Dan makna dari thaghut adalah setan atau dukun. أُو۟لٰٓئِكَ شَرٌّ مَّكَانًا (Mereka itu lebih buruk tempatnya) Yakni di hari kiamat. وَأَضَلُّ عَن سَوَآءِ السَّبِيلِ(dan lebih tersesat dari jalan yang lurus) Yakni lebih sesat dari kesesatan orang-orang beriman sebagaimana yang kalian anggap dalam kepercayaan kalian yang bathil itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Wahai rasul, katakanlah: “Apakah perlu kukabarkan kepada kalian tentang sesuatu yang lebih mulia daripada aib yang kalian berikan kepada kami karena keimanan, yaitu jalan yang kalian tempuh, berupa kekufuran yang harus mendapatkan laknat dan murka Allah sebagai balasan yang pasti dariNya. Sesungguhnya itu adalah perbuatan orang yang ditolak dari rahmat Allah dan dimurkai olehNya. Maka Dia mempermalukannya di dunia, dan mereka itu adalah orang-orang Yahudi yang membunuh para nabi dan menyembah anak sapi. Dia mengubah sebagian mereka menjadi kera dan sebagian lainnya menjadi babi, yaitu orang-orang Yahudi yang melanggar kehormatan hari sabtu. Dia juga mengubah orang-orang nasrani yang kufur terhadap hidangan Isa menjadi babi, dan juga orang yang menyembah Thaghut, yaitu setan atau penyihir. Yang dimaksud adalah tunduk kepada kesewenang-wenangan orang yang berkuasa. Mereka yang digambarkan dengan gambaran tersebut memiliki tempat lebih buruk daripada lainnya pada hari kiamat dan lebih jauh dari jalan hidayah” Ayat ini turun untuk sekelompok orang Yahudi yang bertanya kepada rasulullah SAW tentang orang yang mengimaninya dari golongan para rasul, lalu beliau menjawabnya dengan ayat yang disebutkan dalam ayat 136 surah Al-Baqarah. Dan ketika Isa disebutkan, mereka menyangkal kenabiannya (nabi Muhammad) dan berkata: “Demi Allah, Kami tidak pernah mengetahui pemeluk agama yang lebih sedikit keberuntungannya di dunia dan akhirat daripada kalian, dan tidak ada agama yang lebih buruk dari agama kalian, lalu turunlah ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah akan aku beritakan} aku kabarkan {kepadamu tentang sesuatu yang lebih buruk daripada itu pembalasannya} hukumannya {di sisi Allah. Siapa saja yang dilaknat dan dimurkai Allah dan dijadikan di antara mereka kera dan babi. Dan (orang) yang menyembah} orang yang menyembah {Tagut. Mereka itu lebih buruk tempatnya dan lebih tersesat dari jalan yang lurus} jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Karena celaan mereka terhadap orang-orang Mukmin menunjukan bahwa orang-orang Mukmin itu di atas keburukan, maka Allah berfirman, “Katakanlah” kepada mereka dengan menyampaikan keburukannya apa yang mereka lakukan, “ Apakah akan Aku beritakan kepadaMu tentang yang lebih buruk dari itu,” yakni, apa yang lebih buruk dari apa yang kamu menyalahkankami karenaNya, itu pun kalau kami menurutimu. “ Orang yang di kutuk oleh Allah,” maksudnya, yang di jauhkanNya dari rahmatNya, “dan di murkai olehNya,” serta dia mengazabnya di dunia dan di ahkirat, “ dian tara mereka ada yang di jadikan kera dan babi,” dan ada orang, “ yang menyembah thagut,” yaitu setan, dan semua yang di sembah selain Allah adalah thagut. “ Mereka itu,” yakni orang-orang yang memiliki sipat-sipat buruk ini, “ lebih buruk tempatnya,” daripada orang Mukmin, yang mana rahmat Allah dekat dengan mereka dan Dia meridhai mereka dan memberi pahala kepada mereka di dunia dan di ahkirat karena mereka mngihklaskan Agama untukNya. Ini termasuk penggunaan kata perbandingan yang bukan pada tempatnya, dan bukan pula FirmanNya, “ Dan lebih tersesat dari jalan yang lurus,” yakni lebih jauh dari jalan yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 60: Karena celaan mereka yang ditujukan kepada kaum mukmin menunjukkan bahwa mereka menganggap orang-orang mukmin itu di atas keburukan, maka Allah Subhaanahu wa Ta'aala memerintahkan Nabi Muhammad shallallahu 'alaihi wa sallam menjawab mereka dengan mengatakan apa yang disebutkan dalam ayat di atas. Yaitu orang-orang Yahudi yang melanggar kehormatan hari Sabtu (Lihat surat Al Baqarah ayat 65). Thagut artinya setan dan apa yang disembah selain Allah. Dari orang-orang mukmin, di mana rahmat Allah dekat dengan mereka, Allah meridhai mereka, memberikan balasan yang baik kepada mereka di dunia dan akhirat karena berbuat ikhlas kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 60",
    "description": "Sebagai kelanjutan dari teguran itu, Allah memerintahkan rasulnya. Katakanlah, wahai Muhammad, apakah sebaiknya akan aku beritakan kepadamu semua tentang orang yang lebih buruk pembalasannya akibat dari perilakunya yang menyimpang dan perbuatannya yang bertentangan dengan jalan lurus dari balasan orang fasik di sisi Allah' yang dimaksud yaitu orang yang dilaknat dan dimurkai Allah karena melanggar larangan, di antara mereka ada yang dijadikan kera dan ada pula yang dijadikan babi, dan juga orang yang menyembah thagut. Sesungguhnya keadaan mereka itu lebih buruk tempatnya ketimbang orang mukmin dan lebih tersesat dari jalan yang lurus. Karena peringatan dan ancaman itu telah menyebabkan ketakutan, sehingga apabila mereka, yaitu orang yahudi atau munafik, datang kepadamu, mereka akan mengatakan, kami telah beriman, padahal sesungguhnya mereka datang kepadamu dengan kekafiran dan mereka pergi pun dalam keadaan demikian pula; dan sesungguhnya Allah lebih mengetahui apa yang mereka kemukakan dan yang mereka sembunyikan."
  }
]