[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila datang kepada kalian (wahai orang-orang mukmin) orang-orang munafik dari kaum yahudi, mereka berkata: ”kami telah beriman”, padahal mereka tetap diatas kekafiran mereka, dimana mereka masuk kepada kalian dengan membawa kekafiran mereka yang mereka yakini dengan hati mereka, kemudian mereka keluar dalam keadaan mereka tetap di atas itu. Dan Allah lebih mengetahui rahasia pada diri mereka sekalipun mereka menampakkan yang berbeda dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Apabila kalian -wahai orang-orang mukmin- didatangi oleh orang-orang munafik dari kalangan mereka, maka mereka akan menampakkan keimanan di hadapan kalian sebagai bentuk kemunafikan mereka, sebenarnya mereka datang dan pergi sambil membawa kekafiran dan tidak melepaskannya sedikit pun. Dan Allah Maha Mengetahui kekafiran yang mereka sembunyikan walaupun mereka menampakkan keimanan di hadapan kalian, dan Allah akan membalas perbuatan mereka tersebut dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Ayat ini menyingkap keadaan orang-orang Yahudi yang mengaku telah beriman. Apabila mereka mendatangi orang-orang beriman, mereka menampakkan keimanannya, padahal mereka datang dalam keadaan Ingkar. Kekafiran telah menyertai mereka dan menjadi tabiat mereka. Mereka datang dalam keadaan kafir begitu pula keadaan mereka ketika pergi, tidak ada yang berubah dari mereka sedikitpun. Hal ini yang menunjukkan kekerasan hati, kesombongan, dan keingkaran mereka. Dan Allah Maha Mengetahui apa yang tersembunyi di dalam hati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَإِذَا جَآءُوكُمْ قَالُوٓا۟ ءَامَنَّا (Dan apabila orang-orang (Yahudi atau munafik) datang kepadamu, mereka mengatakan: “Kami telah beriman”) Yakni menunjuk-nunjukkan keislaman. وَقَد دَّخَلُوا۟ بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوا۟ بِهِۦ ۚ (padahal mereka datang kepadamu dengan kekafirannya dan mereka pergi (daripada kamu) dengan kekafirannya (pula)) Yakni datang kepadamu dengan membawa kekafiran mereka, begitu pula ketika mereka pergi darimu, apa yang mereka dengar darimu sama sekali tidak membekas pada diri mereka sehingga mereka pergi sebagaimana keadaan mereka ketika datang. وَاللهُ أَعْلَمُ بِمَا كَانُوا۟ يَكْتُمُونَ (dan Allah lebih mengetahui apa yang mereka sembunyikan) Yakni kekafiran yang mereka sembunyikan darimu. Padahal mereka telah menunjukkan keislaman dan menampakkan wajah yang cerah dihadapanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Ketika orang-orang munafik Yahudi mendatangi kalian dan menampakkan keimanan mereka terhadap agama kalian dengan tidak benar, padahal mereka mendatangi kalian dalam keadaan kufur dan pergi dalam keadaan kufur sebagaimana saat mereka datang. Apa yang mereka dengar dari Nabi tidak berguna, dan kekufuran mereka itu tidak bisa lepas dengan seketika. Dan Allah itu lebih tahu tentang kekufuran yang mereka sembunyikan darimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila datang kepada kalian, mereka berkata,“Kami telah beriman” padahal mereka masuk dengan kekufuran dan mereka pergi juga dengannya. Allah lebih mengetahui apa yang selalu mereka sembunyikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “ Dan apabila mereka ( orang-orang Yahudi dan munafik ) datang kepadaMu, mereka mengatakan, ‘ Kami telah beriman’,” karena kemunafikan dan tipu daya. “dan” mereka “ telah datang kepadaMu,” dengan membawa kekufuran, “ dan mereka telah pergi dengan kekafiran pula,” maka keluar masuknya mereka adalah dengan kakufuran, sementara mereka mengklaim beriman. Apakah ada yang lebih buruk dan lebih jelek keadaaNya daripada mereka? “ Allah lebih mengetahui apa yang merekan sembunyikan,” lalu mereka membalas dan keburukan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 61: Sebagai bentuk kemunafikan dan makar. Berupa kemunafikan dan niat jahat. Oleh karena itu, Dia akan membalas amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 61",
    "description": "Karena peringatan dan ancaman itu telah menyebabkan ketakutan, sehingga apabila mereka, yaitu orang yahudi atau munafik, datang kepadamu, mereka akan mengatakan, kami telah beriman, padahal sesungguhnya mereka datang kepadamu dengan kekafiran dan mereka pergi pun dalam keadaan demikian pula; dan sesungguhnya Allah lebih mengetahui apa yang mereka kemukakan dan yang mereka sembunyikan. Selanjutnya Allah memberikan informasi kepada nabi dan rasul-Nya, kamu, wahai nabi Muhammad, akan melihat banyak di antara mereka, yaitu orang yahudi yang berlomba dalam berbuat dosa, menimbulkan permusuhan, baik di antara mereka sendiri maupun dengan orang mukmin, dan memakan yang haram tanpa menghiraukan syariat yang telah ditetapkan tuhan. Sungguh, sangat buruk apa saja yang telah mereka perbuat dan yang mereka kerjakan."
  }
]