[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Engkau (wahai rasul) melihat banyak orang dari kaum yahudi yang bersegera melakukan berbagai kemaksiatan, berupa perkataan bohong dan palsu, dan juga melanggar hukum-hukum Allah, dan memakan harta benda orang dengan jalan batil. Sungguh buruk perbuatan dan pelanggaran mereka itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan kamu -wahai Rasul-, sering melihat banyak orang-orang Yahudi dan orang-orang munafik yang bergegas melakukan perbuatan maksiat, seperti berdusta, berlaku tidak adil, dan memakan harta manusia secara haram. Sungguh buruk perbuatan mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Dan sesuatu yang mengherankan dari keadaan kebanyakan dari mereka adalah mereka terus-menerus sigap dan bersegera dalam melakukan kemaksiatan dan melanggar hal-hal yang dilarang. Sungguh buruk amal yang mereka lakukan, yaitu amal yang membawa aib bagi pelakunya namun mereka bangga melakukan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَتَرَىٰ كَثِيرًا مِّنْهُمْ (Dan kamu akan melihat kebanyakan dari mereka) Yakni dari orang-orang munafik, atau orang-orang Yahudi, atau juga keduanya. يُسٰرِعُونَ فِى الْإِثْمِ (bersegera membuat dosa) Yakni bersegera dalam melakukan kebohongan, kesyirikan, atau perbuatan haram. وَالْعُدْوٰنِ (permusuhan) Yakni kezaliman kepada orang lain, atau berlarut-larut dalam perbuatan dosa. السُّحْتَ ۚ(dan memakan yang haram) Yakni harta haram."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Wahai rasul, kamu akan melihat bahwa kebanyakan orang-orang Yahudi itu cepat-cepat terjerumus dalam dosa, yaitu kebohongan, mengambil harta orang, berbuat zalim, dan memakan harta haram seperti riba dan risywah (korupsi), sungguh amat buruk apa yang mereka kerjakan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu akan melihat banyak di antara mereka} di antara orang-orang Yahudi {bersegera} menyegerakan diri {dalam perbuatan dosa} kebohongan {permusuhan} permusuhan atas manusia {dan memakan yang haram} sesuatu yang haram {Sungguh itulah seburuk-buruk apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Kemudian Allah meneruskan menyebutkan aib-aib mereka untuk membalas celaan mereka kepada hamba-hambaNya yang beriman, Dia berfirman, “Dan kamu akan melihat kebanyakan dari mereka,” yakni orang-orang Yahudi, “bersegera membuat dosa dan permusuhan,” yakni mereka berlomba-lomba dan bersungguh-sungguh melakukan kemaksiatan yang terkait dengan hak Allah dan permusuhan kepada para makhluk, “dan memakan yang haram.” Tidak hanya sebatas pemberitahuan bahwa mereka melakukan itu, lebih dari itu, mereka bersegera (berlomba-lomba). Ini adalah bukti kejahatan dan keburukan mereka dan kecintaan kepada kemaksiatan dan kezhaliman telah terpatri di dada mereka. Walaupun demikian mereka berani mengklaim derajat-derajat mulia. “Sesungguhnya amat buruk apa yang mereka kerjakan itu.” Ini adalah celaan dan hinaan yang mendalam kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 62: Di ayat ini dan ayat setelahnya Allah Subhaanahu wa Ta'aala menyebutkan aib-aib mereka (orang-orang Yahudi) sebagai pembelaan terhadap hamba-hamba-Nya yang mukmin. Seperti suka berbohong, dan melakukan maksiat-maksiat lainnya, baik terkait dengan hak Allah maupun dengan hak makhluk. Yakni menerima risywah (sogokan). Hal ini menunjukkan kotornya jiwa mereka, suka berbuat maksiat dan kezaliman. Namun anehnya, mereka mengaku bahwa mereka di atas kemuliaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 62",
    "description": "Selanjutnya Allah memberikan informasi kepada nabi dan rasul-Nya, kamu, wahai nabi Muhammad, akan melihat banyak di antara mereka, yaitu orang yahudi yang berlomba dalam berbuat dosa, menimbulkan permusuhan, baik di antara mereka sendiri maupun dengan orang mukmin, dan memakan yang haram tanpa menghiraukan syariat yang telah ditetapkan tuhan. Sungguh, sangat buruk apa saja yang telah mereka perbuat dan yang mereka kerjakan. Di antara sebab dari perbuatan buruk yang dilakukan orang-orang yahudi itu adalah karena mereka tidak mendapat peringatan dari pendetanya. Karena itu muncul pertanyaan mengapa para ulama yahudi dan para pendeta mereka, setelah mengetahui perilaku masyarakat, tidak melarang mereka yang sering mengucapkan perkataan bohong dan terbiasa memakan yang haram' bila terus dibiarkan, sungguh, hal itu merupakan kebiasaan yang sangat buruk dan apa yang mereka perbuat merupakan sesuatu yang bertentangan dengan ajaran Allah."
  }
]