[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tidak melarang kepada mereka yang bersegera dalam perbuatan dosa dan permusuhan oleh para pemimpin dan para ulama mereka, dari perkataan dusta dan palsu, serta memakan harta benda milik orang dengan jalan batil? sungguh buruk perbuatan mereka tersebut, yaitu ketika mereka meninggalkan tindakan melarang kemungkaran"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Tidakkah para pemimpin dan para ulama mereka melarang mereka bergegas berbuat dosa, seperti berkata dusta, memberikan kesaksian palsu, dan memakan harta orang lain secara tidak sah? Sungguh buruk perilaku para pemimpin dan para ulama mereka yang tidak mau melarang mereka berbuat dosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Mengapa ulama-ulama mereka tidak mengingkari kemungkaran yang mereka lakukan, yang berupa kegemaran mengatakan perkataan kotor dan memakan makanan haram? Betapa buruk cara hidup kependetaan yang mereka kerjakan, mereka enggan menjalankan kewajiban menyampaikan nasihat dan diam ketika melihat kemungkaran. Ini menunjukkan kelihaian mereka dalam melakukan hal-hal yang haram, sampai seakan-akan itu menjadi pekerjaan yang setiap hari mereka lakukan. Sungguh buruk pekerjaan para rahib dan para pendeta itu, yang menjadikan ibadah, manasik, dan ilmu sebagai pekerjaan untuk mencari pendapatan dan sumber penghidupan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. لَوْلَا يَنْهَىٰهُمُ الرَّبّٰنِيُّونَ وَالْأَحْبَارُ عَن قَوْلِهِمُ الْإِثْمَ وَأَكْلِهِمُ السُّحْتَ ۚ (Mengapa orang-orang alim mereka, pendeta-pendeta mereka tidak melarang mereka mengucapkan perkataan bohong dan memakan yang haram) Yakni para ulama mereka tidak lagi melarang mereka berbuat kemungkaran yang mereka ucapkan dengan lisan mereka dan yang mereka makan dari harta haram, hasil suap, dan hasil kezaliman. لَبِئْسَ مَا كَانُوا۟ يَصْنَعُونَ(Sesungguhnya amat buruk apa yang mereka telah kerjakan itu) Yakni betapa buruknya kelakuan ulama mereka yang lalai dan membiarkan mereka terjerumus dalam perbuatan haram tanpa mengingkarinya dan tanpa usaha merubahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63 Mengapa para pastur (ahli wara’ dari golongan orang Yahudi) dan para pendeta (ulama’ Yahudi) tidak melarang mereka untuk berkata bohong dan memakan harta haram? maka sungguh amat buruk perbuatan mereka dengan mendiamkan perbuatan munkar dan tidak memerintahkan kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa tidak} mengapa tidak {melarang kalian} mencegah kalian {para ulama} para pemimpin {dan pendeta} orang-orang alim {tidak melarang mereka dari perkataan bohong} dusta {dan memakan yang haram. Sungguh itulah seburuk- buruk apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Mengapa orang-orang alim mereka dan pendeta-pendeta mereka tidak melarang mereka mengucapkan perkataan bohong dan memakan yang haram?” maksudnya, mengapa para ulama (mereka) yang semestinya memberi manfaat kepada manusia, di mana Allah telah memberi mereka ilmu dan hikmah, tidak melarang mereka berbuat kemaksiatan agar kebodohan yang ada pada mereka terkikis dan sehingga hujjah Allah tegak atas mereka? Para ulama memiliki kewajiban memerintahkan dan melarang manusia, menjelaskan kepada mereka jalan yang syar’I, mendorong mereka kepada kebaikan dan memperingatkan mereka dari keburukan. “Sesungguhnya amat buruk apa yang mereka kerjakan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 63: Para ulama dan tokoh agama dibebani untuk memerintah manusia dan melarang, menerangkan kepada mereka jalan yang benar, mendorong mengerjakan kebaikan dan melarang mengerjakan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 63",
    "description": "Di antara sebab dari perbuatan buruk yang dilakukan orang-orang yahudi itu adalah karena mereka tidak mendapat peringatan dari pendetanya. Karena itu muncul pertanyaan mengapa para ulama yahudi dan para pendeta mereka, setelah mengetahui perilaku masyarakat, tidak melarang mereka yang sering mengucapkan perkataan bohong dan terbiasa memakan yang haram' bila terus dibiarkan, sungguh, hal itu merupakan kebiasaan yang sangat buruk dan apa yang mereka perbuat merupakan sesuatu yang bertentangan dengan ajaran Allahayat-ayat yang lalu menjelaskan perilaku dan sikap buruk dari orang-orang yahudi, selanjutnya ayat-ayat berikut menerangkan tentang perbuatan mereka yang lebih buruk lagi. Sikap yang sangat tidak baik ini diawali ketika mereka berkata, tangan Allah terbelenggu, yang maksudnya adalah kikir atau tidak mau melimpahkan rahmat-Nya. Padahal sebenarnya tangan merekalah yang dibelenggu sehingga mereka dikenal sebagai orang yang bakhil dan karenanya merekalah yang akan dilaknat yang disebabkan oleh apa yang telah mereka katakan itu. Padahal dengan memperhatikan apa saja yang terjadi di sekitarnya, mereka sesungguhnya mengetahui bahwa kedua tangan Allah selalu terbuka untuk semua makhluk-Nya; dia memberi rezeki kepada siapa saja sebagaimana dia kehendaki. Dan Al-Qur'an yang diturunkan kepadamu, hai Muhammad, dari tuhanmu itu pasti juga akan menambah kedurhakaan yang telah mendarah daging dan kekafiran yang sudah menjadi kebiasaan bagi kebanyakan mereka. Sebagai akibat dari kedua sikap buruk itu, kami timbulkan permusuhan yang terus menerus dan kebencian yang mendalam di antara mereka sampai hari kiamat. Setiap saat mereka menyalakan api peperangan pada siapa saja, Allah pasti akan memadamkannya. Selain melakukan penyimpangan dan keingkaran, mereka juga selalu berusaha untuk menimbulkan kerusakan di muka bumi. Dan sesungguhnya Allah sangat tidak menyukai orang-orang yang berbuat kerusakan."
  }
]