[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memperlihatkan kepada NabiNya sesuatu dari perbuatan-perbuatan dosa kaum yahudi (dan itu termasuk yang mereka rahasiakan di antara mereka), yaitu bahwasannya mereka berkata, ”tangan Allah terikat sehingga tidak bisa melakukan perbuatan-perbuatan baik. Dia bakhil kepada kita dengan rizki dan kelapangan hidup.” Itu terjadi ketika mereka ditimpa oleh paceklik dan kekeringan panjang. Sebenarnya tangan merekalah yang terbelenggu, yakni, terikat dan melakukan kebaikan-kebaikan, dan Allah mengusir mereka dari rahmatNya karena perkataan mereka tersebut. Dan perkaranya tidaklah seperti kebohongan yang mereka buat-buat terhadap tuhan mereka, justru kedua tanganNYa terbentang,tak ada sesuatupun yang mengahalangiNya dan tidak ada yang mencegahNya untuk memberi; karena sesungguhnya Dia lah yang Maha dermawan lagi maha mulia. Dia memberikan sesuai dengan hikmah dan apa yang mendatangkan kemaslahatan bagi hamba-hamba. Akan tetapi mereka akan semakain bertambah congkak dan kafir disebabkan kedengkian dan iri hati mereka; karena Allah telah memilihmu untuk mengemban risalah. Dan Allah juga mengabarkan bahwasannya sejumlah kelompok kaum yahudi, sebagian mereka akan tetap memusuhi sebagian yang lain,sebagain mereka menjauhi sebagian yang lain. Setiap kali mereka bersengkongkol untuk melakukan makar terhadap kaum muslimin, untuk mengorbankan fitnah dan menyalakan api peperangan, Allah pasti menolak tipu daya mereka tersebut dan mencerai beraikan kekuatan mereka. Dan orang-orang yahudi akan senantiasa melakukan perbuatan-perbuatan maksiat kepada Allah, yang karena nya akan muncul berbagai kerusakan dan kegoncangan di muka bumi. Dan Allah tidak suka kepada orang-orang yang berbuat kerusakan. Didalam ayat ini terdapat penetapan sifat”dua tanagn”bagi Allah sebagaimana yang layak bagiNya;tanpa menyerupakannya (dengan sifat makhluk) dan tanpa menetapkan bentuk dan caranya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Dan tatkala orang-orang Yahudi ditimpa kesulitan dan kekeringan mereka berkata, “Tangan Allah terbelenggu, tidak mau memberikan kebaikan dan kemurahan. Dia tidak mau memberikan apa yang ada di sisi-Nya kepada kami”. Ketahuilah bahwa tangan merekalah yang terbelenggu, tidak mau berbagi kebaikan dan kemurahan. Dan akibat ucapan ini mereka dijauhkan dari rahmat Allah. Justru sebaliknya kedua tangan Allah -Subḥānahu wa Ta'ālā- terbuka melimpahkan kebaikan dan kemurahan. Dia memberikan menurut kehendak-Nya. Dia dapat melapangkan dan menyempitkannya. Tidak ada yang dapat menghalangi-Nya atau memaksa-Nya. Dan apa yang diturunkan kepadamu -wahai Rasul-, tidak menambah apa pun bagi orang-orang Yahudi selain kesesatan dan kekafiran mereka. Hal itu disebabkan oleh rasa dengki yang ada di dalam hati mereka. Kami menyematkan rasa permusuhan dan kebencian antargolongan di tengah kalangan Yahudi. Setiap kali mereka menghimpun kekuatan untuk berperang atau bersekongkol untuk menyalakan api peperangan, Allah cerai-beraikan persatuan mereka dan Dia hancurkan kekuatan mereka. Namun mereka tidak pernah berhenti berusaha untuk membuat kerusakan di muka bumi dan berupaya untuk menghancurkan agama Islam serta ingin memperdayakannya, sedangkan Allah tidak menyukai orang-orang yang berbuat kerusakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Orang-orang Yahudi membuat kedustaan terhadap Allah dengan berkata dengan penuh keberanian: \"tangan Allah enggan untuk berinfak\". Hal ini mereka katakan karena mencari alasan ketika diminta untuk berinfak atau karena mengeluh dari kesusahan hidup. Ini merupakan adab buruk mereka kepada Allah dan lupa diri terhadap kemurahan Allah yang telah diberikan kepada mereka. Namun perkataan mereka ini kembali kepada diri mereka sendiri, karena sifat bakhil dan serakah merupakan sifat dan tabiat mereka. Mereka berhak dijauhkan dari rahmat Allah akibat kedustaan mereka; karena sesungguhnya perbendaharaan Allah sangat luas, Dia melapangkan kemurahan-nya dan menebar kebalikan-Nya, namun penglihatan mereka tidak peka terhadap itu semua. Seruan bagi mereka kepada kebenaran hanya menambah kejauhan mereka darinya, akibat mereka selalu berpaling dari Nabi Muhammad dan selalu membuat makar baginya, sehingga mereka semakin ingkar dan tersesat. Allah menghukum mereka dengan perpecahan dan pertikaian. Mereka terbagi menjadi banyak golongan, setiap golongan memusuhi golongan lain dan saling menuduh, sehingga pertengkaran di antara mereka sangat sengit. Pertikaian di antara mereka membara dan perselisihan semakin meluas, bahkan api kedengkian di antara mereka menjalar kepada umat-umat yang lain sehingga mengobarkan api peperangan. Ayat ini ditutup dengan peringatan dari kerusakan mereka dan selain mereka. Dan ketidaksukaan Allah merupakan tanda bahwa Dia tidak akan memberi kemenangan bagi orang-orang yang berbuat kerusakan, dan tidak akan memperbaiki urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَقَالَتِ الْيَهُودُ يَدُ اللهِ مَغْلُولَةٌ ۚ (Orang-orang Yahudi berkata: “Tangan Allah terbelenggu”) Yang orang-orang Yahudi maksud disini adalah bahwa Allah bakhil –semoga Allah melaknat mereka –. غُلَّتْ أَيْدِيهِمْ (sebenarnya tangan merekalah yang dibelenggu) Kalimat ini sebagai doa atas mereka bahwa merekalah yang bakhil. Atau mungkin juga berarti bahwa tangan mereka benar-benar akan dibelenggu dengan menjadi tawanan perang di dunia, dan dibelenggu dengan azab di akhirat. وَلُعِنُوا۟ بِمَا قَالُوا۟ ۘ (dan merekalah yang dilaknat disebabkan apa yang telah mereka katakan itu) Yakni dijauhkan dari rahmat Allah karena perkataan mereka “Tangan Allah terbelenggu”. Ada pendapat mengatakan bahwa ayat ini diturunkan untuk orang Yahudi bernama Fanhash yang berkata “sesungguhnya Allah itu miskin sedangkan kami adalah orang-orang kaya”; maka Abu Bakar ash-Shiddiq memukulnya. Lihat surat Ali-Imran:181. Pendapat lain mengatakan ayat ini turun untuk orang Yahudi lain yang berkata: “seseungguhnya tuhanmu itu bakhil, tak mau berinfak”. بَلْ يَدَاهُ مَبْسُوطَتَانِ(tetapi kedua-dua tangan Allah terbuka) Yakni akan tetapi Dia ada pada kedermawanan tanpa batas. Bukankah segala kenikmatan yang ada di langit dan di bumi berasal dari kedermawanan kedua tangan-Nya? يُنفِقُ كَيْفَ يَشَآءُ (Dia menafkahkan sebagaimana Dia kehendaki) Yakni Dia menafkahkan sesuai dengan hikmah kehendak-Nya, apabila Dia menghendaki Dia akan meluaskan rezeki seseorang, dan apabila Dia menghendaki Dia akan menyempitkan rezeki seseorang. Dialah yang Maha Meluaskan dan Maha Menyempitkan. Apabila ia menyempitkan rezeki seseorang maka itu sesuai dengan hikmah-Nya yang dalam. وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم(sungguh-sungguh akan menambah bagi kebanyakan di antara mereka) Yakni diantara orang-orang Yahudi dan Nasrani. ما أنزل إليك (apa yang diturunkan kepadamu) Yakni al-qur’an yang mengandung hukum-hukum yang baik. طُغْيٰنًا وَكُفْرًا ۚ (kedurhakaan dan kekafiran) Yakni menambah kedurhakaan dan kekafiran mereka yang disebabkan kedengkian yang mereka miliki. وَأَلْقَيْنَا بَيْنَهُمُ(Dan Kami telah timbulkan di antara mereka) Yakni antara orang-orang Yahudi atau antara orang-orang Yahudi dan Nasrani. كُلَّمَآ أَوْقَدُوا۟ نَارًا لِّلْحَرْبِ أَطْفَأَهَا اللهُ ۚ (Setiap mereka menyalakan api peperangan Allah memadamkannya) Yakni setiap mereka mengumpulkan pasukan untuk berperang dan mempersiapkan kebutuhannya atau mereka menyalakan api peperangannya dengan makar rendahan mereka, maka Allah mencerai-beraikan pasukan itu dan menghancurkan kekuatannya, sehingga mereka gagal meraih kemenangan dan kembali dengan tangan kosong. Dan begitulah mereka terus ingin menimbulkan peperangan dan menyiapkannya namun Allah selalu menggagalkannya. وَيَسْعَوْنَ فِى الْأَرْضِ فَسَادًا ۚ( dan mereka berbuat kerusakan dimuka bumi) Yakni selalu berusaha untuk melakukan perbuatan yang membawa kerusakan, dan keinginan mereka yang paling besar adalah menghancurkan Islam dan membuat makar untuk pemeluknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Suatu ketika Ibn Baz menangis tatkala dibacakan kepadanya firman Allah yang berbunyi : { وَلَيَزِيدَنَّ كَثِيرًا مِنْهُمْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ طُغْيَانًا وَكُفْرًا } \"Dan Al Quran yang diturunkan kepadamu dari Tuhanmu sungguh-sungguh akan menambah kedurhakaan dan kekafiran bagi kebanyakan di antara mereka\" lalu beliau mengatakan : kami berlindung kepada Allah dari golongan orang-orang yang terlaknat! karena apa yang kepada mereka bukanlah petunjuk dan ketawaan, melainkan kedurhakaan dan kekafiran! dan inilah yang menjadikan mereka berpaling dari agama Allah, maka berhati-hatilah wahai hamba Allah dari agar kamu tidak termasuk ke dalam golongan mereka. 2 ). Perhatikanlah betapa banyak dijelaskan dalam al-Qur'an kekufuran orang-orang Yahudi : - Tentang Allah : { وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ } \"Orang-orang Yahudi berkata: \"Tangan Allah terbelenggu\"\" - Dan tentang Malaikat-Nya : { مَنْ كَانَ عَدُوًّا لِجِبْرِيلَ } \"“Barang siapa yang menjadi musuh Jibril\" [Al-Baqarah : 97] - Dan tentang kitab-Nya : { يُحَرِّفُونَ الْكَلِمَ مِنْ بَعْدِ مَوَاضِعِهِ } \"mereka merubah perkataan-perkataan (Taurat) dari tempat-tempatnya\" [Al-Maidah : 41] - Dan tentang Rasul-Nya : { فَفَرِيقًا كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ } \"maka beberapa orang (diantara mereka) kamu dustakan dan beberapa orang (yang lain) kamu bunuh?\" [Al-Baqarah : 87] - Dan tentang orang-orang beriman : { لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِلَّذِينَ آمَنُوا الْيَهُودَ } \"Sesungguhnya kamu dapati orang-orang yang paling keras permusuhannya terhadap orang-orang yang beriman ialah orang-orang Yahudi\" [Al-Maidah : 64]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Ketika mereka ditimpa kegersangan dan diminta untuk berinfak dalam kebaikan, orang-orang Yahudi itu berkata: “Tangan Allah terbelenggu sehingga tidak bisa memberi rejeki, maksudnya yaitu Allah itu bakhil,” sebenarnya merekalah yang terbelenggu tangan-tangannya dari perbuatan baik, itu adalah panggilan atas kebakhilan mereka. Mereka ditolak dari rahmat Allah karena ucapan mereka: {tangan Allah terbelenggu}, namun tangan Allah terbuka (kinayah dari bentuk pemberian yang sangat banyak), yaitu untuk menunjukkan kedermawananNya. Dia memberikan infaq bagaimanapun Dia berkehendak sesuai ilmu dan hikmahNya. Dan sungguh apa yang diturunkan kepadamu berupa Al-Qur’an yang menjelaskan tentang keadaan dan kabar mereka, dan ketentuan Allah akan menambahkan kesewenang-wenangan dan kekufuran kebanyakan orang-orang Yahudi dan Nasrani (yaitu semakin sewenang-wenang dalam berdusta dan keterlaluan dalam menyangkal) akibat kedengkian dan kekufuran mereka terhadap Al-Qur’an. Dan Kami timbulkan di antara orang-orang Yahudi dan Nasrani itu permusuhan dan kebenciap sampai hari kiamat. Setiap kali mereka menyalakan api peperangan, fitnah, dan tipu daya kepda Nabi dan orang-orang mukmin, Allah menggagalkannya, sehingga mereka tidak bisa mendapatkan manfaat apapun. Mereka berusaha berbuat kerusakan, menghasut dan menipu orang-orang muslim. Dan Allah akan membalas orang-orang yang berbuat kerusakan di bumi. Ibnu Abbas berkata: “Seorang lelaki Yahudi yang dipanggil An-Nabasy bin Qays berkata: “Sesungguhnya Tuhanmu pelit sehingga tidak mau memberikan nafkah (rejeki)” Lalu Allah menurunkan ayat {Wa Qaalatil Yahuudu Yadullahi Maghluulah …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang Yahudi berkata,“Tangan Allah terbelenggu”} ditawan untuk memberi kebaikan dan rejeki {Sebenarnya tangan merekalah yang dibelenggu} tangan mereka ditahan untuk melakukan kebaikan dan rejeki {Mereka dilaknat disebabkan apa yang telah mereka katakan. Sebaliknya kedua tanganNya terbuka. Dia memberi rezeki sebagaimana Dia berkehendak. Apa yang diturunkan kepadamu dari Tuhanmu itu pasti akan menambah kedurhakaan} keluar dari batas {dan kekufuran} penyangkalan {bagi kebanyakan mereka. Kami menimbulkan permusuhan dan kebencian di antara mereka sampai hari kiamat. Setiap kali mereka menyalakan api peperangan, Allah memadamkannya} Setiap kalia mereka berkumpul untu berperang dan mempersiapkan suatu persiapan Allah memisahkan kumpulan mereka {Mereka berusaha (menimbulkan) kerusakan di bumi. Allah tidak menyukai orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Allah memberitakan tentang ucapan orang-orang Yahudi yang buruk dan akidah mereka yang busuk. Dia berfirman, “Orang-orang Yahudi berkata, ‘ Tangan Allah terbelenggu,” yaitu, dari kebaikan dan berbuat baik. “sebenarnya tangan merekalah yang dibelenggu dan merekalah yang dilaknat disebabkan apa yang telah mereka katakan itu.” Ini adalah doa musibah atas mereka, persis sama dengan ucapan mereka sendiri, karena ucapan mereka mengandung tuduhan kepada Allah dengan kekikiran dan tidak berbuat baik, maka Allah membalas mereka dengan menyatakan bahwa sifat itu justru tepat untuk mereka sendiri. Mereka adalah orang-orang yang paling bakhil, paling sedikit berbuat baik, paling buruk prasangkanya kepada Allah, dan paling jauh dari rahmatNya yang meliputi segala sesuatu dan memenuhi penjuru alam, atas dan bawah. Oleh karena itu, Allah berfirman, “Tetapi kedua Tangan Allah terbuka, Dia menafkahkan sebagaimana Dia kehendaki,” tanpa ada penghalang dan tanpa ada seorang pun yang melarangnya melakukan apa yang dikehendakiNya. Allah telah membentangkan karunia dan kebaikanNya, baik yang berkaitan dengan agama maupun dunia, dan DIa memerintahkan hamba-hambaNya agar mencari pintu-pintu kemurahanNya agar mereka tidak menutup diri mereka dari pintu-pintu kebaikanNYa dengan kemaksiatan kepadaNya. TanganNya selalu memberi siang dan malam, kebaikanNYa tercurah di segala waktu. Dia memudahkan kesulitan, menghilangkan kesedihan, mencukupkan orang miskin, membebaskan tawanan, membantu orang yang perlu dibantu, menjawab peminta, memberi kepada orang miskin yang membutuhkan, menjawab doa orang-orang yang dalam kesulitan, mengabulkan doa orang-orang yang meminta kepadaNya, bahkan memberi nikmat kepada yang tidak meminta kepadaNya, serta memberi keselamatan kepada yang meminta keselamatan kepadaNya. Pelaku kemaksiatan tetap mendapatkan kebaikanNya. Lebih dari itu kebaikanNYa dinikmati oleh orang baik dan orang fajir. Dia memberikan taufik kepada orang-orang yang dicintaiNya untuk beramal shalih, kemudian memuji mereka karenanya dan menisbatkannya kepada mereka padahal itu berasal dari kemurahanNya, membalas mereka karenanya dengan pahala dunia dan akhirat yang tidak bisa dijelaskan dan tidak terlintas di benak seorang hamba. Dia lembut kepada mereka dalam segala urusan mereka, menyampaikan kebaikanNya kepada mereka, menolak bala’ dari mereka sementara mereka tidak mengetahui yang lebih banyak darinya. Mahasuci Dzat yang mana seluruh nikmat yang dirasakan oleh manusia adalah dariNya. kepadaNya mereka mengadu untuk menolak perkara-perkara yang dibenci. Mahasuci Allah yang mana tak seorang pun bisa menghitung pujian kepadaNYa; Dia adalah seperti DIa memuji DiriNya sendiri. Mahatinggi Dzat yang mana tidak sekejap pun manusia yang lepas dari nikmatNya, bahkan keberadaan dan kehidupanNya. Semoga Allah memperburuk orang yang karena kebodohannya tidak memerlukan Tuhannya dan menisbatkan Tuhannya kepada apa yang tidak layak dengan kemahaagunganNYa. Bahkan seandaianya Allah memperlakukan orang-orang Yahudi yang mengucapkan ucapan itu dan yang sepertinya dari kalangan orang-orang yang keadaannya seperti mereka dengan perlakuan yang sesuai dengan sebagian yang mereka ucapkan, niscaya mereka akan binasa dan sengsara di dunia. Akan tetapi sekalipun mereka mengatakan semua itu, Allah bersikap lapang, memberi kelonggaran dan tangguh waktu, tetapi tidak melalaikan mereka. FirmanNya, “Dan al-Quran yang diturunkan kepadamu dari Tuhanmu sungguh-sungguh akan menambah kedurhakaan dan kekafiran bagi kebanyakan di antara mereka.” Ini adalah hukuman terbesar atas seorang hamba; di mana al-Quran yang Allah turunkan kepada RasulNya, yang padanya terdapat kehidupan hati dan rohani, kebahagiaan dan keberuntungan dunia dan akhirat, yang merupakan nikmat terbesar yang Allah berikan kepada hambaNya, yang mewajibkan mereka bersegera menerimanya, menyerahkan diri kepada Allah karenanya dan bersyukur kepadaNya karenanya, tetapi ini justru menambah kesesatan di atas kesesatannya, kedurhakaan di atas kedurhakaannya dan kekufuran di atas kekufurannya. Hal itu disebut karena dia berpaling darinya, menolaknya, memusuhinya, dan menentangnya dengan syubhat-syubhat yang batil. “Dan Kami telah timbulkan permusuhan dan kebencian di antara mereka sampai Hari KImat.” Maka mereka tidak saling mengasihi, tidak saling mendukung, dan tidak bersepakat di atas keadaan yang mengandung kebaikan bagi mereka. Justru mereka senantiasa saling membenci dalam hati mereka, saling bermusuhan dalam perbuatan mereka sampai Hari KIamat. “Setiap mereka menyalakan api peperangan” untuk melawan Islam dan kaum Muslimin, di mana mereka menampakkan, mengulang, menyiapkan pasukan berkuda dan pejalan kaki, “Allah memadamkannya” dengan menghinakan mereka, mengobrak-abrik tentara mereka, dan memenangkan kaum Muslimin atas mereka. “Dan mereka berbuat kerusakan di muka bumi,” maksudnya, mereka berusaha dengan sekuat tenaga demi membuat kerusakna di muka bumi; dengan melakukan kemaksiatan, berdakwah kepada agama mereka yang batil dan menghalang-halangi manusia masuk Islam. “Dan Allah tidak menyukai orang-orang yang membuat kerusakan,” bahkan Allah sangat memurkaiNya dan akan membalas mereka karena itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": ""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 64: Ketika rezeki mereka sempit karena mendustakan Nabi shallallahu 'alaihi wa sallam, padahal mereka sebelumnya memiliki harta yang banyak. Maksudnya ialah kikir, Mahasuci Allah dari ucapan keji tersebut. Kalimat ini mengandung beberapa makna: - Kutukan dari Allah terhadap orang-orang Yahudi, yang berarti bahwa mereka akan terbelenggu di bawah kekuasaan bangsa-bangsa lain selama di dunia dan akan disiksa dengan belenggu neraka di akhirat kelak. - Tangan mereka terbelenggu sehingga tidak dapat mengerjakan kebaikan, sekaligus doa buruk untuk mereka. - Pernyataan bahwa tangan merekalah yang sesungguhnya terbelenggu dari berbuat baik kepada manusia, dan ternyata memang demikian, yakni mereka adalah manusia yang paling kikir kepada orang lain dan paling sedikit kebaikannya, paling buruk sangkaannya kepada Allah dan paling jauh dari rahmat-Nya, padahal rahmat-Nya mengena kepada segala sesuatu dan memenuhi alam bagian atas maupun bawah. Ahlussunnah sepakat bahwa Allah memiliki dua tangan secara hakiki namun yang sesuai dengan kebesaran-Nya. Rasulullah shallallahu 'alaihi wa sallam bersabda: « إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِى حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا » . “Sesungguhnya orang-orang yang berbuat adil, di sisi Allah akan berada di atas mimbar-mibar dari cahaya di sebelah kanan Ar Rahman ‘Azza wa Jalla, dan kedua tangan-Nya adalah kanan. Mereka (yang berada di mimbar itu) adalah orang-orang yang adil dalam hukumnya, keluarganya dan dalam hal yang mereka pimpin.” (HR. Muslim) Dalam hadits riwayat Muslim juga disebutkan, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: « يَطْوِى اللَّهُ عَزَّ وَجَلَّ السَّمَوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِى الأَرَضِينَ بِشِمَالِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ » . “Allah akan menggulung seluruh lapisan langit pada hari kiamat, lalu diambil dengan tangan kanan-Nya, dan berfirman, “Akulah penguasa, di mana orang-orang yang berlaku zalim? Di mana orang orang yang sombong?” Kemudian Allah menggulung beberapa bumi, lalu diambil dengan tangan kiri-Nya dan berfirman, “Akulah Penguasa, di mana orang-orang yang berlaku zalim? Di mana orang-orang yang sombong ?”. Kedua hadits di atas menunjukkan bahwa Allah memiliki dua tangan, hanya saja di hadits pertama menerangkan bahwa kedua tangan-Nya adalah kanan, sedangkan hadits kedua menyebutkan tentang tangan kiri-Nya. Hal ini tidaklah bertentangan, karena maksud hadits pertama adalah bahwa tangan yang satu lagi tidaklah seperti tangan kiri sebagaimana tangan kiri yang dimiliki makhluk yang keadaannya lemah. Oleh karena itu, Beliau menerangkan, bahwa kedua tangan-Nya adalah kanan, yakni tidak memiliki kekurangan. Hal ini diperkuat oleh sabda Beliau dalam hadits tentang Adam, “Aku memilih tangan kanan Tuhanku, dan kedua tangan-Nya adalah kanan lagi diberkahi.” (HR. Muslim) oleh karena dikhawatirkan timbul persangkaan keliru jika ditetapkan tangan kiri yang menunjukkan kekurangan, maka Beliau menerangkan, “Kedua tangan-Nya adalah kanan,” hal ini juga diperkuat oleh sabda Beliau shallallahu 'alaihi wa sallam, “Orang-orang yang berbuat adil berada di atas mimbar-mimbar dari cahaya di sebelah kanan Ar Rahman.” Maksudnya adalah menerangkan keutamaan mereka, martabat mereka, dan bahwa mereka di sebelah kanan Ar Rahman. Kesimpulannya, bahwa kedua tangan Allah adalah kanan tanpa diragukan lagi, dan masing-masingnya bukan yang lain, dan apabila kita sebut tangan yang lain itu adalah tangan kiri, maka bukan berarti kurang kuat dibanding tangan kanan, bahkan kedua tangan-Nya adalah kanan. (Lihat Al Qaulul Mufid ‘alaa Kitaabit Tauhid karya Syaikh Ibnu ‘Utsaimin rahimahullah). Tidak ada yang menghalangi apa yang Dia kehendaki, Dia melapangkan karunia dan ihsan-Nya baik karunia agama maupun dunia, dan memerintahkan hamba-hamba-Nya agar mendatangi kepemurahan-Nya serta tidak menutup pintu ihsan terhadap diri mereka dengan berbuat maksiat. Dia senantiasa memberi di malam dan siang hari, kebaikan-Nya senantiasa tercurah di setiap waktu, menghilangkan derita dan menyingkirkan kesedihan, mengkayakan yang miskin, membebaskan tawanan dan mengobati hati yang sedang merana, mengabulkan orang yang meminta, memberi orang yang fakir, mengabulkan permintaan orang sangat membutuhkan, memberi nikmat meskipun tidak diminta, menyembuhkan orang yang meminta kesembuhan, demikian juga tidak dihalangi dari kebaikan-Nya orang-orang yang bermaksiat. Di antara kepemurahan-Nya adalah memberi taufiq wali-wali-Nya untuk mengerjakan amal shalih, kemudian Dia memuji mereka karenanya dan menisbatkan amal itu kepada mereka, padahal yang demikian berkat kepemurahan-Nya, Dia membalas mereka terhadapnya dengan pahala yang segera atau ditunda nanti dengan balasan yang tidak mungkin digambarkan, dan belum pernah terlintas di hati manusia serta bersikap sayang kepada mereka dalam semua urusan mereka, menyampaikan kepada mereka ihsan-Nya serta menghindarkan musibah namun mereka tidak menyadarinya. Oleh karena itu, Mahasuci Allah, di mana semua nikmat yang dirasakan hamba berasal dari-Nya, dan kepada-Nya diminta untuk menghindarkan bahaya. Maha banyak kebaikan Allah, di mana tidak seorang pun yang dapat menjumlahkan pujian-Nya, bahkan Dia sebagaimana Dia memuji dirinya, Maha Tinggi Dia, di mana semua hamba-Nya tidak pernah lepas sedetik pun dari kepemurahan-Nya, bahkan adanya mereka dan masih dapat hidup tidak lain karena kepemurahan-Nya. Sungguh buruk sekali mereka yang merasa tidak membutuhkan-Nya dan menisbatkan kepada-Nya sesuatu yang tidak layak bagi-Nya, namun Dia Maha Penyantun, tidak segera menghukum mereka meskipun Dia berkuasa dan tetap terus mengejak mereka bertobat dari sikap itu (lihat ayat 65 setelah ini). Hal ini merupakan hukuman besar yang ditimpakan kepada seorang hamba, yakni Al Qur'an yang seharusnya menghidupkan ruh, membahagiakannya di dunia dan akhirat serta menjadikannya mendapatkan keberuntungan, yang mengharuskan seseorang menerimanya, tunduk kepada Allah dan mensyukuri-Nya, namun malah menambah kesesatan baginya dan menambah kekafirannya. Hal itu tidak lain karena berpaling daripadanya, menolaknya dan malah menentangnya. Masing-masing golongan mereka menyelisihi yang lain, tidak mau bersatu dan tidak mau tolong-menolong, bahkan saling benci-membenci dan tidak mau sepakat untuk hal yang bermaslahat bagi mereka semua. Untuk memerangi Islam dan para pemeluknya. Dengan mengecewakan mereka, memecah belah tentara mereka dan memenangkan kaum muslimin. Dengan melakukan berbagai kemaksiatan, mengajak kepada agama mereka yang batil dan menghalangi manusia dari agama Islam. Oleh karena itu, Dia akan menyiksa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 64",
    "description": "Ayat-ayat yang lalu menjelaskan perilaku dan sikap buruk dari orang-orang yahudi, selanjutnya ayat-ayat berikut menerangkan tentang perbuatan mereka yang lebih buruk lagi. Sikap yang sangat tidak baik ini diawali ketika mereka berkata, tangan Allah terbelenggu, yang maksudnya adalah kikir atau tidak mau melimpahkan rahmat-Nya. Padahal sebenarnya tangan merekalah yang dibelenggu sehingga mereka dikenal sebagai orang yang bakhil dan karenanya merekalah yang akan dilaknat yang disebabkan oleh apa yang telah mereka katakan itu. Padahal dengan memperhatikan apa saja yang terjadi di sekitarnya, mereka sesungguhnya mengetahui bahwa kedua tangan Allah selalu terbuka untuk semua makhluk-Nya; dia memberi rezeki kepada siapa saja sebagaimana dia kehendaki. Dan Al-Qur'an yang diturunkan kepadamu, hai Muhammad, dari tuhanmu itu pasti juga akan menambah kedurhakaan yang telah mendarah daging dan kekafiran yang sudah menjadi kebiasaan bagi kebanyakan mereka. Sebagai akibat dari kedua sikap buruk itu, kami timbulkan permusuhan yang terus menerus dan kebencian yang mendalam di antara mereka sampai hari kiamat. Setiap saat mereka menyalakan api peperangan pada siapa saja, Allah pasti akan memadamkannya. Selain melakukan penyimpangan dan keingkaran, mereka juga selalu berusaha untuk menimbulkan kerusakan di muka bumi. Dan sesungguhnya Allah sangat tidak menyukai orang-orang yang berbuat kerusakan. Ayat ini menerangkan balasan bagi umat yang sering mengingkari ajaran Allah. Dan sekiranya ahli kitab itu, yaitu orang yahudi dan nasrani, beriman kepada Allah dan meyakini bahwa nabi Muhammad itu nabi terakhir, dan bertakwa dengan selalu mematuhi perintah Allah serta menjauhi semua larangan-Nya, niscaya kami hapus atau ampuni kesalahan-kesalahan yang telah mereka lakukan selama ini, dan sebagai balasan atas ketaatan itu, mereka semua tentu akan kami masukkan ke dalam surga-surga yang penuh kenikmatan, sehingga mereka akan dapat merasakan balasan dari kepatuhan dan ketakwaan mereka."
  }
]