[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya kaum yahudi dan nasrani beriman kepada Allah dan RasulNya, serta mengerjakan perintah-perintah Allah dan menjauhi larangan-laranganNya, pastilah Kami akan hapus dosa-dosa dari mereka,dan Kami benar-benar akan memasukan mereka kedalam surga-surga yang penuh kenikmatan di negeri akhirat kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Sekiranya orang-orang Yahudi dan Nasrani mempercayai agama yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam- dan bertakwa kepada Allah dengan menghindari maksiat, niscaya Kami akan menghapus dosa-dosa yang mereka perbuat, sekalipun jumlahnya banyak. Dan Kami akan memasukkan mereka ke dalam Surga Na’īm pada hari kiamat kelak, di sana mereka dapat menikmati segala macam kenikmatan untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Allah menyeru para Ahli kitab dan orang-orang sebelum mereka untuk memperbaiki kerusakan yang telah mereka buat, menyambung hubungan yang telah mereka putus, dan menghiasi diri dengan keimanan; agar terbuka bagi mereka pintu taubat dan harapan. Andai saja mereka beriman kepada semua Rasul dan seluruh kitab serta menjauhi segala yang diharamkan Allah, niscaya Allah akan menghapus dosa-dosa mereka dan memasukkan mereka ke dalam surga-surga, agar mereka mendapat kenikmatan di dalamnya. Andai saja mereka mengamalkan hukum-hukum yang ada dalam Taurat dan Injil dan kitab-kitab lain yang diturunkan Allah kepada mereka, niscaya mereka akan beriman kepada penutup para nabi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَلَوْ أَنَّ أَهْلَ الْكِتٰبِ ءَامَنُوا۟ (Dan sekiranya Ahli Kitab beriman) Yakni beriman kepada apa yang dibawa Nabi Muhammad sebagaimana mereka diperintahkan dalam kitab-kitab yang Allah turunkan kepada mereka. وَاتَّقَوْا۟( dan bertakwa) Yakni jauhilah kemaksiatan. لَكَفَّرْنَا عَنْهُمْ سَيِّـَٔاتِهِمْ(tentulah Kami tutup (hapus) kesalahan-kesalahan mereka) Yakni kesalahan-kesalahan yang mereka perbuat meskipun itu banyak dan bermacam-macam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "65-66 Sungguh kenikmatan di akhirat diraih hanya dengan keimanan dan ketaqwaan kepada Allah, dan kenikmatan di dunia diraih dengan mendirikan segala hukum Allah di muka bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dan sekiranya para ahli kitab yaitu orang Yahudi dan Nasrani itu beriman kepada Allah dan rasulNya, Muhammad SAW sebagaimana yang diperintahkan kitab-kitab mereka yang telah diturunkan kepada mereka, dan menghindari kemaksiatan seperti menyekutukan Allah dan menyangkal risalah Rasulullah, maka sungguh Kami akan melebur dosa-dosa yang telah mereka perbuat dan akan Kami masukkan ke dalam surga bersama orang-orang muslim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Ahlul kitab itu beriman} kepada Rasulullah SAW dan apa yang diturunkan bersamanya {dan bertakwa, maka sungguh Kami hapus} sungguh Kami hapus {kesalahan-kesalahan mereka dan Kami masukkan mereka ke dalam surga-surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Kemudian Allah berfirman, “Dan sekiranya Ahli Kitab beriman dan bertakwa, tentulah Kami tutup (hapus) keselahan-kesalahan mereka dan tentulah Kami masukkan mereka ke dalam surga-surga yang penuh kenikmatan.” Ini adalah kemurahan dan kedermawananNya, di mana Dia menyebutkan keburukan-keburukan Ahli Kitab, kejelekan-kejelekan mereka dan ucaapan-ucapan mereka yang batil, lalu Dia menyerukan taubat kepada mereka, bahwa jika mereka beriman kepada Allah, malaikat-malaikatNya, seluruh kitab-kitabNya, seluruh rasul-rasulNya dan menjauhi kemaksiatan, niscaya Dia akan menghapus kesalahan-kesalahan mereka bagaimanapun banyaknya dan niscaya Dia memasukkan mereka ke dalam surga kenikmatan yang padanya terdapat apa diinginkan oleh jiwa dan dinikmati oleh mata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 65: Ayat di atas menunjukkan kepemurahan Allah, setelah membalas celaan dan lecehan mereka terhadap agama-Nya dan hamba-hamba-Nya yang mukmin dengan menyebutkan aib mereka dan perkataan mereka yang batil, Allah mengajak mereka bertobat, dan bahwa jika mereka beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam dengan masuk Islam dan bertakwa kepada Allah, niscaya Allah akan menghapuskan kesalahan mereka meskipun telah terjadi apa yang telah terjadi, dan Dia akan memasukkan mereka ke dalam surga yang disenangi jiwa manusia dan sedap dipandang mata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 65",
    "description": "Ayat ini menerangkan balasan bagi umat yang sering mengingkari ajaran Allah. Dan sekiranya ahli kitab itu, yaitu orang yahudi dan nasrani, beriman kepada Allah dan meyakini bahwa nabi Muhammad itu nabi terakhir, dan bertakwa dengan selalu mematuhi perintah Allah serta menjauhi semua larangan-Nya, niscaya kami hapus atau ampuni kesalahan-kesalahan yang telah mereka lakukan selama ini, dan sebagai balasan atas ketaatan itu, mereka semua tentu akan kami masukkan ke dalam surga-surga yang penuh kenikmatan, sehingga mereka akan dapat merasakan balasan dari kepatuhan dan ketakwaan mereka. Selanjutnya Allah juga menjelaskan tentang keadaan mereka yang berkaitan dengan ketaatan itu, dan sekiranya mereka, yaitu umat yahudi dan nasrani, sungguh-sungguh menjalankan hukum dan tuntunan yang terdapat dalam taurat dan injil dan percaya pula pada Al-Qur'an yang diturunkan kepada nabi Muhammad yang ada di tengah mereka dari tuhannya, niscaya mereka akan mendapat rahmat berupa rezeki atau makanan yang berasal dari atas mereka, yaitu berupa manna dan salwa' atau hujan yang dapat menumbuhkan tanaman, dan dari bawah kaki mereka berupa hasil bumi yang melimpah. Sesungguhnya di antara mereka itu masih ada sekelompok yang jujur dan taat, yaitu yang selalu menelaah kitab suci dan tidak fanatik pada ajaran pendeta yang dinilai tidak sesuai serta selalu bersikap lurus, dan banyak di antara mereka sangat buruk apa yang mereka kerjakan dan telah menyimpang dari tuntunan kitab sucinya."
  }
]