[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai rasul, sampaikanlah wahyu Allah yang diturunkan kepadamu dari tuhanmu. jika kamu kurang dalam menyampaikan dengan menyembunyikan sesuatu darinya, maka kamu berarti belum menyampaikan risalah tuhanmu. Dan beliau telah menyampaikan risalah tuhannya dengan sempurna. Maka barangsiapa memiliki dugaan bahwa sesungguhnya beliau menyembunyikan sesuatu dari wahyu yang diturunkan kepadanya, sungguh orang tersebut telah mengadakan kedustaan besar atas nama Allah dan RasulNya. Dan Allah adalah pelindung dan penolongmu atas musuh-musuhmu. Tidak ada kewajiaban atas dirimu selain menyampaikan saja. Sesungguhnya Allah tidak memberikan taufik menuju hidayah bagi orang yang berbelok dari jalan kebenaran dan mengingkari risalah yang kamu bawa dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Wahai Rasul! Sampaikanlah apa yang diturunkan kepadamu dari Rabbmu secara lengkap. Jangan menyembunyikan sesuatu darinya. Jika kamu menyembunyikan sesuatu darinya berarti kamu tidak menyampaikan risalah Rabbmu. (Pada kenyataannya Rasulullah -ṣallallāhu 'alaihi wa sallam- telah menyampaikan semua yang diperintahkan untuk disampaikannya. Barangsiapa yang menuduh sebaliknya berarti ia telah membuat kebohongan besar atas nama Allah). Sesudah hari ini Allah akan melindungimu dari manusia. Maka mereka tidak akan dapat menimpakan sesuatu yang buruk kepadamu. Jadi tugasmu hanyalah menyampaikan pesan. Dan Allah tidak akan membimbing orang-orang yang ingkar serta tidak menginginkan petunjuk ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Karena ayat-ayat yang telah disampaikan berhubungan dengan pengungkapan rahasia musuh-musuh Islam dan kekurangan mereka -dan ini sangat membutuhkan kesungguhan dalam menyampaikannya dan kesabaran dalam menanggung konsekuensinya- maka Allah menegaskan perintah kepada Rasulullah untuk menyampaikan apa yang telah diturunkan kepadanya. Allah akan menjaganya dari tipu daya mereka, dan akan menghinakan orang-orang kafir dan tidak memberi mereka kebaikan. Dan Rasulullah telah menyampaikan risalahnya dengan sempurna. Meski ayat ini ditujukan kepada nabi secara khusus namun berlaku juga bagi setiap muslim untuk melakukan dakwah kepada Allah tanpa terkecuali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. يٰٓأَيُّهَا الرَّسُولُ بَلِّغْ مَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ ۖ (Hai Rasul, sampaikanlah apa yang diturunkan kepadamu dari Tuhanmu) Allah memerintahkan Nabi Muhammad untuk menyampaikan semua yang Allah turunkan kepadanya, tanpa menyembunyikan apapun dan tanpa merahasiakan kepada seorangpun segala yang berhubungan dengan apa yang diturunkan kepadanya. وَإِن لَّمْ تَفْعَلْ (Dan jika tidak kamu kerjakan) Dan menyembunyikannya meskipun hanya sebagian darinya. فَمَا بَلَّغْتَ رِسَالَتَهُۥ ۚ (berarti kamu tidak menyampaikan amanat-Nya) Rasulullah telah menyampaikan kepada umatnya apa yang diturunkan untuk mereka. Dan ia telah meminta kesaksian dari mereka di berbagai kesempatan dengan mengatakan: “apakah aku telah menyampaikannya?”, mereka pun bersaksi untuknya bahwa ia telah menyampaikannya. وَاللهُ يَعْصِمُكَ مِنَ النَّاسِ ۗ (Allah memelihara kamu dari (gangguan) manusia) Yakni mulai hari ini Allah akan melindungimu dari orang yang mengingankan berbuat buruk kepadamu, maka janganlah kamu menyembunyikan sesuatu apa yang harus kamu sampaikan. ‘Aisyah berkata: dahulu Rasulullah senantiasa di jaga (oleh para sahabatnya), sampai turun ayat ini (والله يعصمك من الناس). Maka Rasulullah mengeluarkan kepalanya dari kemahnya seraya berkata: “wahai manusia, beranjaklah! Karena Allah telah menjagaku”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Wahai rasul, sampaikanlah seluruh wahyu yang diturunkan Allah kepadamu, yaitu Al-Qur’an, jangan ada satupun yang kamu sembunyikan, dan jangan takut dibenci. Jika kamu tidak menyampaikan dan menyembunyikan sebagian dari Al-Qur’an itu, maka sesungguhnya kamu tidak menyampaikan risalah (amanat) Tuhanmu. Dan sungguh rasulullah telah menyampaikan kepada umatnya sesuatu yang memang diturunkan untuk mereka. Dan Allah akan menjaga dan memeliharamu dari fitnah dan kejahatan manusia, sehingga tidak ada satupun orang yang bisa melarangmu menyampaikan seluruh wahyu Allah yang diberikan kepadamu. Sesungguhnya Allah tidak akan memberi taufik kepada orang-orang kafir menuju kebaikan. Dalam riwayat Hasan Al-Bashri, Rasulullah SAW bersabda: “Sesungguhnya Allah mengutusku dengan membawa suatu risalah, namun aku keberatan memikulnya, dan tahu bahwa orang-orang kan mendustakanku. Dan Dia (Allah) memberikan janji kepadaku bahwa aku akan menyampaikan risalahNya atau Dia akan menyiksaku” lalu turunlah ayat {Yaa ayyuhar rasuulu balligh maa unzila ilaika …}. Pada suatu malam Nabi bersabda: “Mudah-mudahan ada lelaki shaleh yang yang menjaga kita malam ini” Lalu Allah mengutus Sa’d dan Khudzaufah untuk menjaganya. Kemudian turunlah ayat {Wallahu Yu’shimuka minannaas}. Lalu rasulullah bersabda: {Wahai manusia, kembalilah, sungguh Allah telah menjagaku}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Rasul, sampaikanlah apa yang diturunkan Tuhanmu kepadamu. Jika kamu tidak melakukan, yaitu kamu tidak menyampaikan risalahNya. Allah menjagamu} menjagamu {dari manusia. Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Ini adalah perintah dari Allah kepada RasulNya, Muhammad, dengan perintah yang paling mulia dan paling agung yaitu menyampaikan apa yang Allah turunkan kepadanya. Termasuk dalam hal ini adalah seluruh perkara yang diteriman umat ini dari Nabi, meliputi akidah, amalan-amalan, perkataan-perkataan, hukum-hukum syar’I dan tuntutan-tuntutan ilahiyah. Nabi telah menyampaikan dengan sempurna, dia telah berdakwah, memberi peringatan, menyampaikan berita gembira dan memberi kemudahan. Dia mendidik orang-orang bodoh yang tidak bisa membaca dan menulis menjadi ulama Rabbani. Beliau menyampaikan dengan ucapan, perbuatan, (mengirim) surat dan (mengirim ) utusan-utusannya. Tiada kebaikan kecuali beliau menunjukkan umatnya kepadanya, dan tiada keburukan kecuali beliau memperingatkan umatnya darinya. Para sahabat, para imam, dan ulama, serta kaum MUslimin yang merupakan orang-orang terpilih umat ini telah berskaksi untuknya bahwa dia telah menyampaikan. “Dan jika tidak kamu kerjakan,” maksudnya, tidak menyampaikan apa yang diturunkan oleh Rabbmu kepadamu, “berarti kamu tidak menyampaikan amanatNya.” Artinya,kamu tidak melaksanakan perintahNya. “Allah memelihara kamu dari (gangguan) manusia.” Ini adalah perlindungan dan penjagaan dari Allah bagi RasulNya dari gangguan manusia. Hendaknya kamu mencurahkan segala perhatian kepada pendidikan dan tabligh, jangan gentar karena takut kepada manusia, karena ubun-ubun mereka semua ada di Tangan Allah. Allah telah menjamin perindunganmu, tugasmu hanyalah menyampaikan dengan jelas. Barangsiapa mendapatkan petunjuk, maka itu untuk dirinya sendiri. Adapun orang-orang kafir yang tujuan mereka hanyalah mengikuti hawa nafsu, maka Allah tidak memberi petunjuk kepada mereka dan tidak membimbing mereka kepada kebaikan karena kekufuran mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 67: Ibnu Hibban meriwayatkan dari Abu Hurairah, ia berkata: Rasulullah shallallahu 'alaihi wa sallam apabila singgah di suatu tempat, maka para sahabat memperhatikan pohon yang paling besar agar dijadikan tempat bagi Nabi shallallahu 'alaihi wa sallam sehingga Beliau berdiam di bawahnya, kemudian para sahabat menempati setelahnya di bawah naungan pohon. Ketika Beliau berada di bawah pohon dan menggantungkan pedangnya di sana, tiba-tiba ada seorang Arab baduwi yang mengambil pedang itu kemudian mendekati Nabi shallallahu 'alaihi wa sallam yang sedang tertidur, lalu ia membangunkannya dan berkata, \"Wahai Muhammad! Siapakah yang dapat menghalangimu dariku?\" Nabi shallallahu 'alaihi wa sallam menjawab, \"Allah.\", maka Allah menurunkan ayat, \"Yaa ayyuhar rasuulu balligh maa unzila ilaika…dst. \" (Hadits ini hasan, karena Muhammad bin Amr salah seorang rawi hadits ini haditsnya hasan sebagaimana dikatakan Adz Dzahabi dalam Al Mizan, sedangkan Mu'ammal bin Isma'il dalam hapalannya diperbincangkan, akan tetapi hadits ini dimutaba'ahkan sebagaimana dalam Tafsir Ibnu Katsir, di mana Adam, yakni Ibnu Abi Iyasy memutaba'ahkannya. Ibnu Katsir menyebutkannya dengan sanad Ibnu Mardawaih.) Maka Rasulullah shallallahu 'alaihi wa sallam menyampaikan risalah-Nya dengan sempurna, berdakwah, memperingatkan dan memberi kabar gembira serta memberikan kemudahan, mengajarkan orang-orang yang tidak tahu sehingga menjadi ulama, menyampaikan risalahnya dengan sabda Beliau, perbuatan, tulisan (surat) dan pengiriman utusan. Oleh karena ini, tidak ada satu pun kebaikan kecuali Beliau telah menunjukkan kepada umatnya, dan tidak ada satu pun keburukan kecuali Beliau telah memperingatkan. Beliau shallallahu 'alaihi wa sallam telah menyampaikan semua yang dibutuhkan umatnya, baik yang terkait dengan Aqidah, ibadah, mu'amalah, adab maupun akhlak. Karena menyembunyikan sebagiannya sama saja menyembunyikan seluruhnya. Sebelumnya Nabi Muhammad shallallahu 'alaihi wa sallam dikawal, sampai turun ayat di atas. Setelah turun ayat di atas, Beliau bersabda kepada sahabatnya, \"Pergilah kalian, karena sesunggunya Allah telah memeliharaku.\" (HR. Hakim), oleh karenanya tidak ada seorang pun yang dapat membunuh Beliau shallallahu 'alaihi wa sallam. Orang-orang kafir, karena tidak ada yang mereka inginkan selain yang sesuai dengan hawa nafsu mereka, maka Allah tidak memberikan hidayah kepada mereka dan tidak memberi mereka taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 67",
    "description": "Sesudah menjelaskan tentang keingkaran ahli kitab, maka pada ayat ini Allah menerangkan tugas rasulullah, yang di antaranya adalah untuk menyampaikan ajaran islam kepada mereka. Demikian informasi dari sabab nuzul yang diriwayatkan ibnu mardawaih. Wahai rasul! sampaikanlah kepada orang-orang ahli kitab apa yang diturunkan kepadamu, yaitu ajaran-ajaran islam melalui wahyu dari tuhanmu. Itulah tugas atau kewajibanmu. Jika tidak engkau lakukan apa yang diperintahkan itu, berarti engkau tidak menyampaikan amanat-Nya. Dan ketahuilah bahwa Allah akan selalu memelihara engkau dari gangguan atau maksud buruk manusia. Tugasmu hanya menyampaikan ajaran islam dan bukan menjadikan mereka beriman, karena sungguh, Allah tidak memberi petunjuk kepada orang-orang kafir, sehingga kekafiran mereka bukan menjadi tanggung jawabmuselanjutnya untuk meyakinkan mereka, katakanlah dengan tegas wahai Muhammad, hai ahli kitab, kamu semua tidak dipandang telah beragama dengan benar dan baik sedikit pun hingga kamu telah sanggup menegakkan ajaran-ajaran yang terdapat dalam taurat, injil, dan alqur'an yang diturunkan tuhanmu kepadamu. Ketahuilah bahwa sesungguhnya apa yang diturunkan kepadamu, Muhammad, dari tuhanmu hanya akan menambah kedurhakaan dan kekafiran kepada kebanyakan dari mereka yang disebabkan kedengkian mereka kepadamu. Bila itu yang kamu rasakan dari mereka, maka janganlah engkau berputus asa terhadap orang-orang kafir itu, karena tugasmu hanya untuk menyampaikan ajaran islam saja."
  }
]