[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah olehmu (wahai Rasul) kepada golongan yahudi dan nasrani, ”sesungguhnya kalian tidaklah berada di atas bagian dari agama, selama kalian masih saja tidak mengamalkan kandungan taurat dan injil, serta apa yang dibawa oleh Muhammad berupa Al-quran.” Dan sesungguhnya bagi kebanyakan orang dari ahli kitab tidaklah menambah apa-apa dengan diturunkannya al-qur’an kepadamu,kecuali arogansi dan pengingkaran. Mereka sebenarnya dengki terhadap dirimu, karena sesungguhnya Allah mengutusmu dengan mengemban risalah penutup ini yang didalamnya Dia menjelaskan aib-aib mereka. Maka janganlah kamu bersedih hati (wahai rasul), akibat pendustaan mereka kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Katakanlah -wahai Rasul-, “Kalian -wahai orang-orang Yahudi dan Nasrani- tidak mengikuti agama yang diakui sampai kalian mengamalkan apa yang tertera di dalam Kitab Suci Taurat dan Injil, dan juga mengamalkan apa yang diturunkan kepada kalian melalui kitab suci Al-Qur`ān yang iman kalian tidak sah tanpa beriman kepadanya serta mengamalkan isinya. Dan apa yang diturunkan kepadamu dari Rabbmu benar-benar akan menambah kesesatan dan kekafiran ahli Kitab, akibat rasa dengki yang ada di dalam hati mereka. Maka janganlah kamu menyesali perbuatan orang-orang yang kafir itu. Cukuplah kamu beserta orang-orang mukmin yang menjadi pengikutmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Allah menyeru mereka dengan sebutan Ahli kitab agar membangkitkan kesadaran mereka untuk mengikuti kebenaran: Mengapa mereka tidak mencari petunjuk, memperbaiki jalan hidup, dan mengingat kembali perjanjian yang mereka buat, padahal mereka adalah Ahli kitab? Seruan ini juga mengandung ajakan untuk beriman kepada Al-qur'an; karena barangsiapa yang beriman kepadanya maka dia telah menegakkan Taurat, Injil, dan kitab-kitab Allah yang lain. Adapun perbuatan mereka menghalangi dan berpaling dari jalan Allah hanya akan menambah kesesatan di atas kesesatan mereka dan kekafiran di atas kekafiran mereka. Perbuatan mereka ini merupakan perbuatan yang melampaui batas dan merusak bumi. Dan barangsiapa yang melakukannya maka dia akan menjadi orang yang merugi dan binasa. Maka janganlah engkau bersedih terhadap mereka Hai Muhammad, karena mereka telah memilih kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قُلْ يٰٓأَهْلَ الْكِتٰبِ لَسْتُمْ عَلَىٰ شَىْءٍ (Katakanlah: “Hai Ahli Kitab, kamu tidak dipandang beragama sedikitpun) Ini merupakan bagian dari kalimat yang Rasulullah diperintahkan untuk menyampaikannya setelah ia dijaga oleh Allah. Ibnu Abbas berkata: Nafi’ bin Haritsah, Sallam bin Musykim, Malik bin Shaif, Rafi’ bin Harmalah mendatangi Rasulullah dan berkata: “Hai Muhammad, bukankah kamu mengaku berada diatas millah (agama) Ibrahim, dan beriman kepada Taurat kami, serta bersaksi bahwa Taurat itu benar berasal dari Allah?” Rasulullah menjawab: “iya, namun kalian berbuat seenaknya sendiri dan mengingkari apa perjanjian yang terdapat didalam Taurat itu, serta kafir terhadap apa yang diperintahkan kepada kalian berupa perintah untuk menjelaskannya pada manusia; maka aku berlepas diri dari tindakan kalian itu”. Mereka berkata: “sesungguhnya kami menerima apa yang ada pada kami, dan kami berada dalam petunjuk dan kebenaran, serta kami tidak mau beriman dan mengikutimu”. Maka Allah menurunkan ayat ini. Yakni kalian sebenarnya tidak berada dalam kebenaran. حَتَّىٰ تُقِيمُوا۟ التَّوْرَىٰةَ وَالْإِنجِيلَ (hingga kamu menegakkan ajaran-ajaran Taurat dan Injil) Yakni menjalankan perintah-perintah dan larangan-larangan Allah yang ada di dalam keduanya, yang termasuk didalamnya adalah perintah untuk mengikuti Nabi Muhammad dan larangan untuk menyelisihinya dan meninggalkan apa yang telah kalian rubah dari taurat dan injil itu serta menyampaikan apa yang kalian sembunyikan. وَمَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُمْ ۗ (dan apa yang diturunkan kepadamu dari Tuhanmu) Yakni al-qur’an. Karena tidak sah penegakan Taurat dan Injil tanpa menegakkan al-Qur’an. طُغْيٰنًا وَكُفْرًا ۖ (kedurhakaan dan kekafiran) Yakni menambah kekafiran ke dalam kekafiran mereka yang telah ada, dan menambah kedurhakaan ke dalam kedurhakaan yang telah ada. فَلَا تَأْسَ عَلَى الْقَوْمِ الْكٰفِرِينَ(maka janganlah kamu bersedih hati terhadap orang-orang yang kafir itu) Yakni tinggalkanlah rasa kasihan terhadap mereka, cukuplah bagimu orang-orang beriman yang mengikuti jejakmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Wahai rasul, katakanlah: “Wahai para ahli kitab, kalian tidaklah beragama apapun, sampai kalian mengamalkan apa yang terkandung dalam Taurat dan Injii, di antara kandungannya adalah mengikuti Muhammad SAW, dan apa yang diturunkan Tuhan kepada kalian, yaitu Al-Qur’an.” Dan sungguh apa yang diturunkan kepadamu (wahai Muhammad) dalam Al-Qur’an itu akan menambah kesewenang-wenangan dalam berdusta dan sikap keterlaluan dalam kekufuran bagi kebanyakan ahli kitab. Namun janganlah bersedih atas tidak berimannya kaum kafir terhadap risalahmu, maka cukup bagimulah keimanan dalam diri orang-orang mukmin. Ayat ini turun untuk sekelompok orang Yahudi yang berkata kepada Nabi SAW: “Sesungguhnya Kami mengamalkan apa yang ada di sisi kami, dan kami berada dalam kebenaran dan hidayah. Kami tidak akan beriman kepadamu dan tidak akan mengikutimu.” Lalu Allah menurunkan ayat {Qul yaa ahlal kitaabi …}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,\"Wahai Ahlul kitab, kalian tidak menganut sesuatu pun hingga kalian menegakkan Taurat, Injil, dan apa yang diturunkan Tuhan kalian kepada kalian.” Apa yang diturunkan Tuhanmu kepadamu pasti akan membuat banyak di antara mereka lebih durhaka dan ingkar. Maka janganlah kamu bersedih} menyesal {terhadap kaum yang kafir itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Maksudnya, katakanlah kepada Ahli KItab, serukan dan umumkan kesesatan dan kebatilan mereka bahwa “kamu tidak dipandang beragama sedikit pun,” dalam perkara-perkara agama, karena kamu tidak beriman kepada Muhammad dan al-Quran, dan tidak pula membenarkan nabimu dan kitabmu, kamu tidak berpegang kepada kebenaran dan kamu tidak berpijak kepada dasar yang benar, “hingga kamu menegakkan ajaran-ajaran Taurat dan Injil,” maksudnya, kamu menjadikan keduanya tegak dengan beriman kepada keduanya, mengikuti dan tidak berpegang kepada kebenaran dan kamu tidak berpijak kepada dasar yang benar, “hingga kamu menegakkan ajaran-ajaran Taurat dan Injil,” maksudnya, kamu menjadikan keduanya tegak dengan beriman kepada keduanya, mengikuti dan berpegang kepada apa yang diserukan kedaunya. “Dan” kamu juga menegakkan “al-Quran, yang diturunkan kepadamu dari Tuhanmu,” yang telah mendidikmu, memberi nikmat kepadamu dan menjadikan nikmatNya yang paling mulia adalah diturunkannya kitab-kitab kepadamu. Maka sudah sewajibnya kamu bersyukur kepada Allah, berpegang teguh dengan hukum-hukum Allah dan menjunjung amanat dan perjanjianNYa yang dibebankan kepadamu. “Sesungguhnya apa yang diturunkan kepadamu (Muhammad) dari TUhanmu akan menambah kedurhakaan dan kekafiran bagi kebanyakan dari mereka, maka janganlah kamu bersedih hati terhadap orang-orang yang kafir itu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 68: Karena kamu tidak beriman kepada Al Qur'an dan Nabi Muhammad shallallahu 'alaihi wa sallam, demikian juga tidak beriman kepada nabi kamu dan kitab kamu serta tidak berpegang kepada kebenaran dan tidak bersandar kepada suatu dasar pun. Karena kekafiran mereka kepada Al Qur'an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 68",
    "description": "Selanjutnya untuk meyakinkan mereka, katakanlah dengan tegas wahai Muhammad, hai ahli kitab, kamu semua tidak dipandang telah beragama dengan benar dan baik sedikit pun hingga kamu telah sanggup menegakkan ajaran-ajaran yang terdapat dalam taurat, injil, dan alqur'an yang diturunkan tuhanmu kepadamu. Ketahuilah bahwa sesungguhnya apa yang diturunkan kepadamu, Muhammad, dari tuhanmu hanya akan menambah kedurhakaan dan kekafiran kepada kebanyakan dari mereka yang disebabkan kedengkian mereka kepadamu. Bila itu yang kamu rasakan dari mereka, maka janganlah engkau berputus asa terhadap orang-orang kafir itu, karena tugasmu hanya untuk menyampaikan ajaran islam saja. Dalam ayat ini dijelaskan bahwa sesungguhnya orang-orang yang beriman, yaitu umat islam, orang-orang yahudi, sha'bi'in, dan orang-orang nasrani, barang siapa di antara mereka yang beriman kepada Allah dengan selalu mengesakan dan beribadah hanya kepada-Nya, percaya kepada hari kemudian sebagai wahana untuk pemberian ganjaran atau hukuman dari perbuatan mereka, dan selalu berbuat kebajikan sesuai dengan tuntunan Allah yang terdapat dalam taurat, injil, dan Al-Qur'an, maka tidak ada rasa khawatir sedikit pun pada mereka dan mereka tidak perlu untuk bersedih hati karena Allah selalu akan memberikan jalan keluar terbaik bagi semua persoalan yang dihadapi."
  }
]