[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman (yaitu kaum muslimin) orang-orang yahudi dan kalangan shabi’in juga (mereka adalah kaum yang masih bertahan diatas fitrah mereka, tanpa ada agam ajaran tertentu yang mereka ikuti) dan orang-orang nasrani (para pengikut Isa al-masih ), siapa saja yang beriman diantara mereka kepada Allah dengan keimanan yang sempurna, yaitu tauhid dan membenarkan kenabian Muhammad dan risalah yang dia bawa dan beriman kepada hari akhir, serta mengerjakan amal shalih, maka tidak ada rasa takut pada mereka terhadap kengerian-kengerian hari kiamat dan mereka tidak bersedih hati terhadap apa yang mereka tinggalkan di belakang mereka di kehidupan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Sesungguhnya orang-orang mukmin, orang-orang Yahudi, orang-orang Ṣābi’īn dan orang-orang Nasrani, siapa pun di antara mereka yang percaya kepada Allah dan hari Akhir, serta beramal saleh, maka tidak ada kekhawatiran terhadap mereka mengenai apa yang kelak akan mereka hadapi dan mereka pun tidak bersedih hati atas kekayaan dunia yang luput dari jangkauan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Setelah Allah menjelaskan bahwa mereka tidak dianggap beragama selama mereka belum beriman, maka kemudian Allah menjelaskan jalan keimanan dan balasan bagi orang yang beriman. Orang-orang yang beriman kepada Allah dan Rasulullah, orang-orang Yahudi, orang-orang selain orang Yahudi dan Nasrani yang merupakan para penyembah bintang-bintang dan Malaikat, dan orang-orang Nasrani; mereka semua yang beriman kepada Allah dan mengakui keesaan-Nya, dan beriman kepada Rasulullah, serta beramal shalih, maka mereka tidak ada ketakutan dari azab akhirat dan tidak ada kesedihan atas kenikmatan dunia yang mereka lewatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَالَّذِينَ هَادُوا۟( orang-orang Yahudi) Yakni orang-orang yang memeluk agama Yahudi. وَالصّٰبِـُٔونَ(dan Shabiin) Tafsir dari kata ini telah dijelaskan di surat al-Baqarah. مَنْ ءَامَنَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ وَعَمِلَ صٰلِحًا فَلَا خَوْفٌ عَلَيْهِمْ (yang beriman kapada Allah dan hari akhir dan mengerjakan amal shaleh maka tidak ada kekhawatiran terhadap mereka) Yakni tidak ada kekhawatiran terhadap mereka saat bertemu dengan Allah. وَلَا هُمْ يَحْزَنُونَ(dan tidak (pula) mereka bersedih hati) Maka barangsiapa yang beriman dari golongan-golongan tersebut dengan keimanan yang tulus sebagaimana mestinya serta beramal shalih niscaya ia tidak akan mendapat kekhawatiran dan kesedihan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Sesungguhnya orang-orang yang beriman kepada Allah dan rasulNya, yaitu orang muslim, orang Yahudi, orang Nasrani, dan kaum Shabi’ para penyembah planet dan bintang, barangsiapa di antara mereka beriman kepada Allah dan hari akhir dengan haq, dan beramal shalih sebagaimana yang diperintahkan Allah, maka tidak ada ketakutan baginya dari azab hari kiamat selamanya, dan mereka tidak akan bersedih atas kelezatan dan kenikmatan dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, Sabiin} kelompok yang masih dalam fitrahnya, tidak ada agama yang mereka ikuti {dan Nasrani, siapa saja yang beriman kepada Allah, hari akhir, dan beramal shalih, tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Allah memberitakan tentang umat yang diberi kitab dari kalangan pengikut Al-Quran, Taurat dan Injil bahwa kebahagiaan dan keselamatan mereka adalah pada jalan dan dasar yang satu, yaitu beriman kepada Allah dan Hari akhir, serta beramal shalih. Barangsiapa di antara mereka yang beriman kepada Allah dan Hari Akhir, serta beramal shalih, maka baginya keselamatan. Tidak ada ketakutan bagi mereka dalam menghadapi perkara-perkara masa depan yang menakutkan dan tidak ada kesedihan bagi mereka pada apa yang telah mereka tinggalkan. Ini adalah hukum yang mencakup seluruh masa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 69: Ada yang mengatakan, bahwa mereka adalah salah satu firqah (golongan) orang-orang Yahudi. Dalam ayat ini, Allah Ta'ala memberitahukan tentang orang-orang yang diberikan kitab, baik kitab Taurat, Injil maupun Al Qur'an, bahwa kebahagiaan dan keselamatan mereka terletak pada satu jalan, yaitu beriman kepada Allah, termasuk beriman kepada Muhammad shallallahu 'alaihi wa sallam, beriman kepada hari akhir dan mengerjakan amal saleh, maka tidak ada kekhawatiran bagi mereka terhadap hal-hal yang akan datang yang mengkhawatirkan, dan mereka pun tidak perlu bersedih hati terhadap hal yang telah mereka tinggalkan. Ketentuan ini berlaku di setiap zaman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 69",
    "description": "Dalam ayat ini dijelaskan bahwa sesungguhnya orang-orang yang beriman, yaitu umat islam, orang-orang yahudi, sha'bi'in, dan orang-orang nasrani, barang siapa di antara mereka yang beriman kepada Allah dengan selalu mengesakan dan beribadah hanya kepada-Nya, percaya kepada hari kemudian sebagai wahana untuk pemberian ganjaran atau hukuman dari perbuatan mereka, dan selalu berbuat kebajikan sesuai dengan tuntunan Allah yang terdapat dalam taurat, injil, dan Al-Qur'an, maka tidak ada rasa khawatir sedikit pun pada mereka dan mereka tidak perlu untuk bersedih hati karena Allah selalu akan memberikan jalan keluar terbaik bagi semua persoalan yang dihadapi. Allah menegaskan bahwa sesungguhnya kami telah mengambil perjanjian dari bani israil, yaitu berupa ikrar mereka untuk beriman kepada Allah dan melaksanakan ajaran taurat yang merupakan syariat bagi mereka, dan untuk mengingatkannya, telah kami utus kepada mereka rasul-rasul yang diberi tugas untuk menjelaskan ajaran kitab suci itu. Akan tetapi, kenyataannya ternyata tidak seperti yang diinginkan. Setiap datang seorang rasul kepada mereka untuk mengingatkan ikrar tersebut dengan membawa atau menyampaikan ajaran agama, tetapi jika apa yang dibawa atau disampaikan itu adalah yang tidak sesuai dengan keinginan mereka, maka sebagian dari rasul-rasul itu mereka dustakan ajaranajarannya dan bahkan sebagian yang lain, seperti nabi zakaria dan nabi yahya, mereka bunuh dengan keji."
  }
]