[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat Allah yang tercurah pada kalian terkait ajaran yang disyariatkanNya bagi kalian. Dan ingatlah oleh kalian perjanjian yang Allah telah mengikat kalian dengannya untuk beriman kepasda Allah dan RasulNya Muhammad ,serta mendengar dan taat kepada keduanya. Dan bertakwalah kepada Allah dalam perkara yang Allah perintahkan kepada kalian dan perkara yang Allah melarang kalian darinya. Sesungguhnya Allah Maha Mengetahui apa yang kalian bisikkan dalam jiwa kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan ingatlah nikmat yang Allah berikan kepada kalian berupa petunjuk untuk memeluk agama Islam. Dan ingatlah janji yang telah Dia ambil dari kalian tatkala kalian menyatakan baiat (janji setia) kepada Nabi -ṣallallāhu 'alaihi wa sallam- untuk mendengar dan patuh, baik di kala senang maupun susah dengan mengatakan, “Kami mendengar ucapanmu dan mematuhi perintahmu.” Dan takutlah kalian kepada Allah dengan menjalankan perintah-perintah-Nya -termasuk janji-janji kalian kepada-Nya- dan menjauhi larangan-larangan-Nya. Sesungguhnya Allah Maha Mengetahui apa yang tersimpan di dalam hati. Maka tidak ada sesuatu pun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah memerintahkan hamba-hambanya yang beriman untuk mengingat kenikmatan kenikmatan yang telah diberikan kepada mereka, diantaranya adalah kenikmatan hidayah, taufik, kemenangan, kemudahan, dan kejayaan, dan mengingat perjanjian besar yang mereka ambil berupa kesiapan untuk mentaati-Nya. Allah Maha Mengetahui apa yang ada dalam dada dan rahasia-rahasia yang keluar masuk di fikiran, disamping pengetahuan-Nya terhadap perkara-perkara yang nampak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَاذْكُرُوا۟ نِعْمَةَ اللهِ عَلَيْكُمْ (Dan ingatlah karunia Allah kepadamu) Yakni berupa agama Islam. وَمِيثٰقَهُ(dan perjanjian-Nya) Pendapat mengatakan yang dimaksud dengan perjanjian disini adalah perjanjian yang diambil atas bani Adam, sebagaimana dalam firman-Nya: وإذ أخذ ربك من بني آدم “dan (ingatlah) ketika Tuhanmu mengambil kesaksian terhadap anak cucu adam..” (al-A’raf:172) Mujahid berkata: meskipun kita tidak mengingat (perjanjian itu) namun Allah telah mengabarkan hal itu. Pendapat lain mengatakan: perjanjian itu merupakan perjanjian yang diambil oleh rasulullah atas para sahabat di malam Aqabah, yang berisi kesiapan untuk mendengar dan mentaatinya baik itu ketika mereka dalam keadaan semangat maupun dalam keadaan malas. Kemudian orang-orang yang masuk Islam setelahnya juga dibaiat untuk melakukan hal itu. Adapun penisbatan Allah diperjanjian ini dengan nama-Nya adalah karena Dialah yang memerintahkan Rasulullah dan memberinya izin, sebagaimana firman-Nya: إن الذين يبايعونك إنما يبايعون الله “Bahwa orang-orang yang berjanji setia kepadamu (Muhammad) sesungguhnya mereka hanya berjanji setia kepada Allah” (al-Fath:10) Dan perjanjian Aqabah disebutkan di kitab-kitab sirah. Ayat ini mempunyai hubungan dengan firman Allah: أوفوا بالعقود “Tepatilah akad-akad” (al-Maidah:1) إِذْ قُلْتُمْ سَمِعْنَا وَأَطَعْنَا ۖ (ketika kamu mengatakan: “Kami dengar dan kami taati”) Yakni ketika kalian mengatakan hal ini maka kalian berarti telah mengambil perjanjian dengan Allah. عَلِيمٌۢ بِذَاتِ الصُّدُورِ (sesungguhnya Allah Mengetahui isi hati) Yakni apa yang disembunyikan dalam hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7 Dan ingatlah karunia Allah kepadamu berupa petunjuk Islam dan perjanjian-Nya yang telah diikat-Nya dengan kamu, atau yang telah Allah perintahkan melalui perantara Rasul, ketika kamu mengatakan kepada Nabi saat kalian berbaiat: “Kami dengar dan kami taati”. Dan bertakwalah kepada Allah dengan menjalankan perintah dan menjauhi larangan, sesungguhnya Allah Mengetahui isi hatimu seperti niat dan kedengkian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah nikmat Allah kepada kalian dan perjanjianNya} JanjiNya {yang telah Dia ikatkan kepada kalian} mengikatkan janji kepada kalian {ketika kalian mengatakan, “Kami mendengar dan kami menaati.” Bertakwalah kepada Allah. Sesungguhnya Allah Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah memerintahkan hamba-hambaNya agar mengingat nikmat-nikmatNya, baik nikmat agama maupun dunia dengan hati dan lisan mereka, karena dengan terus menerus mengingatnya, itu akan medorong kepada sikap bersyukur, mencintai, dan mengakui dengan hati akan kebaikan-kebaikan Allah. Ia juga melenyapkan ujub dari dalam diri terhadap nikmat agama dan sebagai penambah bagi karunia dan kebaikanNya. “Dan perjanjiannya,” maksudnya ingatlah perjanjian Allah, “yang telah diikatNya dengan kamu,” yakni, adalah perjanjian yang telah dia ambil darimu. Ia tidak berarti mereka mengucapkan perjanjian dan sumpah itu, akan teteapi maksudnya adalah bahwa mereka mengimaninya dan Rasulnya teleha mengikrarkan untuk taat kepada keduanya. Oleh karena itu Allah berfirman,” ketiak kamu mengatakan kami dengar dan kami taati, maksudnya kami mendengar serauan yang engkau sampaikan pada kami dari ayat-ayatMu , baik yang di dalam Al-Qur’an maupun yang berada di alam semesta, dengan pendengaran yang penuh pemahaman, di barengi ketundukan dan kataatan. Dan kami taat kepadamu maka jangan lakukan apa yang engakau perintahkan dan menjauh dai apa yang engkau larang. Ini mencakup seluruh syariat agama, baik yang lahir maupun yang batin, dan bahwa orang-orang Mukmin dalam perkara tersebut mengingat perjanjian Allah atas mereka, di mana ia selalu ada dalam benak mereka serta berusaha keras melaksanakan apa yang diperintahkan kepada mereka dengan sempurna tanpa kekurangan. “Dan bertakwalah kepada Allah,” dalam segala keadaanmu. “Sesungguhnya Allah Maha Mengetahui isi hatimu,” maksudnya pemikiran, rahasia, dana pa yang terlintas dalam hatimu itu. Maka berhatilah-hatilah, jangan sampai Allah mengetahui sesuatu di hatimu, yang tidak diridhaiNya atau keluar darimu apa yang dibenciNya. Isilah hatimu dengan ma’rifat dan kecintaan kepadaNya serta nasihat kepada hamba-hambaNya, karena jika kamu demikian, maka Dia mengampuni dosa-dosamu, dan melipatgandakan kebaikan-kebaikanmu, karena Dia mengetahui kebaikan hatimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 7: Dalam ayat ini Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya mengingat nikmat-nikmat-Nya, baik nikmat agama maupun nikmat dunia; dengan hati maupun lisan mereka. Hal itu, karena dengan sering mengingatnya dapat mendorong untuk bersyukur kepada Allah Ta'ala dan mencintai-Nya dan hati merasakan ihsan-Nya. Bahkan manfaatnya pula adalah menghindarkan rasa ujub (bangga) terhadap diri dan menambah karunia Allah dan ihsan-Nya. Berupa agama Islam. Perjanjian itu adalah perjanjian akan mendengar dan mengikuti Nabi shallallahu 'alaihi wa sallam dalam setiap keadaan; yang diikrarkan sewaktu bai'at. Namun di antara ulama ada yang menafsirkan perjanjian di sini, bukan mengucapkan dan melafazkan janji, tetapi maksudnya dengan beriman kepada Allah dan rasul-Nya, maka mereka telah mengharuskan diri mereka taat kepada Allah dan Rasul-Nya. Ketaatan ini mencakup ketaatan kepada syari'at Islam baik yang nampak (di lisan dan anggota badan) maupun yang tersembunyi (dalam hati), dan dalam melakukannya kaum mukmin hendaknya mengingat perjanjian itu agar berusaha mengerjakannya secara sempurna. Dalam perjanjian itu dan jangan melanggarnya atau dalam semua keadaanmu. Oleh karena itu, berhati-hatilah memiliki keinginan yang tidak diridhainya, dan isilah hati kamu dengan mengenal-Nya, mencintai-Nya dan memiliki sikap nashihah (tulus) kepada hamba-hamba Alllah agar kesalahanmu diampuni dan kebaikanmu dilipatgandakan karena Dia mengetahui kesalihan hatimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 7",
    "description": "Tuntunan tersebut di atas merupakan bagian dari nikmat Allah yang harus disyukuri sekaligus merupakan perjanjian yang harus ditaati sebagaimana tersebut pada permulaan surat ini. Dan ingatlah akan karunia Allah kepadamu, berupa tuntunan agama dan nikmat-Nya yang bermacam-macam yang dianugerahkan kepadamu dan perjanjiannya yang telah diikatkan dengan kamu, yakni perjanjian yang diambil melalui rasulullah berupa ketaatan kepada Allah, baik dalam hal yang mudah maupun yang sulit, dan perjanjian-perjanjian lain yang diikatkan dengan kamu ketika kamu mengatakan, kami dengar, yakni kami mengetahui dan memahami perjanjian itu, dan kami taati semua yang dinyatakan dalam perjanjian itu, baik berupa perintah maupun larangan. Dan bertakwalah kepada Allah, janganlah kamu melanggar perjanjian itu, sungguh, Allah maha mengetahui segala isi hati setiap makhluk-Nya. Ayat selanjutnya memberikan tuntunan agar umat islam berlaku adil, tidak hanya kepada sesama umat islam, tetapi juga kepada siapa saja walaupun kepada orang-orang yang tidak disukai. Wahai orangorang yang beriman! jadilah kamu sebagai penegak keadilan, yakni orang yang selalu dan bersungguh-sungguh menegakkan kebenaran, karena Allah, ketika kalian menjadi saksi maka bersaksilah dengan adil. Dan janganlah kebencianmu terhadap suatu kaum, yakni kepada orang-orang kafir dan kepada siapa pun, mendorong kamu untuk berlaku tidak adil terhadap mereka. Berlaku adillah kepada siapa pun, karena adil itu lebih dekat kepada takwa. Dan bertakwalah kepada Allah dengan mengerjakan perintah-Nya dan meninggalkan larangan-Nya, sungguh, Allah mahateliti, maha mengetahui apa yang kamu kerjakan, baik yang kamu lahirkan maupun yang kamu sembunyikan."
  }
]