[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami tealh mengambil perjanjian yang dikukuhkan dari bani israil di dalam taurat untuk mendengar dan taat, dan kami utus kepada mereka rasul-rasul kami dengan membawa misi tersebut. Lalu mereka melanggar perjanjian yang diambil dari mereka dan mengikuti hawa nafsu mereka. Dan mereka itu setiap kali datang seorang rasul kepada mereka dari rasul-rasul tersebut dengan membawa ajaran yang tidak sesuai dengan hawa nafsu mereka, mereka memusuhinya; maka mereka mendustakan sebagian dari rasul-rasul itu dan membunuh sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Sungguh Kami telah mengambil perjanjian yang kokoh dari Bani Israil agar mereka mau mendengar dan patuh. Tetapi kemudian mereka melanggar perjanjian tersebut dan mengikuti hawa nafsu mereka. Sehingga mereka berpaling dari ajaran agama yang dibawa oleh rasul-rasul mereka. Mereka mendustakan sebagian dari rasul-rasul itu dan sebagian lainnya mereka bunuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Allah telah mengambil dari mereka perjanjian-perjanjian agung dan mengutus kepada mereka para rasul untuk mengingatkan perjanjian dan memberi petunjuk. Namun mereka mendustakan para nabi tersebut; bahkan sebagian nabi itu mereka bunuh secara zalim untuk memenuhi hawa nafsu mereka dan menghentikan seruan kepada kebenaran. Dan Adakah kejahatan yang lebih besar daripada membunuh makhluk-makhluk Allah yang terbaik dan para pembawa cahaya dan kebaikan? Itu merupakan kejahatan keji yang tidak akan terhapus dari catatan sejarah dan akan tetap berada di ingatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. وَأَرْسَلْنَآ إِلَيْهِمْ رُسُلًا ۖ (dan telah Kami utus kepada mereka rasul-rasul) Yakni untuk mengajari mereka syariat-syariat dan memberi mereka peringatan. فَرِيقًا كَذَّبُوا۟ وَفَرِيقًا يَقْتُلُونَ (sebagian dari rasul-rasul itu mereka dustakan dan sebagian yang lain mereka bunuh) Yang termasuk nabi yang mereka dustakan adalah Nabi Isa dan para nabi yang senasib dengannya, dan yang termasuk nabi yang mereka bunuh adalah Nabi Zakariya dan Yahya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Sungguh Kami telah mengambil perjanjian yang terikat dari Bani Israil agar mereka mengamalkan Taurat. Dan telah kami utus kepada mereka para rasul untuk memperkenalkan syariat dan hukum kepada mereka, dan memberi peringatan untuk mereka. Namun setiap kali seorang rasul membawakan mereka sesuatu yang bertentangan dengan hawa nafsu mereka, niscaya mereka akan mendustakan sebagian rasul tersebut, seperti Isa AS dan rasul lainnya, dan membunuh sebagian lainnya seperti Zakaria AS dan Yahya AS"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengambil perjanjian dari Bani Israil dan telah mengutus rasul-rasul kepada mereka. Setiap kali rasul datang kepada mereka dengan membawa apa yang tidak sesuai dengan hawa nafsu mereka, sebagian mereka dustakan dan sebagian yang lain mereka bunuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Allah berfirman, “Sungguh Kami telah mengambil perjanjian Bani Israil,” yaitu, perjanjian mereka yang berat dengan beriman kepada Allah dan menunaikan kewajiban-kewajibanNYa yang telah disinggung pada FirmanNya. \"Dan sesungguhnya Allah telah mengambil perjanjian (dari) Bani Israil dan telah Kami angkat diantara mereka 12 orang pemimpin dan Allah berfirman: “Sesungguhnya Aku beserta kamu, sesungguhnya jika kamu mendirikan shalat dan menunaikan zakat serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka dan kamu pinjamkan kepada Allah pinjaman yang baik sesungguhnya Aku akan menutupi dosa-dosamu. Dan sesungguhnya kamu akan Kumasukkan ke dalam surga yang mengalir air didalamnya sungai-sungai. Maka barangsiapa yang kafir di antaramu sesudah itu, sesungguhnya ia telah tersesat dari jalan yang lurus.\" (Al-Maidah:12). “Dan telah Kami utus kepada mereka rasul-rasul,” yang silih berganti mendakwahi dan membimbing mereka secara intensif, akan tetapi hal itu tidak berhasil dan tidak berguna pada mereka. “Tetapi setiap datang seorang rasul kepada mereka dengan membawa apa yang tidak diingini oleh hawa nafsu mereka,” yaitu, kebenaran, maka mereka mendustakan dan menentangnya dan memperlakukannya dengan perlakuan yang paling buruk, “(maka) sebagian dari rasul-rasul itu mereka dustakan dan sebagian yang lain mereka bunuh.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 70: Perjanjian itu adalah mereka beriman kepada Allah dan rasul-rasul-Nya (lihat surat Al Ma'idah: 12). Yang datang beriringan untuk membimbing mereka. Seperti Nabi Zakariyya dan Nabi Yahya 'alaihimas salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 70",
    "description": "Allah menegaskan bahwa sesungguhnya kami telah mengambil perjanjian dari bani israil, yaitu berupa ikrar mereka untuk beriman kepada Allah dan melaksanakan ajaran taurat yang merupakan syariat bagi mereka, dan untuk mengingatkannya, telah kami utus kepada mereka rasul-rasul yang diberi tugas untuk menjelaskan ajaran kitab suci itu. Akan tetapi, kenyataannya ternyata tidak seperti yang diinginkan. Setiap datang seorang rasul kepada mereka untuk mengingatkan ikrar tersebut dengan membawa atau menyampaikan ajaran agama, tetapi jika apa yang dibawa atau disampaikan itu adalah yang tidak sesuai dengan keinginan mereka, maka sebagian dari rasul-rasul itu mereka dustakan ajaranajarannya dan bahkan sebagian yang lain, seperti nabi zakaria dan nabi yahya, mereka bunuh dengan keji Allah akan selalu memperingatkan manusia yang melakukan kesalahan, tetapi kaum yahudi mengabaikan hal ini, dan mereka mengira bahwa dengan status yang dianugerahi kelebihan, maka tidak akan terjadi bencana apa pun terhadap mereka dengan membunuh nabi-nabi itu. Oleh karena itu, anggapan tersebut telah menyebabkan mereka menjadi buta terhadap kebaikan-kebaikan yang dicontohkan para rasul dan tuli terhadap nasihat-nasihat agama yang disampaikan. Kemudian Allah yang maha pengampun menerima tobat mereka ketika mereka bertobat dan memohon ampunan-Nya. Akan tetapi, ternyata kemudian kebanyakan dari mereka tetap dalam keadaan buta terhadap amal saleh yang diajarkan dan tuli karena tidak mau mendengarkan ajaran agama yang disampaikan, dan sesungguhnya Allah maha melihat terhadap apa saja yang mereka kerjakan."
  }
]