[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah menyangka para pelaku maksiat dari kalangan yahudi itu bahwa sesungguhnya Allah tidak akan menimpakan siksaan pada mereka sebagai balasan kedurhakaan dan penentangan mereka. Dan mereka tetap berlalu dalam syahwat-syahwat, dan mereka telah buta terhadap hidayah, sehingga mereka tidak bisa melihatnya, dan mereka tuli untuk mendengar kebenaran, sehingga tidak dapat mengambil manfaat darinya. Maka Allah menurunkan siksaanNya pada mereka. Kemudian mereka bertaubat kepadaNYa, maka Allah menerima taubat mereka. Kemudian kebanyakan dari mereka buta dan tuli setelah kebenaran jelas bagi mereka. Dan Allah Maha melihat perbuatan-perbuatan mereka, yang baik maupun buruk. Dan Dia akan memberikan balasan kepada mereka atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan mereka mengira bahwa tindakan mereka melanggar perjanjian, mendustakan para rasul, dan membunuh para nabi tidak akan berakibat buruk terhadap mereka. Kemudian mereka menerima akibat yang tidak pernah mereka duga sebelumnya. Mereka buta terhadap kebenaran sehingga mereka tidak mengetahui jalan yang benar. Mereka tuli dari kebenaran sehingga mereka tidak bisa mendengar dan menerimanya. Kemudian berkat kemurahan-Nya Allah menerima tobat mereka. Tetapi setelah itu mereka buta kembali terhadap kebenaran dan telinga mereka tuli, tidak dapat mendengarkan kebenaran. Hal itu dialami oleh sebagian besar dari mereka. Dan Allah Maha Melihat apa yang mereka perbuat. Tidak ada sesuatu pun yang luput dari pengawasan-Nya. Dan Dia akan membalas perbuatan mereka dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Para pembuat tipu daya itu menyangka telah aman dari azab dan siksaan Allah, sehingga mereka semakin berani melanggar larangan dan aturan Allah. Kemudian Allah mengampuni mereka untuk memberi mereka kesempatan atau sebagai istidraj, namun mereka mengulangi kesalahan dan terus berlarut-larut di dalam kezaliman dan kerusakan; sehingga mereka menjadi buta dari memandang kebenaran dan tuli dari mendengarnya. Mereka lupa terhadap sunatullah yang berlaku terhadap umat-umat sebelumnya, tertipu dengan penutupan Allah terhadap aib mereka, dan terlalaikan dengan istidraj yang mereka dapatkan. Allah Maha Mengetahui segala perbuatan mereka dan Allah akan membalasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَحَسِبُوٓا۟ أَلَّا تَكُونَ فِتْنَةٌ (Dan mereka mengira bahwa tidak akan terjadi suatu bencanapun) Yakni mereka menyangka bahwa mereka tidak akan ditimpa musibah dan ujian yang sulit untuk mengukur tingkat keteguhan mereka terhadap perjanjian yang telah disebutkan sebelumnya, hal ini karena mereka terlena dengan ucapan mereka “kami adalah anak-anak Allah dan para kekasihnya”. Akan tetapi Allah telah menurunkan musibah yang besar kepada mereka. فَعَمُوا۟ وَصَمُّوا۟ (maka (karena itu) mereka menjadi buta dan tuli) Yakni buta dalam melihat petunjuk, dan tuli dalam mendengarkan kebenaran. ثُمَّ تَابَ اللهُ عَلَيْهِمْ (kemudian Allah menerima taubat mereka) Yakni jika mereka memohon taubat, sehingga Allah mengangkat bencana dan musibah dari mereka. ثُمَّ عَمُوا۟ وَصَمُّوا۟ كَثِيرٌ مِّنْهُمْ ۚ( kemudian kebanyakan dari mereka buta dan tuli (lagi)) Ini mengisyaratkan pada apa yang mereka perbuat setelah mereka bertaubat, diantaranya adalah pembunuhan mereka terhadap Nabi Yahya dan rencana mereka membunuh Nabi Isa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Orang-orang Yahudi beranggapan bahwa mereka tidak akan mendapatkan musibah, ujian, dan azab yang agung karena membunuh para nabi dan mendustakan rasul itu tidak akan mengakibatkan, berdasarkan anggapan bahwa mereka adalah putera-putera dan kekasih Allah. Jadi mereka tidak bisa melihat hidayah dan tidak bisa mendengar kebenaran dari nabi-nabi mereka. Lalu mereka menentang aturan-aturan Taurat dan membunuh Yesaya. Kemudian Allah menerima taubat mereka ketika mereka mau bertaubat. Lalu Allah mengangkat kekeringan yang menimpa mereka dan menyelamatkan mereka dari penindasan orang-orang Babilonia. Kemudian banyak dari mereka yang buta dan tuli setelah adanya penjelasan tentang kenabian Muhammad SAW, dan sebelum itu mereka membunuh Zakaria dan berusaha membunuh Isa. Dan Allah itu mengawasi amal perbuatan mereka dan akan membalas mereka di akhirat. Dan sedikit dari mereka yang selamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengira} berprasangka {bahwa tidak akan terjadi fitnah} sesuatu yang mengakibatkan dosa dan musibah dengan membunuh para nabi dan mendustakan mereka {Lalu mereka menjadi buta dan tuli. Kemudian Allah menerima taubat mereka, kemudian banyak di antara mereka buta dan tuli. Allah Maha Melihat apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “Dan mereka mengira bahwa tidak akan terjadi suatu bencana pun,” maksudnya, mereka menyangka bahwa kemaksiatan dan pendustaan mereka tidak menyeret hukuman dan azab atas mereka. Mereka terus berjalan di atas kebatilan, mereka buta “dan tuli” dari kebenaran. “kemudian” Allah mengangkatnya dan “menerima taubat mereka,” manakala mereka bertaubat dan kembali kepadaNya. “Kemudian” mereka terus berjalan di atas itu sehingga kebanyakan dari mereka berbalik kepada keadaan yang buruk. “Kebanyakan dari mereka buta dan tuli (lagi)” dengan sifat ini, sementara yang minoritas terus berjalan di atas taubat dan iman mereka. “Dan Allah Maha Melihat apa yang mereka kerjakan.” Lalu Dia membalas setiap orang yang beramal dengan amalnya. Jika baik maka balasannya baik, jika buruk maka balasannya buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 71: Oleh karena itu, Dia akan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 71",
    "description": "Allah akan selalu memperingatkan manusia yang melakukan kesalahan, tetapi kaum yahudi mengabaikan hal ini, dan mereka mengira bahwa dengan status yang dianugerahi kelebihan, maka tidak akan terjadi bencana apa pun terhadap mereka dengan membunuh nabi-nabi itu. Oleh karena itu, anggapan tersebut telah menyebabkan mereka menjadi buta terhadap kebaikan-kebaikan yang dicontohkan para rasul dan tuli terhadap nasihat-nasihat agama yang disampaikan. Kemudian Allah yang maha pengampun menerima tobat mereka ketika mereka bertobat dan memohon ampunan-Nya. Akan tetapi, ternyata kemudian kebanyakan dari mereka tetap dalam keadaan buta terhadap amal saleh yang diajarkan dan tuli karena tidak mau mendengarkan ajaran agama yang disampaikan, dan sesungguhnya Allah maha melihat terhadap apa saja yang mereka kerjakan. Bila pada ayat-ayat yang lalu diterangkan tentang penyimpanganpenyimpangan yang dilakukan orang yahudi, maka pada ayat-ayat berikut dijelaskan kesalahan-kesalahan yang dilakukan oleh umat nasrani. Paparan tentang penyimpangan ini diawali dengan pernyataan bahwa sesungguhnya telah kafir dan menyimpang dari akidah yang benar orang-orang yang berkata, sesungguhnya Allah itu ialah al-masih putra maryam. Padahal isa al-masih sendiri berkata kepada mereka, wahai bani israil! sembahlah Allah yang merupakan tuhanku dan juga sebagai tuhanmu. Mereka mestilah mengetahui pula bahwa sesungguhnya barang siapa mempersekutukan Allah dengan sesuatu, maka pasti Allah akan mengharamkan surga baginya yang merupakan balasan bagi yang taat dan tidak menyimpang dari tuntunan-Nya, dan tempat yang disediakan bagi-Nya ialah neraka, dan tidak ada seorang penolong pun bagi orang-orang zalim itu yang akan membantunya, baik ketika di dunia, maupun kelak di akhirat."
  }
]