[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah bersumpah bahwa sesungguhnya orang-orang yang mengatakan bahwa Allah adalah Isa al-masih putra Maryam, sungguh mereka telah kafir dengan pernyataan mereka ini dan Allah mengabarkan bahwa sesungguhnya al-masih berkata kepada Bani israil, ”sembahlah Allah semata, tidak ada sekutu bagiNya. Aku dan kalian sama dalam penghambaan diri kepada Allah.” sesungguhnya orang yang menyembah bersama Allah selainNya, sungguh Allah mengharamkan surga atas dirinya dan menjadiakn neraka sebagai tempat tinggalnya. Dan tidak ada baginya seorang penolong yang menyelamatkannya dari neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Sungguh telah kafir orang-orang Nasrani yang menyatakan bahwa Allah adalah Isa Al-Masih putra Maryam. Karena telah menyematkan sifat ketuhanan kepada selain Allah. Padahal Isa Al-Masih putra Maryam sendiri berkata kepada mereka, “Wahai Bani Israil! Sembahlah Allah saja, karena Dia adalah Rabbku dan juga Rabb kalian. Jadi, kita sama-sama hamba Allah.” Hal itu karena siapa saja yang menyekutukan Allah dengan sesuatu, maka dia dilarang masuk ke dalam Surga untuk selama-lamanya. Tempat tinggalnya adalah Neraka Jahanam. Tidak ada yang dapat menolong dan membantunya di sisi Allah. Dan tidak ada yang dapat menyelamatkannya dari azab yang menunggunya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Setelah membahas tentang keadaan Bani Israil yang suka melanggar perjanjian, membunuh para nabi, dan mendustakan risalah yang mereka bawa; maka setelahnya datang pembahasan tentang kesesatan orang-orang Nasrani dalam perkara Isa Al-masih, dan keyakinan mereka bahwa dia adalah anak Allah, dan Allah adalah satu dari tiga oknum. Maha Tinggi Allah dari anak dan pasangan yang mereka nisbahkan kepada-Nya. Dalam ayat-ayat ini terdapat pernyataan yang jelas tentang kekafiran orang yang tersesat dalam perkara Isa yang menyangka bahwa dia adalah Tuhan atau anak Tuhan. Nabi Isa berlepas diri dari apa yang disangkakan oleh orang-orang Nasrani, karena dia telah diutus dengan tauhid dan menyeru kepada keimanan yang murni, memperingatkan dari kesyirikan dan akibatnya, dan menjelaskan bahwa kesyirikan adalah sebab dijauhkan dari surga dan dimasukkan ke dalam neraka, serta orang musyrik tidak akan mendapat penolong. Kesyirikan dihubungkan dengan kezaliman karena ia merupakan kezaliman yang paling besar dan paling buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. لَقَدْ كَفَرَ الَّذِينَ قَالُوٓا۟ إِنَّ اللهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۖ (Sesungguhnya telah kafirlah orang-orang yang berkata: “Sesungguhnya Allah ialah Al Masih putera Maryam”) Orang-orang yang mengatakan ucapan ini adalah golongan dari orang-orang Nasrani yang disebut dengan Ya’qubiyah. Pendapat lain mengatakan: Malkaniyah. Mereka mengatakan bahwa Dzat Allah merasuk kedalam diri Isa. Maka Allah membantah mereka dengan firman-Nya: وَقَالَ الْمَسِيحُ يٰبَنِىٓ إِسْرٰٓءِيلَ اعْبُدُوا۟ اللهَ رَبِّى وَرَبَّكُمْ وَقَالَ الْمَسِيحُ يٰبَنِىٓ إِسْرٰٓءِيلَ اعْبُدُوا۟ اللهَ رَبِّى وَرَبَّكُمْ ۖ( padahal Al Masih (sendiri) berkata: “Hai Bani Israil, sembahlah Allah Tuhanku dan Tuhanmu”) Yakni hakikat sebenarnya adalah Isa al-Masih telah mengatakan perkataan ini, lalu bagaimana ia mengklaim sebagai Tuhan padahal ia telah mengaku sendiri bahwa ia adalah hamba seperti mereka. إِنَّهُۥ مَن يُشْرِكْ بِاللهِ فَقَدْ حَرَّمَ اللهُ عَلَيْهِ الْجَنَّةَ (Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah, maka pasti Allah mengharamkan kepadanya surga) Ada pendapat mengatakan bahwa ini adalah perkataan Isa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Sungguh orang orang yang berkata “Sesungguhnya Allah adalah Isa Al-Masih” itu telah kufur. Mereka itu adalah kaum Ya’kubiyyah atau Milkaniyyah. Mereka berkata: “Sesungguhnya Allah bertempat dalam dzatnya Isa” Lalu Allah membalas mereka dengan memerintah Isa Al-Masih untuk berkata kepada Bani Israil: “Sembahlah Allah, Tuhanku dan Tuhan kalian, penciptaku dan pencipta kalian. Bagimana bisa seorang hamba menjadi Tuhan?!” Sesungguhnya orang yang menyekutukan Allah, maka Dia akan dilarang Allah memasuki surgaNya dan tempatnya adalah di neraka selamanya. Dan tidaklah bagi orang-orang yang menzalimi diri sendiri dengan menyembah selain Allah itu penolong yang bisa menolong mereka dari azab akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah ingkar orang-orang yang berkata, “Sesungguhnya Allah itu adalah Isa Al-Masih putra Maryam.” Isa Al masih berkata, “Wahai Bani Israil, sembahlah Allah, Tuhanku dan Tuhan kalian!” Sesungguhnya siapa yang mempersekutukan Allah, maka sungguh Allah mengharamkan surga baginya dan tempatnya adalah neraka. Tidak ada seorang penolong pun bagi orang-orang zalim itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Allah mengabarkan tentang kekufuran orang-orang Nasrani dengan ucapan mereka, “Sesungguhnya Allah ialah al-Masih putra Maryam,” dengan alasan bahwa dia keluar dari ibu tanpa ayah dan menyimpang dari kebiasaan ciptaan Allah. Padahal al-Masih sendiri mendustakan klaim mereka dan berkata kepada mereka, “Hai Bani Israil, sembahlah Allah, Tuhanku dan Tuhanmu.” Isa menetapkan dirinya sebagai hamba secara total dan menetapkan bahwa Allah adalah Rabb bagi semua makhluk. “Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah,” dengan salah seorang makhluk, baik Nabi Isa atau lainnya, “maka pasti Allah mengharamkan kepadanya surga, dan tempatnya ialah neraka.” Hal itu karena dia menyamakan ciptaan dengan penciptanya dan memalingkan apa yang sebenarnya, untuk itulah hamba itu diciptakan, yaitu ibadah yang murni, kepada hamba yang tidak berhak mendapatkannya; maka dia berhak mendapatkan kekekalan di neraka. “Tidaklah ada bagi orang-orang zhalim itu seorang penolong pun,” yang menyelamatkan mereka dari azab Allah atau menolak sebagian yang menimpanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 72: Ayat ini merupakan pernyataan tentang kafirnya orang-orang Nasrani. Yang menunjukkan bahwa beliau adalah seorang hamba, bukan tuhan. Yang menyelamatkan mereka dari azab Allah atau menghindarkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 72",
    "description": "Bila pada ayat-ayat yang lalu diterangkan tentang penyimpanganpenyimpangan yang dilakukan orang yahudi, maka pada ayat-ayat berikut dijelaskan kesalahan-kesalahan yang dilakukan oleh umat nasrani. Paparan tentang penyimpangan ini diawali dengan pernyataan bahwa sesungguhnya telah kafir dan menyimpang dari akidah yang benar orang-orang yang berkata, sesungguhnya Allah itu ialah al-masih putra maryam. Padahal isa al-masih sendiri berkata kepada mereka, wahai bani israil! sembahlah Allah yang merupakan tuhanku dan juga sebagai tuhanmu. Mereka mestilah mengetahui pula bahwa sesungguhnya barang siapa mempersekutukan Allah dengan sesuatu, maka pasti Allah akan mengharamkan surga baginya yang merupakan balasan bagi yang taat dan tidak menyimpang dari tuntunan-Nya, dan tempat yang disediakan bagi-Nya ialah neraka, dan tidak ada seorang penolong pun bagi orang-orang zalim itu yang akan membantunya, baik ketika di dunia, maupun kelak di akhirat. Selain menganggap isa al-masih sebagai tuhan, mereka juga menuhankan yang lainnya. Karena itu sungguh, telah kafir orang-orang yang dengan sadar mengatakan bahwa Allah itu adalah salah satu dari tuhan yang tiga. Padahal sesungguhnya sekali-kali tidak ada tuhan yang berhak disembah selain dari tuhan yang esa. Jika mereka tetap pada keyakinan salah itu dan tidak berhenti dari apa yang mereka katakan itu, pasti orangorang yang kafir yang tetap mempersekutukan tuhan di antara mereka akan ditimpa azab yang pedih, sebagai akibat dari penyimpangan itu."
  }
]