[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah orang-orang nasrani kembali kepada Allah dan bertaubat dari apa yang telah mereka ucapkan, dan memohon ampunun kepada Allah ? Dan Allah mengampuni dosa-dosa orang-orang yang bertaubat lagi Maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Tidakkah mereka mau menarik pernyataan mereka itu dan bertobat kepada Allah seraya memohon ampun kepada-Nya atas perbuatan musyrik yang telah mereka lakukan? Sedangkan Allah Maha Pengampun bagi orang yang bertobat dari dosa apa pun walaupun dosa itu berupa kufur kepada-Nya dan Maha Pengasih bagi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Ayat ini merupakan dorongan untuk bertaubat dan memohon ampun dari segala dosa sebesar apapun. Dan Adakah dosa yang lebih besar daripada dosa syirik?! Maka hendaklah mereka bertaubat dan memohon ampun kepada Allah, karena Dia Maha Pengampun bagi orang yang bertaubat dan Maha menyayangi hamba-hamba-Nya. Dan tidak ada jalan untuk mendapatkan ampunan dari dosa-dosa kecuali dengan bertaubat dan memohon ampun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. أَفَلَا يَتُوبُونَ إِلَى اللهِ وَيَسْتَغْفِرُونَهُۥ ۚ (Maka mengapa mereka tidak bertaubat kepada Allah dan memohon ampun kepada-Nya?) Yakni atas kedustaan atas Allah ini, yang menjadikan Dia murka dan hendak menyiksanya kerena hal ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Mengapa mereka tidak bertaubat kepada Allah dari ucapan mereka, dan meminta ampunan dari perbuatan mereka berupa kejahatan paling besar, yaitu kesyirikan. Dan Allah itu Maha Pengampun dosa orang-orang yang bertaubat dan maha Penyayang terhadap mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah mereka bertaubat kepada Allah dan memohon ampunan kepadaNya, padahal Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Kemudian Allah menyeru mereka untuk bertaubat dari apa yang mereka ucapkan. Dia menjelaskna bahwa Dia menerima taubat dari hamba-hambaNya. Dia berfirman, “ Maka mngeapa mereka tidak bertaubat kepada Allah?” maksudnya, kembali kepada apa yang dicintai dan di ridhai oelh Allah, yaitu ikrar tauhid bagi Allah, pengakuan bahwa Isa adalah hamba dan utusanNya dan meninggalkan apa yang mereka katakan, “ dan memohon ampun kepadaNya” dari apa yang mereka katakan. “ Dan Allah Maha Pengampun Lagi Maha Penyayang,” yakni, dia mengampuni dosa orang-orang yang bertaubat walaupun dosanya mencapai awan di langit. Dia menyayangi mereka dengan menerima taubat mereka dan mengganti keburukan dengan kebaikan. Allah membuka ajakan kepada taubat dengan penawaran yang sangat halus dan lemut dalam FirmanNya, “ Maka mengapa mereka tidak bertaubat kepada Allah?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 74: Ya Allah, sungguh tinggi semua sifat-Mu, sungguh indah nama-nama-Mu, sungguh terpuji perbuatan-Mu, meskipun Engkau menguasai manusia semuanya dan mampu menghukum mereka yang kafir dan bermaksiat kepada-Mu, namun Engkau Maha Santun, Engkau tidak langsung menghukum mereka, bahkan mengajak mereka untuk bertobat, dan Engkau menjanjikan, bahwa jika mereka bertobat, tentu mereka akan mendapatkan Engkau Maha Pengampun lagi Maha Penyayang. Dengan mengikrarkan keesaan Allah dan bahwa Isa adalah hamba Allah dan Rasul-Nya. Dia mengampuni dosa-dosa orang yang bertobat meskipun setinggi langit, serta menyayangi mereka dengan menerima tobat mereka dan menggantikan keburukan dengan kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 74",
    "description": "Setelah mendapatkan penjelasan tentang keesaan tuhan, maka mengapa mereka, orang-orang yang menganggap isa putra maryam sebagai tuhan itu, tidak bertobat kepada Allah sebagai satu-satunya tuhan yang tidak ada sekutu bagi-Nya dan memohon ampun kepada-Nya' ketahuilah bahwa Allah itu maha pengampun atas semua dosa dari mereka yang mau bertobat dan maha penyayang terhadap semua makhluk-Nya ketahuilah, wahai umat nasrani, sesungguhnya al-masih putra maryam itu hanyalah seorang rasul yang diutus Allah. Selain itu, perlu diketahui bahwa sesungguhnya telah berlalu pula sebelumnya beberapa rasul yang juga merupakan utusan-Nya, dan ibunya yang merupakan wanita pilihan adalah seorang yang berpegang teguh pada kebenaran. Kedua-duanya sebagaimana layaknya manusia biasa juga memakan makanan, meminum minuman, merasakan sakit, gembira, sedih, dan lainnya. Oleh karena itu, perhatikan bagaimana kami telah menurunkan wahyu dan mengutus rasul untuk menjelaskan kepada mereka, yaitu para ahli kitab, tentang tanda-tanda kekuasaan kami, kemudian sesudah itu perhatikan pula bagaimana mereka berpaling dari memperhatikan ayatayat kami yang merupakan tanda-tanda keesaan tuhan."
  }
]