[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah al-masih putra Maryam kecuali seorang rasul sebagaimana rasul-rasul yang telah mendahuluinya. Dan ibunya telah membenarkan dengan keimanan yang teguh dengan ilmu dan amal, dan mereka berdua seperti halnya orang lain dari kalangan manusia yang membutuhkan makanan. Dan tidak mungkin Tuhan itu berupa orang yang membutuhkan makanan supaya dapat hidup. Maka perhatikanlah (wahai rasul), keadaan orang-orang kafir tersebut. Sesungguhnya Kami telah menjelaskan tanda-tanda yang menunjukan keesaan Kami dan kebatilan anggapan yang mereka dengungkan pada diri para nabi Allah. Selain itu, mereka sesat dari jalan kebenaran yang Kami tunjukan mereka kepadanya. Kemudian lihatlah bagaimana mereka dipalingkan dari kebenaran setelah adanya penjelasan ini?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Isa Al-Masih putra Maryam hanyalah seorang utusan Allah sebagaimana para rasul lainnya. Ia akan mengalami kematian sebagaimana yang lain. Dan ibunya, Maryam -‘Alaihassalām- adalah seorang wanita yang jujur dan terpercaya. Keduanya mengonsumsi makanan, karena keduanya memang membutuhkannya. Bagaimana mungkin keduanya menjadi tuhan, sedangkan keduanya membutuhkan makanan. Maka perhatikanlah -wahai Rasul-, bagaimana Kami menjelaskan kepada mereka tanda-tanda yang menunjukkan keesaan Rabb dan menunjukkan kesalahan sikap mereka yang berlebih-lebihan dalam menyematkan sifat ketuhanan kepada selain Allah -Subḥānahu-, sedangkan mereka menolak tanda-tanda tersebut. Dan perhatikanlah! bagaimana mereka dipalingkan dari kebenaran, padahal sudah terdapat tanda-tanda yang terang benderang menunjukkan keesaan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Kemudian Allah menjelaskan keyakinan yang benar tentang Isa Al-masih. Dia adalah manusia biasa yang diutus sebagai Rasul. Dia dinisbahkan kepada Maryam karena tidak memiliki ayah, seandainya dia memiliki ayah niscaya dia akan dinisbahkan kepadanya. Allah menciptakannya tanpa seorang ayah dengan hikmah yang mendalam, yaitu untuk menunjukkan kesempurnaan kuasa-Nya dan kehebatan penciptaan-Nya. Dia merupakan manusia biasa yang diutus sebagai Rasul, dia layaknya rasul-rasul sebelumnya. Allah mengutusnya di atas jalan para rasul tersebut dan menetapkannya di atas tuntutan mereka. Sedangkan ibunya adalah wanita yang benar dan senantiasa menjalankan ibadah. Dia dan anaknya biasa memakan makanan, karena kebutuhan terhadap makan dan minum merupakan fitrah manusia. Sedangkan Tuhan adalah Dzat Yang Maha Kaya dan Maha Kuat, tidak ada yang menyerupainya. Maka bagaimana mereka bisa menganggap Isa sebagai Tuhan atau anak tuhan?! Pikirkanlah Bagaimana Allah menyampaikan hujjah kepada mereka dari berbagai macam sisi. Namun mereka tetap berpaling dari kebenaran, memutar balikan fakta, dan membenarkan kebatilan; padahal ayat-ayat Allah sudah sangat jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. مَّا الْمَسِيحُ ابْنُ مَرْيَمَ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ (Al Masih putera Maryam itu hanyalah seorang Rasul yang sesungguhnya telah berlalu sebelumnya beberapa rasul) Yakni hanya sebatas pembawa risalah tidak lebih, sebagaimana yang kalian anggap sampai menjadikannya Tuhan atau anak Allah. Namun ia merupakan bagian dari rasul-rasul yang telah berlalu sebelumnya. Apapun mu’jizat-mu’jizat yang ia datangkan tidak menjadikannya sebagai Tuhan, karena rasul-rasul sebelumnya juga memiliki mu’jizat-mu’jizat; Allah telah menjadikan tongkat Nabi Musa hidup, dan menciptakan Nabi Adam tanpa bapak dan ibu, jika kalian menganggap seseorang bisa menjadi Tuhan karena hal-hal tersebut maka berarti Rasul-Rasul sebelumnya juga merupakan Tuhan. وَأُمُّهُۥ صِدِّيقَةٌ ۖ( dan ibunya seorang yang sangat benar) Yakni benar dalam perkataannya dan membenarkan risalah yang dibawa oleh anaknya. Dan itu tidak menjadikannya sebagai tuhan, akantetapi ia seperti wanita-wanita yang lain. كَانَا يَأْكُلَانِ الطَّعَامَ ۗ( kedua-duanya biasa memakan makanan) Sebagaimana manusia yang lain. Yakni barangsiapa yang memakan makanan sebagaimana makhluk-makhluk yang lain maka ia bukanlah Tuhan, karena dia tidaklah makan kecuali karena ia membutuhkannya, andaisaja ia meninggalkan makan pasti ia akan mati, dan Tuhan tidaklah mati; dan orang yang memakan makanan akan pergi ke kamar kecil untuk buang hajat, Maha Suci Allah dari apa yang mereka katakan. انظُرْ كَيْفَ نُبَيِّنُ لَهُمُ الْاٰيٰتِ(Perhatikan bagaimana Kami menjelaskan kepada mereka (ahli kitab) tanda-tanda) Ini merupakan kalimat takjub kepada mereka yang menjadikan sifat-sifat tersebut sebagai sifat yang menjadikannya Tuhan. ثُمَّ انظُرْ أَنَّىٰ يُؤْفَكُونَ(kemudian perhatikanlah bagaimana mereka berpaling) Yakni bagaimana mereka masih tersesat dari kebenaran setelah keterangan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Tidaklah Isa Al-Masih itu kecuali seorang rasul manusia seperti para rasul sebelumnya. Dan mukjizatnya itu seperti para rasul yang tidak seharusnya menjadi Tuhan, sebagaimana penciptaan Adam tanpa orang tua, dan tongkat Musa. Dan ibu Isa itu sangat jujur dalam ucapannya bahwa dia dan anaknya, Isa, adalah manusia yang makan layaknya manusia. Dan orang yang membutuhkan makanan bukanlah Tuhan, karena jika dia tidak makan, maka akan binasa. Dan Tuhan itu tidak bisa mati. Perhatikanlah wahai rasul, bagaimana Kami menerangkan kepada mereka dalil-dalil yang menunjukkan kepada keesaan kami. Dan perhatikanlah bagaimana setan memalingkan mereka agar tidak merenungi tentang bukti-bukti itu, dan dari kebenaran menuju kebathilan setelah adanya keterangan ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Isa Al Masih putra Maryam tidak lain hanyalah seorang rasul. Sudah berlalu} berlalu {sebelumnya beberapa rasul. Ibunya adalah seorang yang berpegang teguh pada kebenaran} orang yang sangat jujur dan benar {Keduanya makan makanan. Perhatikanlah bagaimana Kami menjelaskan ayat-ayat kepada mereka, kemudian perhatikanlah bagaimana mereka dipalingkan} bagaimana mereka dibelokkan dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Kemudian Allah mejelaskan hakikat Al-Masih dan ibunya yang merupakan kebenaran, Dia berfirman, “ Al-Masih putra Maryam itu hanyalah seorang Rasul yang sungguh telah berlalu sebelumnya beberap Rasul.” Maksudnya, ini adalah predikat dan kedudukannya yang paling tinggi, bahwa Dia adalah di antara hamba-hamba Allah yang di utus, yang mana para Rasul tersebut tidak memiliki wewenang dan hak peletakan syariat selain apa yang Allah mengutus mereka denganya. Dia dan Rasul-Rasul sebelumnya adalah sejenis, tidak ada keistimewaan dari di bandingkan nabi-nabi yang lain sehingga ia keluar dari tingkat kemanusiaan manjadi tingkat ketuhanan. “ Dan ibunya,” Maryam adalah “seorang yang sangat benar.” Maksudnya, inilah kedudukan yanhg paling tinggi, yaitu dia termasuk yang shadiqin (yang sangat jujur dan benar dalam iman) yang merupaka derajat mahkluk yang paling tinggi sesudah para nabi. Dan merupakan ash-shidiq ( jujur dan benar) adalah ilmu yang berguna yang membuahkan keyakinan dan amal shalih. Ini adalah bukti bahwa Maryam bukanlah seorang nabi. Akan tetapi derajat tertinggi sebagai ash-shidiq. Dan itu cukuplah sebagai keutamaan dan kemuliaan baginya. Begitu pula wanita-wanita yang lain. Tak satupun dari mereka yang diangkat menjadi nabi, karena Allah menjadikan kenabian pada kelompok yang paling sempurna yaitu laki-laki, sebagaimana FirmanNya, \"Kami tidak mengutus sebelum kamu, melainkan orang laki-laki yang Kami berikan wahyu kepadanya diantara penduduk negeri.\" ( Yusuf: 109) Jika Isa termasuk ka dalam deretan para Nabi dan Rasul yang datang sebelumnya dan ibunya adalah shidiqqah, maka dengan dsar apa orang-orang Nasrani menjadikan keduanya sebagai Tuhan bersama Allah. FirmanNya, “ Kedua-duannya biasa memakan makanan.” Ini adalah dalil yang jelas bahwa keduannya adalah hamba yang fakir, yan membutuhkan makanan dan minuman seperti Bani Adam yang lain. Seandainya keduanya adalah Tuhan, niscaya keduanya tidak memerlukan apa pun, karena Tuhan itu Maha Kaya dan Terpuji. Manakala Allah menjelaskan bukti, Dia berfirman, “ perhatikan bagaimana kami menjelaskan kepada mereka ( Ahli Kitab) tanda-tanda kekuasaan (kami),” yang menjelaskan kepada kebenaran, yanhg menyingkap keyakinan, walaupun begitu ia tidak berguna apa pun kepada mereka, justru mereka tetap memegang kedustaan, kapalsuan, dan kebohongan. Hal itu adalah kezhaliman dan pengingkaran dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 75: Pada ayat ini, Allah Subhaanahu wa Ta'aala menerangkan hakikat yang sebenarnya, yakni bahwa Nabi Isa 'alaihis salam hanyalah seorang rasul sebagaimana rasul-rasul yang lain, sedangkan ibunya Maryam adalah seorang shiddiiqah, orang yang sangat membenarkan, di mana kedudukannya di bawah kedudukan para nabi. Sifat shiddiqiyyah berasal dari ilmu yang bermanfaat yang membuahkan keyakinan dan amal saleh. Maksudnya adalah bahwa Isa 'alaihis salam dan ibunya adalah manusia, yang memerlukan apa yang diperlukan oleh manusia yang lain, seperti makan, minum dan sebagainya. Jika keduanya tuhan tentu, keduanya tidak membutuhkan yang dibutuhkan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 75",
    "description": "Ketahuilah, wahai umat nasrani, sesungguhnya al-masih putra maryam itu hanyalah seorang rasul yang diutus Allah. Selain itu, perlu diketahui bahwa sesungguhnya telah berlalu pula sebelumnya beberapa rasul yang juga merupakan utusan-Nya, dan ibunya yang merupakan wanita pilihan adalah seorang yang berpegang teguh pada kebenaran. Kedua-duanya sebagaimana layaknya manusia biasa juga memakan makanan, meminum minuman, merasakan sakit, gembira, sedih, dan lainnya. Oleh karena itu, perhatikan bagaimana kami telah menurunkan wahyu dan mengutus rasul untuk menjelaskan kepada mereka, yaitu para ahli kitab, tentang tanda-tanda kekuasaan kami, kemudian sesudah itu perhatikan pula bagaimana mereka berpaling dari memperhatikan ayatayat kami yang merupakan tanda-tanda keesaan tuhan. Sebagai peringatan kepada umat nasrani tersebut, Allah memerintahkan kepada rasulullah sebagai berikut. Katakanlah, wahai nabi Muhammad, mengapa kamu mengimani dan menyembah kepada tuhan yang selain Allah, padahal yang kamu yakini itu hanya sesuatu yang tidak akan dapat menimbulkan bencana apa pun kepadamu dan ia tidak pula dapat memberi manfaat apa-apa' dan ketahuilah bahwa Allah maha mendengar semua yang kamu ucapkan lagi maha mengetahui semua yang kamu lakukan."
  }
]