[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang kafir itu, bagaimana mungkin kalian menyekutukan bersama Allah makhluk yang tidak sanggup memudartakan kalian dan tidak sanggup mendatangkan manfaat bagi kalian? Dan Allah maha mendengar ucapan-ucapan hamba-hambaNYa lagi Maha Mengetahui keadaan-keadaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Katakanlah -wahai Rasul-, untuk membantah argumen orang-orang yang menyembah selain Allah, “Apakah kalian menyembah tuhan yang tidak dapat mendatangkan manfaat bagi kalian dan tidak dapat melindungi kalian dari mudarat? Tuhan semacam itu adalah tuhan yang lemah. Sedangkan Allah jauh dari kelemahan. Dan hanya Allah saja Yang Maha Mendengar ucapan-ucapan kalian. Tidak ada satu pun ucapan yang luput dari pendengaran-Nya. Dia juga Maha Mengetahui perbuatan-perbuatan kalian. Tidak ada satu pun perbuatan kalian yang luput dari pengetahuan-Nya. Dan Dia akan membalas kalian dengan balasan yang setimpal.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Mengapa kalian menyembah dan berharap kepada Isa Al-masih serta meyakini bahwa kesesatan kalian dalam perkara Isa itu dapat memberi kalian keselamatan, padahal Isa tidak memiliki kekuasaan untuk memberi manfaat atau mudharat? Mengapa kalian selalu menggaungkan kekafiran ini? Allah Maha Mendengar suara kalian dan Maha Mengetahui perbuatan kalian, baik itu yang nampak maupun yang tersembunyi!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَلَا نَفْعًا ۚ (sesuatu yang tidak dapat memberi mudharat kepadamu dan tidak (pula) memberi manfaat) Yakni bagaimana kalian jadikan Tuhan dan kalian sembah sesuatu yang tidak dapat memberi manfaat dan tidak pula mampu memberi mudharat. Yang dimaksud disini adalah Isa al-Masih dan ibunya, Maryam. وَاللهُ هُوَ السَّمِيعُ الْعَلِيمُ(Dan Allah-lah Yang Maha Mendengar lagi Maha Mengetahui) Dan barangsiapa yang memiliki sifat-sifat ini maka Dia mampu memberi manfaat atau madharat, karena Ilmunya meliputi segala suara dan pengetahuan, dan Dialah Tuhan yang hak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Wahai rasul, katakanlah kepada mereka: “Apakah kalian menyembah sesembahan selain Allah yang tidak bisa memberi mudharat maupun manfaat (yang dimaksud disini adalah Isa Al-Masih dan ibunya) dan tidak mau menyembah Allah yang berkuasa atas segala sesuatu?! Allah adalah Dzat yang Maha mendengan seluruh ucapan dan Maha Mengetahui segala sesuatu yang tersembunyi maupun terang-terangan, selain itu dialah Tuhan yang haq.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Mengapa kalian menyembah selain Allah sesuatu yang tidak dapat mendatangkan mudarat kepada kalian dan tidak pula manfaat” Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Maksudnya, “katakanlah” kepada mereka wahai Rasul, “Mengapa kamu menyembah selain dari Allah?” dari kalangan makhluk yang fakir lagi membutuhkan “yang tidak dapat memberi mudarat kepadamu dan tidak (pula) memberi manfaat?” sementara kamu meninggalkan Dzat yang memonopoli mudarat, manfaat, pemberian, dan pelarangan. “Dan Allah-lah Yang Maha Mendengar” seluruh suara dengan bermacam-macam Bahasa, dengan berbagai ragam hajat kebutuhan. “Lagi Maha Mengetahui” yang lahir, yang batin, yang ghaib, yang Nampak, perkara-perkara yang telah berlalu dan yang akan datang. Dzat yang Mahasempurna dengan sifat-sifat yang demikian inilah yang berhak untuk menerima seluruh ibadah dan diikhlaskan untukNya agama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 76: Yang merupakan makhluk yang fakir lagi membutuhkan sesuatu. Semua perkataanmu dengan berbagai bahasa dan beraneka kebutuhan. Semua keadaanmu. Dia mengetahui yang nampak maupun yang tersembunyi, yang lalu maupun yang akan datang. Dia Maha Kaya dan tidak membutuhkan sesuatu pun dari makhluk-Nya, oleh karenanya hanya Dia yang berhak disembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 76",
    "description": "Sebagai peringatan kepada umat nasrani tersebut, Allah memerintahkan kepada rasulullah sebagai berikut. Katakanlah, wahai nabi Muhammad, mengapa kamu mengimani dan menyembah kepada tuhan yang selain Allah, padahal yang kamu yakini itu hanya sesuatu yang tidak akan dapat menimbulkan bencana apa pun kepadamu dan ia tidak pula dapat memberi manfaat apa-apa' dan ketahuilah bahwa Allah maha mendengar semua yang kamu ucapkan lagi maha mengetahui semua yang kamu lakukan. Selain mempersekutukan tuhan, ternyata sebagian dari ahli kitab juga sering bersikap melampaui batas. Oleh karena itu, Allah memerintah kepada rasulullah untuk mengingatkan mereka. Katakanlah, hai ahli kitab, janganlah kamu berlebih-lebihan atau melampaui batas dengan cara yang tidak benar dalam berkeyakinan dan melaksanakan ajaran agamamu. Selain itu, hendaknya kamu semua tidak bersikap taklid dan jangan pula kamu mengikuti keinginan atau hawa nafsu orang-orang yang telah tersesat sejak masa dahulu, yaitu sejak sebelum kedatanganku. Sebab pada hakikatnya, mereka itu merupakan orang yang sesat, dan mereka dengan perilaku dan keinginan itu juga telah menyesatkan banyak manusia. Dan ketahuilah bahwa mereka sendiri itu sungguh telah tersesat dari jalan yang lurus yang telah ditetapkan Allah."
  }
]