[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada kaum nasrani, ”janganlah kalian berbuat melampaui garis kebenaran dalam perkara yang kalian yakini terkait al-masih. Dan janganlah kalian mengikuti hawa nafsu kalian sebagaimana golongan yahudi mengikuti hawa nafsu mereka dalam urusan agama, sehingga mereka terjurumus kedalam kesesatan, dan membawa banyak manusia kepada kekufuran kepada Allah, dan mereka keluar dari jalan istiqamah menuju lorong petaka dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Katakanlah -wahai Rasul-, kepada orang-orang Nasrani, “Janganlah kalian melampaui batas dalam mengikuti kebenaran yang diperintahkan kepada kalian. Dan janganlah kalian berlebih-lebihan dalam menghormati orang yang diperintahkan kepada kalian untuk menghormatinya, seperti para Nabi, sehingga kalian berkeyakinan bahwa orang tersebut memiliki sifat ketuhanan, sebagaimana yang kalian lakukan terhadap Isa putra Maryam. Hal itu disebabkan karena kalian mengikuti para pendahulu kalian yang tersesat dan menyesatkan banyak orang. Dan mereka pun tersesat dari jalan yang benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Allah menyeru mereka dengan sebutan Ahli kitab untuk melarang mereka dari sifat berlebih-lebihan dalam beragama. Para Ahli kitab masih dituntut untuk menyeru kepada tauhid dan membuang kesyirikan, dan mereka merupakan penjaga agama mereka. Maka mengapa mereka memasukkan sesuatu yang bukan termasuk dari bagian agama tersebut? Kemudian Allah melarang mereka dari mengikuti hawa nafsu para pendahulu mereka dalam kesesatan, sehingga mereka dapat tersesat dan menyesatkan serta tersesat dari jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. يٰٓأَهْلَ الْكِتٰبِ لَا تَغْلُوا۟ فِى دِينِكُمْ غَيْرَ الْحَقِّ (Hai Ahli Kitab, janganlah kamu berlebih-lebihan dengan cara tidak benar dalam agamamu) Allah melarang mereka berlebih-lebihan dan melampaui batas, seperti perbuatan mereka menetapkan sifat ketuhanan bagi Isa, dan berjalan diatas jalan hidup berlebih-lebihan dengan cara yang tidak benar. Adapun berlebih-lebihan dalam kebenaran seperti mengerangkan seluruh kekuatan untuk mencari kebenaran tersebut maka hal ini bukanlah hal yang tercela. وَلَا تَتَّبِعُوٓا۟ أَهْوَآءَ قَوْمٍ قَدْ ضَلُّوا۟ مِن قَبْلُ(Dan janganlah kamu mengikuti hawa nafsu orang-orang yang telah sesat dahulunya) Mereka adalah sebagian pendahulu dari golongan orang-orang Yahudi dan Nasrani, sebelum diutusnya Nabi Muhammad. وَأَضَلُّوا۟ كَثِيرًا(dan mereka telah menyesatkan kebanyakan) Yakni banyak dari manusia. وَضَلُّوا۟ عَن سَوَآءِ السَّبِيلِ(dan mereka tersesat dari jalan yang lurus) Yakni pendahulu mereka tersebut telah tersesat dan menyesatkan orang banyak sebelum Rasulullah diutus, serta mereka juga tersesat setelah Allah mengutus Rasulullah karena mereka membuat jalan kesesatan bagi yang kemudian dipakai oleh generasi setalahnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Untukmu yang tidak yakin dengan jalan kebenaran yang kamu tempuh, maka apa yang ia lihat seakan membawanya ke kanan dan terkadang ia merasa bahwa jalan ini ke kiri, dengan apa kamu mengajak orang lain kepada jalan yang benar ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Wahai rasul, katakanlah: “Wahai orang-orang nasrani, janganlah kalian melewati batas akal sehat, dan janganlah membesar-besarkan Isa Al-Masih dengan menganggapnya sebagai Tuhan dan anak Allah, sehingga kalian berpaling dari kebenaran menuju kebathilan. Dan janganlah kalian mengikuti hawa nafsu para pendahulu kalian dari golongan orang-orang Yahudi dan Nasrani sebelum diutusnya nabi Muhammad. Sesungguhnya mereka itu menyimpang dari kebenaran, dan menyesatkan banyak manusia dengan menyebar kekufuran dan kesesatan sebelumnya. Dan setelah adanya pengutusan Nabi Muhammad mereka tersesat dari jalan yang lurus”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Ahlul kitab, janganlah kalian berlebih-lebihan} melebihi batas {dalam agama kalian tanpa kebenaran. Janganlah kalian mengikuti hawa nafsu kaum yang benar-benar tersesat sebelum kalian dan telah menyesatkan banyak orang serta mereka sendiri pun tersesat dari jalan yang lurus.”} jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Allah berfirman kepada NabiNya, “Katakanlah, ‘Hai Ahli Kitab, janganlah kamu berlebih-lebihan (melampaui batas) dengan cara tidak benar dalam agamamu’. “ Maksudnya, kamu jangan melampaui batas kebenaran kepada kebatilan. Hal itu seperti ucapan mereka tentang Isa al-Masih yang telah disebutkan di atas, juga seperti sikapmu yang berlebih-lebihan pada sebagian tetua (tokoh) demi mengikuti hawa nafsu “orang-orang yang telah sesat dahulunya (sebelum kedatangan Muhammad), artinya, kesesatan mereka memang telah ada sebelumnya, “dan mereka telah menyesatkan kebanyakan” manusia dengan mengajak mereka kepada agama yang mereka anut. “Dan mereka tersesat dari jalan yang lurus.” Artinya, jalan yang benar. Maka mereka mengumpulkan antara kesesatan dan menyesatkan (orang lain). Mereka itu adalah para imam kesesatan, di mana Allah memperingatkan kita dari mereka dan dari mengikuti hawa nafsu mereka yang sesat dan pandangan mereka yang menyimpang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 77: Seperti menempatkan Nabi Isa 'alaihis salam melebihi posisinya sebagai hamba Allah dan Rasul-Nya serta menjadikan ulama dan pendeta mereka sebagai tuhan dengan menghalalkan semua yang mereka perintahkan meskipun diharamkan Allah atau mengharamkan apa yang mereka tetapkan meskipun dihalalkan Allah. Yaitu nenek moyang mereka. Mereka inilah pemimpin kesesatan, di mana diri mereka tersesat dan menyesatkan orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 77",
    "description": "Selain mempersekutukan tuhan, ternyata sebagian dari ahli kitab juga sering bersikap melampaui batas. Oleh karena itu, Allah memerintah kepada rasulullah untuk mengingatkan mereka. Katakanlah, hai ahli kitab, janganlah kamu berlebih-lebihan atau melampaui batas dengan cara yang tidak benar dalam berkeyakinan dan melaksanakan ajaran agamamu. Selain itu, hendaknya kamu semua tidak bersikap taklid dan jangan pula kamu mengikuti keinginan atau hawa nafsu orang-orang yang telah tersesat sejak masa dahulu, yaitu sejak sebelum kedatanganku. Sebab pada hakikatnya, mereka itu merupakan orang yang sesat, dan mereka dengan perilaku dan keinginan itu juga telah menyesatkan banyak manusia. Dan ketahuilah bahwa mereka sendiri itu sungguh telah tersesat dari jalan yang lurus yang telah ditetapkan Allah. Bila pada ayat-ayat yang lalu diterangkan tentang penyimpangan umat nasrani, pada ayat-ayat berikut dijelaskan tentang kutukan Allah pada orang yahudi yang kafir. Allah menerangkan bahwa orang-orang kafir dari bani israil, yaitu mereka yang selalu ingkar dan mengabaikan perjanjiannya dengan Allah, telah dilaknat melalui atau dengan perantaraan lisan nabi dawud dan isa putra maryam. Kutukan Allah yang demikian itu, disebabkan karena mereka durhaka dengan tidak menepati janji yang telah diikrarkan dan selalu melampaui batas dalam melaksanakan ajaran dan tuntunan agama, sehingga cenderung mengarah pada kesesatan."
  }
]