[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengabarkan bahwa Dia mengusir dari rahmatNya orang-orang kafir dari kalangan bani israil di dalam kitab suci yang Dia turunkan kepada Dawud , yaitu zabur, dan dalam kitab suci yang diturunkan pada Isa , yaitu injil, dikarenakan kedurhakaan mereka dan tindakan melampaui batas yang mereka perbuat terhadap larangan-larangan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Allah -Subḥānahu- menceritakan bahwa Dia telah menjauhkan orang- orang kafir dari kalangan Bani Israil dari rahmat-Nya di dalam kitab suci yang diturunkan-Nya kepada Daud yaitu Zabur, dan di dalam kitab suci yang diturunkan-Nya kepada Isa putra Maryam yaitu Injil. Tindakan-Nya yang menjauhkan mereka dari rahmat-Nya tersebut disebabkan oleh perbuatan maksiat mereka yang begitu banyak dan melanggar larangan-larangan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78- 79. Allah melaknat orang-orang kafir dari Bani Israil melalui lisan Nabi Daud dan Nabi Isa bin Maryam. Hal ini karena mereka kafir, terus menerus di dalam kemaksiatan, melanggar hal-hal yang diharamkan, dan tidak melarang kemungkaran. Sehingga kemungkaran itu menjadi hal yang biasa dan baik, sedangkan kebaikan menjadi sesuatu yang mungkar dan asing. Sungguh buruk sifat dan perbuatan mereka. Seandainya dalam hati mereka terdapat pengagungan dan rasa cinta kepada Allah dan kecemburuan jika larangan-larangan Allah dilanggar, niscaya mereka tidak akan meninggalkan kewajiban untuk melarang kemungkaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. لُعِنَ الَّذِينَ كَفَرُوا۟ مِنۢ بَنِىٓ إِسْرٰٓءِيلَ عَلَىٰ لِسَانِ دَاوُۥدَ وَعِيسَى ابْنِ مَرْيَمَ ۚ (Telah dilaknati orang-orang kafir dari Bani Israil dengan lisan Daud dan Isa putera Maryam) Yakni laknat yang tercantum dalam kitab Zabur dan Injil disebabkan kemaksiatan yang mereka lakukan, seperti pelanggaran mereka di hari sabtu, dan kekafiran mereka terhadap Nabi Isa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "78-79 1 ) Alqur'an menceritakan kepada kita bahwa kaum-kaum terdahulu adalah kaum yang berhadapan dengan laknat dengan tangan-tangan para Nabi, dan dosa mereka yang paling besar (sebab datangnya laknat ini) adalah karena mereka tidak saling menegur dan melarang dari perbuatan buruk! 2 ). Jika pembela kebenaran diam dan berlepas diri dari tanggung jawab mereka untuk menyampaikan kebanaran itu, maka sungguh orang-orang salah akan terus konsisten dengan kesalahan mereka, dan orang-orang akan ikut dengan kesalahan itu, dan orang-orang yang diam itu akan kembali kepada tuhannya dengan membawa dosa atas sikap mereka menyembunyikan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Ditolak dari rahmat Allah orang-orang Bani Israil yang mengingkari Zabur yang disampaikan melalui lisan Dawud, dan Injil melalui lisan Isa akibat kemaksiatan dan kebencian mereka itu, sebagaimana kekufuran mereka terhadap Isa, pertentangan mereka terhadap hari sabat, pembunuhan mereka terhadap para nabi, dan perbuatan lain yang disebutkan selanjutnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dilaknat} dijauhkan dari rahmat Allah {orang-orang kafir dari Bani Israil melalui lisan Daud dan Isa putra Maryam. Hal itu karena mereka durhaka dan selalu melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Kemudian Allah berfirman, “Telah dilaknati orang-orang kafir dari Bani Israil,” maksudnya, mereka diusir dan dijauhkan dari rahmat Allah, “melalui lisan Dawud dan Isa putra Maryam,” yaitu dengan kesaksian dan pengakuan mereka berdua bahwa hujjah telah tegak atas mereka dan mereka mengingkarinya. “Yang demikian itu,” yakni kekufuran dan laknat “disebabkan mereka durhaka dan selalu melampaui batas.” Maksudnya, karena kemaksiatan dan kezaliman mereka terhadap hamba-hamba Allah, menjadi penyebab kekufuran dan kejauhan mereka dari rahmat Allah, karena dosa dan kezhaliman memiliki akibat buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 78: Yaitu dengan doa Nabi Dawud 'alaihis salam, mereka dirubah rupanya menjadi kera. Mereka ini adalah penduduk Ailah. Dengan doa Nabi Isa 'alaihis salam, mereka dirubah rupanya menjadi babi. Mereka ini adalah orang-orang yang meminta diturunkan hidangan langsung dari langit. Kepada Allah. Dengan menzalimi hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 78",
    "description": "Bila pada ayat-ayat yang lalu diterangkan tentang penyimpangan umat nasrani, pada ayat-ayat berikut dijelaskan tentang kutukan Allah pada orang yahudi yang kafir. Allah menerangkan bahwa orang-orang kafir dari bani israil, yaitu mereka yang selalu ingkar dan mengabaikan perjanjiannya dengan Allah, telah dilaknat melalui atau dengan perantaraan lisan nabi dawud dan isa putra maryam. Kutukan Allah yang demikian itu, disebabkan karena mereka durhaka dengan tidak menepati janji yang telah diikrarkan dan selalu melampaui batas dalam melaksanakan ajaran dan tuntunan agama, sehingga cenderung mengarah pada kesesatan. Kebanyakan dari umat yahudi itu bersikap melampaui batas, sehingga mereka tidak berbeda satu sama lain, dan mereka juga tidak saling mencegah dari perbuatan mungkar atau penyimpangan yang selalu mereka perbuat. Sesungguhnya keadaan seperti ini mengisyaratkan betapa sangat buruk apa yang selalu mereka perbuat selama itu."
  }
]