[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yahudi itu memperlihatkan tindakan-tindakan maksiat dan menyetujuinya. Sebagian dari mereka tidak melarang sebagian yang lain dari perbuatan kemungkaran apa pun yang mereka perbuat. Ini termasuk tindakan-tindakan buruk mereka. Dan dengan itu, mereka pantas diusir dari rahmat Allah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Mereka tidak melarang kawan mereka berbuat maksiat. Bahkan para pendosa di antara mereka melakukan perbuatan maksiat dan kemungkaran secara terang-terangan, karena tidak ada yang melarangnya. Sungguh buruk sekali sikap mereka yang tidak mau melarang kemungkaran tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. كَانُوا۟ لَا يَتَنَاهَوْنَ عَن مُّنكَرٍ فَعَلُوهُ ۚ (Mereka satu sama lain selalu tidak melarang tindakan munkar yang mereka perbuat) Mereka tidak melarang orang yang bermaksiat dalam menjalankan atau merencanakan kemaksiatannya. Menyeru kepada kebaikan dan melarang kemungkaran merupakan salah satu asas terpenting dan kewajiban terbesar dalam agama Islam. لَبِئْسَ مَا كَانُوا۟ يَفْعَلُونَ(Sesungguhnya amat buruklah apa yang selalu mereka perbuat itu) Yakni perbuatan mereka tidak melarang apa yang wajib mereka larang. Ibnu Mas’ud berkata: Rasulullah bersabda: “sesungguhnya kekurangan/kesalahan pertama yang masuk ke dalam bani Israil adalah ketika seseorang dari mereka bertemu dengan orang lain, kemudian ia berkata kepadanya: Hai kamu, takutlah kamu kepada Allah! Dan tinggalkan yang kau perbuat itu karena itu haram bagimu. Kemudian ia bertemu kembali dengannya dihari berikutnya, namun perbuatan buruk temannya itu tidak mencegahnya untuk menjadikannya teman makan, minum, dan duduk-duduk. Ketika itu mereka lakukan, Allah menjadikan hati mereka saling berselisih dan melaknat mereka”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "78-79 1 ) Alqur'an menceritakan kepada kita bahwa kaum-kaum terdahulu adalah kaum yang berhadapan dengan laknat dengan tangan-tangan para Nabi, dan dosa mereka yang paling besar (sebab datangnya laknat ini) adalah karena mereka tidak saling menegur dan melarang dari perbuatan buruk! 2 ). Jika pembela kebenaran diam dan berlepas diri dari tanggung jawab mereka untuk menyampaikan kebanaran itu, maka sungguh orang-orang salah akan terus konsisten dengan kesalahan mereka, dan orang-orang akan ikut dengan kesalahan itu, dan orang-orang yang diam itu akan kembali kepada tuhannya dengan membawa dosa atas sikap mereka menyembunyikan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Mereka tidak saling mencegah perbuatan maksiat, atau merasa tenang dengan perbuatan itu, bahkan meridhainya. Sungguh amat buruk perbuatan dan pengabaian mereka berupa kemaksiatan dan kemungkaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak saling mencegah} tidak mencegah satu sama lain {perbuatan mungkar yang mereka lakukan. Sungguh itulah seburuk-buruk apa yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Di antara kedurhakaan mereka yang menjadi penyebab turunnya azab dan terjadinya hukuman adalah bahwa “mereka satu sama lain selalu tidak melarang tindakan mungkar yang mereka perbuat.” Artinya, mereka melakukan kemungkaran tetapi sebagian dari mereka tidak melarang sebagian yang lain, maka pelaku dan yang lainnya yang mendiamkan kemungkaran walaupun dia mampu mengingkarinya adalah sama. Itu menunjukkan bahwa mereka meremehkan perintah Allah dan maksiat kepadaNya bagi mereka adalah sepele. Jika mereka memiliki penghormatan kepada Rabb mereka, niscaya mereka akan memiliki ghirah terhadap apa-apa yang diharamkanNya dan tentunya akan marah karena marahNya. Dan sesungguhnya mendiamkan kemungkaran padahal dia mampu untuk mengingkarinya dapat menimbulkan azab, karena ia mengandung dampak negative yang besar: Di antaranya adalah, sekedar mendiamkan suatu maksiat saja, walaupun orang yang diam itu tidak melakukannya secara langsung, sebagaimana kemaksiatan harus dijauhi, pengingkaran terhadap kemaksiatan juga harus dilakukan. Di antaranya adalah apa yang telah di jelaskan yaitu bahwa itu menunjukan rasa remeh terhadap kemaksiatan dan kekurangannya kemaksiatan juga harus di lakukan. Di antaranya adalah bahwa itu membuat para berandal, pelaku maksiat semakin berani memperbanyak kemaksiatan jika mereka jera darinya, maka keburukan meningkat, musibah dan dunia menjadi besar. Para pelaku kamksiatan itu merajalela dan berkuasa, lalu setelah itu para pelaku kebaikan melemah dalam melawan para pengikut kemaksiatan, akhirnya apa yang dahulu mereka mampu lakukan, sekarang tidak lagi mereka lakukan. Di antaranya adalah meninggalkan nahyi munkar bisa menjadi penyebab terkikisnya ilmu dan merajalela kebodohan. Jika kemaksiatan di ulang-ulang dan di lakukan oleh banyak orang lau para ulama tidak ada yang mengingkarinya, maka akan di kira ia bukanlah kemaksiatan bahkan bisa jadi orang bodoh mengiranya ibadah yang baik. Kerusakan mana lagi yang lebih besar daripada meyakini apa yang di haramkan oleh Allah sebagai sesuatu yang halal, kebenaran menjadi jungkir balik dan yang haq terlihat seperti kebatilan? Di antaranya adalah bahwa mendiamkan kemaksiatan bisa menghiasi kemaksiatan itu di hati manusia, lalu sebagian orang mengikuti sebagian yang lain. Manusia cenderung mengikuti orang-orang yang sepertinya dari kaumnya. Dan banyak lagi yang lainnya. Mendiamkan kemungkaran akan berakibat seperti ini, maka Allah menyatakan bahwa Bani Israil yang kafir dari mereka dilaknat olehNya karena kemaksiatan dan pelanggarannya yang di khususkan dari itu kemungkaran besar ini. “ Sesungguhnya amat buruklah apa yang selalu mereka perbuatan itu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 79: Sehingga mereka sama seperti pelaku kemungkaran itu karena mendiamkan kemungkaran padahal mampu mencegahnya. Hal ini menunjukkan sikap remeh mereka terhadap perintah Allah dan anggapan ringan bermaksiat kepada Allah oleh mereka. Sekiranya mereka memiliki rasa ta'zhim (pengagungan) kepada Allah, tentu mereka akan cemburu karena larangan-Nya dikerjakan, dan mereka akan marah karena-Nya. Mendiamkan kemungkaran dapat berakibat banyak mafsadat, di antaranya: - Mendiamkan kemungkaran itu sendiri merupakan kemaksiatan, meskipun dia tidak mengerjakannya. - Menunjukkan bahwa dirinya meremehkan maksiat. - Membuat pelaku maksiat dan kefasikan berani melakukan banyak maksiat, sehingga kejahatan bertambah, dan lama kelamaan banyak yang mengikutinya sehingga pelakunya menjadi mayoritas, sedangkan orang-orang yang baik menjadi minoritas serta tidak mampu mencegah kemungkaran itu. - Meninggalkan kemungkaran dapat membuat ilmu agama menjadi hilang dan kebodohan melanda. Hal itu, karena maksiat jika berulang kali dilakukan dan tidak diingkari akan mengakibatkan persangkaan bahwa yang demikian bukan maksiat, bahkan orang yang tidak tahu bisa mengiranya sebagai perkara baik, padahal kerusakan apa yang lebih besar daripada anggapan halal terhadap apa yang diharamkan Allah? - Mendiamkan kemungkaran, bisa menjadikan orang lain memandang baik perbuatan itu sehingga diikuti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 79",
    "description": "Kebanyakan dari umat yahudi itu bersikap melampaui batas, sehingga mereka tidak berbeda satu sama lain, dan mereka juga tidak saling mencegah dari perbuatan mungkar atau penyimpangan yang selalu mereka perbuat. Sesungguhnya keadaan seperti ini mengisyaratkan betapa sangat buruk apa yang selalu mereka perbuat selama itu. Kamu telah melihat dari peristiwa-peristiwa yang lalu bahwa banyak di antara mereka tolong-menolong dengan orang-orang yang kafir musyrik untuk memerangimu, seperti yang terjadi dalam perang ahzab. Karena itu, sesungguhnya dengan perilaku semacam itu betul-betul sangat buruk apa yang mereka lakukan untuk diri mereka, sebab tindakan demikian hanya akan menuai balasan yang berat, yaitu kemurkaan Allah kepada mereka, dan di akhirat nanti, mereka akan kekal dalam siksaan atau azab api neraka."
  }
]