[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai oramg-orang yang beriman kepada Allah dan RasulNYa,Muhammad jadilah kalian orang-orang yang selalu menegakkan kebenaran, dengan mengharapkan wajah Allah, lagi menjadi saksi-saksi yang adil. Dan janganlah kebencian terhadap suatu kaum menyeret kalian untuk tidak berlaku adil. Berlakulah adil di hadapan musuh-musuh dan orang-orang yang tercinta seacara seimbang, karena berlaku adil itu lebih dekat kepada takut kepada Allah, dan hindarilah untuk berlaku curang. Sesungguhnya Allah Maha mengetahui apa yang kalian perbuat dan akan membalas kalian atas semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya! Tunaikanlah hak-hak Allah atas diri kalian seraya mengharap rida-Nya. Dan hendaklah kalian menjadi saksi yang adil bukan saksi palsu. Dan jangan sekali-kali kebencian kalian terhadap orang-orang tertentu mendorong kalian untuk berlaku tidak adil kepada mereka. Karena keadilan itu diperlukan dalam menghadapi kawan maupun lawan. Maka berlaku adillah kepada kawan maupun lawan. Keadilan itu lebih dekat kepada ketakutan kepada Allah. Sedangkan sikap tidak adil lebih dekat kepada kelancangan kepada Allah. Dan takutlah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Sesungguhnya Allah Maha Mengetahui apa yang kalian perbuat. Tidak ada satu pun amal perbuatan kalian yang luput dari pengetahuan-Nya. Dan Dia akan membalas kalian dengan balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Kemudian Allah menyeru hamba-hamba-Nya yang beriman supaya mereka bersungguh-sungguh dalam menegakkan kebenaran untuk Allah dengan penuh keikhlasan dan mengharapkan keridhaan-Nya, bukan untuk kepentingan diri sendiri maupun orang lain. Dan Allah memerintahkan mereka untuk bersikap adil saat menyampaikan kesaksian dengan tidak berbuat zalim. Dan menyeru mereka agar kebencian terhadap suatu kaum tidak membawa mereka untuk meninggalkan sifat adil; karena bersikap adil dalam keadaan suka maupun benci merupakan asas kebenaran dan jalan menuju ketakwaan. Kemudian Allah menegaskan perintah-Nya untuk bertakwa dalam segala urusan dengan menyatakan bahwa Dia Maha Mengetahui dan Meliputi segala urusan yang tersembunyi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوّٰمِينَ لِلَّـهِ (Hai orang-orang yang beriman hendaklah kamu jadi orang-orang yang selalu menegakkan (kebenaran) karena Allah) Tafsir dari potongan ayat ini telah disebutkan dalam surat an-Nisa:135. قَوّٰمِينَ (selalu menegakkan (kebenaran)) Kata ini menunjukkan bahwa mereka diperintahkan untuk menegakkan kebenaran dengan sebenar-benarnya. لِلَّـهِ(karena Allah) Dengan mengharap pahala dari-Nya dan takut dari siksaannya. Dan makna (القسط) yakni keadilan. وَلَا يَجْرِمَنَّكُمْ شَنَـَٔانُ قَوْمٍ (Dan janganlah sekali-kali kebencianmu terhadap sesuatu kaum) Yakni janganlah kebencian terhadap suatu kaum membawa kalian untuk tidak berbuat adil kepada mereka dan menyembunyikan persaksian yang menguntungkan mereka. هُوَ ((karena itu) Yakni keadilan itu. أَقْرَبُ لِلتَّقْوَىٰ ۖ (lebih dekat kepada takwa) Yakni ketaatan yang diperintahkan kepada kalian berkali-kali. Yakni lebih dekat untuk kalian taat kepada Allah, atau menjauhi neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah melarang setiap mu'min membawa kemarahan mereka terhadap orang-orang kafir menjadikannya tidak berbuat adil kepada mereka, lalu bagaimana dengan seorang yang sebatas berbuat fasiq dan perkara bid'ah ? maka dengan perkara ini ia mesti lebih mengutamakan keadilannya sekalipun dia berbuat aniaya kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8 Hai orang-orang yang beriman hendaklah kamu jadi orang-orang yang selalu menegakkan kebenaran sebagaimana yang kalian janjikan kepada Allah. Seraya mengagungkan dan ikhlas hanya karena Allah. Dan jadilah saksi dengan penuh kadilan tanpa bermaksud menguntungkan seseorang. Dan janganlah sekali-kali kebencianmu terhadap sesuatu kaum, mendorong kamu untuk berlaku tidak adil dan menyembunyikan persaksian yang bermanfaat untuk mereka. Berlaku adillah kepada siapapun, karena adil itu lebih dekat kepada takwa Allah, atau karena takut kepada neraka. Dan bertakwalah kepada Allah dengan menjalankan syariat-Nya, sesungguhnya Allah Maha Mengetahui segala apa yang kamu kerjakan dan Maha memberi balasan atas itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jadilah penegak karena Allah} penegak kebenaran-kebenaran Allah atas kalian karena untuk mencari keridhaanNya {saksi-saksi dengan adil} saksi-saksi dengan adil {Jangan sampai mendorong kalian} membawa kalian {kebencian} kemurkaan {terhadap suatu kaum untuk berlaku tidak adil. Berlakulah adil karena itu lebih dekat pada takwa. Bertakwalah kepada Allah. Sesungguhnya Allah Maha Mengetahui terhadap apa yang kamu kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Hai orang-orang yang beriman,” yaitu kepada apa yang mereka diperintahkan untuk beriman kepadanya. Tegakkan konsekuensi imanmu dengan “menjadi orang-orang yang selalu menegakkan kebenaran karena Allah, menjadi saksi dengan adil.” Hendaknya gerak-gerikmu, lahir dan batin, terus bersemangat dalam penegakkan keadilan dan hendaknya pelaksanaannya itu hanya karena Allah semata, bukan karena tujuan dunia. Dan hendaknya sasaranmu tegak dan seimbang (qisth) yaitu adil, tanpa berlebih-lebihan dan tanpa meremehkan; dalam ucapan dan perbuatanmu. Tegakkan itu kepada kerabat, orang jauh, kawan maupun musuh. “Dan janganlah sekali-kali kamu terdorong oleh kebencian kepada suatu kaum untuk berlaku tidak adil,” seperti yang dilakukan oleh orang yang tidak memiliki rasa kedailan. Akan tetapi sebagaimana kamu bersaksi untuk membela temanmu maka kamu pun harus mau bersaksi untuk melawannya, sebagaimana kamu bersaksi melawan musuhmu, maka kamu pun harus bersaksi membelanya walaupun dia adalah orang kafir atau pelaku bid’ah. Dalam hal ini wajib berlaku adil dan menerima kebenaran yang dibawanya (karena ia adalah kebenaran), bukan karena dia yang mengucapkannya, dan kebenaran tidak ditolak hanya karena dia yang mengucapkannya, karena itu kezhaliman terhadap kebenaran. “Berlaku adillah, karena berlaku adil itu lebih dengan takwa,” yakni semakin kamu berusaha untuk bersikap adil dan bersungguh-sungguh dalam melaksanakannya, maka hal itu lebih dekat kepada ketakwaan hatimu. Jika keadilannya sempurna, maka takwanya juga sempurna. “SEsungguhnya Allah mengetahui apa yang kamu kerjakan,” maka Dia akan membalasmu sesuai dengan amal perbuatanmu, yang baik, yang buruk, yang kecil, dan yang besar; dengan balasan di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 8: Bukan karena kepentingan pribadi atau duniawi. Sebagaimana yang dilakukan oleh orang-orang yang tidak memiliki keadilan, bahkan jika kamu bersaksi untuk kepentingan orang dekatmu, maka kamu pun harus bersaksi terhadapnya meskipun merugikannya. Demikian juga sebagaimana kamu bersaksi yang merugikan musuhmu, maka kamu pun harus bersaksi meskipun menguntungkannya walaupun ia orang kafir atau ahli bid'ah, yakni harus adil dan menerima yang hak jika terkadang muncul darinya, dan tidak boleh menolak kebenaran karena diucapkan olehnya, bahkan yang demikian adalah kezaliman. Baik terhadap kawan maupun lawan. Yakni setiap kali kamu berusaha untuk adil dan mengamalkannya, maka yang demikian mendekatkan kamu kepada ketakwaan, dan semakin sempurna keadilan, maka semakin sempurna pula ketakwaanmu. Oleh karena itu, Dia akan memberikan balasan terhadap perbuatanmu; baik atau buruk, besar atau kecil, demikian pula dibalas segera atau lambat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 8",
    "description": "Ayat selanjutnya memberikan tuntunan agar umat islam berlaku adil, tidak hanya kepada sesama umat islam, tetapi juga kepada siapa saja walaupun kepada orang-orang yang tidak disukai. Wahai orangorang yang beriman! jadilah kamu sebagai penegak keadilan, yakni orang yang selalu dan bersungguh-sungguh menegakkan kebenaran, karena Allah, ketika kalian menjadi saksi maka bersaksilah dengan adil. Dan janganlah kebencianmu terhadap suatu kaum, yakni kepada orang-orang kafir dan kepada siapa pun, mendorong kamu untuk berlaku tidak adil terhadap mereka. Berlaku adillah kepada siapa pun, karena adil itu lebih dekat kepada takwa. Dan bertakwalah kepada Allah dengan mengerjakan perintah-Nya dan meninggalkan larangan-Nya, sungguh, Allah mahateliti, maha mengetahui apa yang kamu kerjakan, baik yang kamu lahirkan maupun yang kamu sembunyikan pada ayat ini Allah menjanjikan pahala bagi orang-orang yang beriman dan beramal saleh. Allah telah menjanjikan kepada orang-orang yang beriman dengan ucapan yang sesuai dengan isi hati mereka dan membuktikannya dengan beramal saleh bahwa mereka akan mendapat ampunan atas dosa-dosa mereka dan pahala yang besar berupa surga."
  }
]