[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu bisa lihat (wahai rasul), banyak dari orang-orang yahudi yang menjadikan kaum musyrikin sebagai orang-orang yang mereka berikan loyalitas (sebagai teman dan penolong mereka). Amat buruk apa yang mereka lakukan berupa mempersembahkan loyalitas yang menjadi penyebab kemurkaan Allah pada mereka dan kekekalan mereka di dalam siksaan Allah pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Kamu -wahai Rasul- sering sekali menyaksikan kaum kufur dari kalangan Yahudi menyukai serta condong terhadap orang-orang kafir dan melancarkan serangan terhadap dirimu dan orang-orang yang menganut agama tauhid. Sungguh buruk tindakan mereka yang bersekongkol dengan orang-orang kafir itu. Karena tindakan itu adalah penyebab datangnya murka Allah kepada mereka dan penyebab masuknya mereka ke dalam Neraka untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Banyak dari mereka yang saling tolong-menolong dengan orang-orang kafir dari golongan penyembah berhala dan lainnya. Bagaimana hawa nafsu mereka dapat membujuk mereka untuk melakukan sesuatu yang mungkar ini, sehingga mereka menyetujui untuk saling tolong menolong dengan orang yang telah mereka yakini berada dalam kekafiran? Betapa Buruk apa yang telah mereka lakukan sehingga mereka layak mendapatkan kemurkaan Allah dan azab yang kekal. Hawa nafsu mereka telah menggoda mereka untuk melakukan keburukan-keburukan tersebut dan meremehkan kesalahan-kesalahan, sehingga mereka berhak mendapat azab neraka jahanam selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. تَرَىٰ كَثِيرًا مِّنْهُمْ (Kamu melihat kebanyakan dari mereka) Yakni dari orang-orang Yahudi. يَتَوَلَّوْنَ الَّذِينَ كَفَرُوا۟ ۚ( tolong-menolong dengan orang-orang yang kafir) Yakni orang-orang musyrik yang berada dalam agama yang tidak benar. لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنفُسُهُمْ(Sesungguhnya amat buruklah apa yang mereka sediakan untuk diri mereka) Yakni yang mereka persiapkan bagi diri mereka untuk mereka bawa di hari kiamat. أَن سَخِطَ اللهُ عَلَيْهِمْ(yaitu kemurkaan Allah kepada mereka) Yakni mereka menyiapkan bagi diri mereka di akhirat kemurkaan Allah, maka ketika mereka telah datang di hari kiamat mereka ditempatkan dalam kemurkaan Tuhan yang telah mereka persiapkan sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Kamu akan melihat kebanyakan orang Yahudi yang berteman dan bersahabat dengan orang-orang musyrik. Mereka saling bersekutu untuk memerangi nabi SAW dan orang-orang muslim. Sungguh amat buruk azab yang akan menimpa mereka di akhirat. Allah murka kepada mereka. Dan mereka akan abadi dalam neraka Jahannam selama-lamanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu melihat banyak di antara mereka bersekutu dengan orang-orang kafir. Sungguh itulah seburuk-buruk apa yang mereka lakukan untuk diri mereka sendiri. Allah murka} murka {kepada mereka. Mereka akan kekal dalam azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “ Kamu melihat kebanyakan dari mereka tolong-menolong dengan orang-orang kafir,” dengan kecintaan, loyalitas dan dukungan. “ Sesungguhnya amat buruklah apa yang mereka sediakan untuk diri mereka.” Yaitu, barang yang tidak laku dan dagangan yang merugi ini yaitu kemurkaan Allah, yang karena murkaNya segala sesuatu ikut murka dan selama-lamanya berada di dalam azab yang besar. Mereka telah di zhalimi oleh diri mereka sendiri di mana ia memberikan segala bagian yang tidak mulia ini, dan mereka juga menzhalimi diri mereka karena telah melenyapkan dirinya nikamt yang kekal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 80: Yakni orang-orang Yahudi. Yakni kaum musyrik Mekah karena benci kepada Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 80",
    "description": "Kamu telah melihat dari peristiwa-peristiwa yang lalu bahwa banyak di antara mereka tolong-menolong dengan orang-orang yang kafir musyrik untuk memerangimu, seperti yang terjadi dalam perang ahzab. Karena itu, sesungguhnya dengan perilaku semacam itu betul-betul sangat buruk apa yang mereka lakukan untuk diri mereka, sebab tindakan demikian hanya akan menuai balasan yang berat, yaitu kemurkaan Allah kepada mereka, dan di akhirat nanti, mereka akan kekal dalam siksaan atau azab api neraka. Dan sekiranya mereka, yaitu orang-orang yahudi yang bekerja sama dengan orang kafir, itu beriman kepada Allah, kepada nabi Muhammad, dan kepada apa yang diturunkan kepadanya, yaitu Al-Qur'an, niscaya mereka tidak akan menjadikan orang-orang musyrik itu sebagai penolongpenolong atau teman setia yang membantu mereka untuk memerangi nabi dan umat islam. Akan tetapi, kenyataannya banyak di antara mereka adalah orang-orang yang fasik, yang sering melakukan penyimpangan dari ajaran agamanya."
  }
]