[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya orang-orang yahudi yang saling menolong dengan kaum musyrikin itu mau beriman kepada Allah dan kepada nabi Muhammad dan mengakui kebenaran wahyu yang diturunkanNYa kepadanya, yaitu al-qu’an al-karim, pasti mereka tidak akan menjadikan orang-orang kafir sebagai teman dan penolong. Akan tetapi,kebanyakan dari mereka keluar dari ketaatan kepada Allah dan rasulNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Sekiranya orang-orang Yahudi itu benar-benar beriman kepada Allah dan nabi-Nya, niscaya mereka tidak akan menjadikan orang-orang musyrik sebagai sekutu mereka, di luar orang-orang mukmin. Karena sebenarnya mereka dilarang menjadikan orang-orang kafir sebagai sekutu. Namun banyak sekali orang-orang Yahudi yang keluar dari ketaatan kepada Allah dan keluar dari persekutuan dengan Allah serta orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Seandainya mereka benar-benar beriman kepada Allah dan kepada nabi yang diutus kepada mereka serta kepada apa yang diturunkan kepadanya, niscaya mereka tidak akan menjadikan orang-orang kafir itu sebagai penolong; karena tolong-menolong dengan orang kafir bukan merupakan sifat orang beriman, namun itu adalah kebalikan dan penghilang keimanan. Itu merupakan perbuatan orang-orang fasik yang terang-terangan melakukan kemaksiatan dan melanggar ketaatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَلَوْ كَانُوا۟ يُؤْمِنُونَ بِاللهِ وَالنَّبِىِّ وَمَآ أُنزِلَ إِلَيْهِ (Sekiranya mereka beriman kepada Allah, kepada Nabi (Musa) dan kepada apa yang diturunkan kepadanya) Yakni apa yang diturunkan kepadanya berupa kitab. مَا اتَّخَذُوهُمْ (niscaya mereka tidak akan menjadikan mereka) Yakni menjadikan orang-orang musyrik. أَوْلِيَآءَ (menjadi penolong-penolong) Karena Allah dan rasul-Nya telah melarang mereka berbuat demikian. وَلٰكِنَّ كَثِيرًا مِّنْهُمْ فٰسِقُونَ (tapi kebanyakan dari mereka adalah orang-orang yang fasik) Yakni mereka keluar dari wilayah pertolongan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Sekiranya orang-orang Yahudi itu beriman dengan haq kepada Allah, nabi Musa, dan ayat yang diturunkan dalam Taurat, maka mereka tidak akan mengambil orang-orang musyrik sebagai teman dan penolong bagi mereka selain orang-orang mukmin. Namun kebanyakan mereka tidak mau menaati Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka beriman kepada Allah, nabi Muhammad, dan apa yang diturunkan kepadanya, maka mereka tidak akan menjadikan orang musyrik itu sebagai sekutu. Akan tetapi banyak di antara mereka adalah orang-orang fasik} tidak menaati Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “ Sekiranya mereka beriman kepada Allah, kepada Nabi (Musa), dan kepada apa yang di turunkan kepadanya (Nabi), niscaya mereka tidak akan menjadikan orang musyrik itu sebagai penolong-penolong,” karena iman kepada Allah, kepada nabi, dan kepada apa yang di turunkan kepadanya menurut seorang hamba agar memberikan walanya (loyalitas) kepada Allah dan kepada para wali-waliNya dan memusuhi orang-orang kafir kapadaNya, memusuhiNya dan menenggelamkan diri di dalam kemaksiatan kepadaNya. Syarat perwalian Allah dan iman kepadaNya adalah hendaknya tidak mengangkat musuh-musuh Allah sebagai pemimpin. Syarat initidak ada pada mereka, maka akibat dari syarat itu pun tidak ada. “ Tapi kebanyakan dari mereka adalah orang-orang yang fasik,” artinya, menyimpang dari ketaatan kepada Allah, iman kepadaNya dan iman kepada Nabi. Dan di antara kefasikan mereka adalah mengangkat musuh-musuh Allah sebagai pemimpin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 81: Yakni keluar dari ketaatan kepada Allah, keluar dari keimanan kepada-Nya dan kepada nabi-Nya. Termasuk perbuatan fasik mereka adalah berwalaa' (bersikap setia) kepada musuh-musuh Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 81",
    "description": "Dan sekiranya mereka, yaitu orang-orang yahudi yang bekerja sama dengan orang kafir, itu beriman kepada Allah, kepada nabi Muhammad, dan kepada apa yang diturunkan kepadanya, yaitu Al-Qur'an, niscaya mereka tidak akan menjadikan orang-orang musyrik itu sebagai penolongpenolong atau teman setia yang membantu mereka untuk memerangi nabi dan umat islam. Akan tetapi, kenyataannya banyak di antara mereka adalah orang-orang yang fasik, yang sering melakukan penyimpangan dari ajaran agamanya pada ayat-ayat yang lalu diterangkan tentang kutukan Allah terhadap orang yahudi, selanjutnya pada ayat ini dijelaskan bagaimana sikap para ahli kitab terhadap orang mukmin. Allah memberikan informasi kepada nabi Muhammad, pasti akan kamu dapati orang yang paling keras permusuhannya terhadap orang-orang yang beriman (umat islam), ialah orang-orang yahudi dan orang-orang musyrik, yang memang merasa tidak senang dan selalu memusuhi rasulullah dan umat islam. Dan di samping itu, pasti akan kamu dapati juga orang yang paling dekat persahabatannya dengan orang-orang yang beriman ialah orang-orang yang berkata, sesungguhnya kami adalah orang nasrani, yaitu yang tekun melaksanakan ajaran agamanya. Yang sedemikian itu karena di antara mereka, orang-orang nasrani, terdapat para pendeta dan rahib yang saleh dan selalu melaksanakan tuntunan agamanya dengan benar, selain itu juga karena sesungguhnya mereka tidak menyombongkan diri dengan segala kesalehan dan ketekunan dalam beribadah."
  }
]