[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu benar-benar akan mendapati (wahai rasul), orang yang paling keras permusuhannya kepada orang-orang yang membenarkanmu dan beriman kepadamu serta mengikutimu adalah kaum yahudi, karena besarnya penentangan mereka, pengingkaran mereka dan penolakan mereka terhadap kebenaran, dan orang-orang yang menyekutukan Allah dengan selainNYa, seperti para penyembah berhala dan lain-lain. Dan kamu benar-benar akan mendapati orang yang paling dekat persahabatnnya dengan kaum muslimin adalah orang-orang yang mengatakan, ”sesungguhnya kami adalah kaum nasrani” Demikian ini lantaran diantara mereka ada tokoh-tokoh agama yang zuhud, dan ahli-ahli ibadah di dalam biara-biara yang larut dalam ibadah. Dan mereka adalah orang-orang yang tawdhu, tidak sombong untuk mau menerima kebenaran. Dan mereka itu adalah orang-orang yang menerima kerasulan Muhammad dan mengimaninya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Sungguh kamu -wahai Rasul-, benar-benar akan mendapati bahwa orang yang paling keras permusuhannya terhadap orang-orang yang beriman kepadamu adalah orang-orang Yahudi; karena rasa dengki, iri hati, dan kesombongan yang ada di dalam hati mereka, para penyembah berhala, dan orang-orang musyrik lainnya. Dan kamu benar-benar akan mendapati bahwa orang yang paling dekat dengan orang-orang yang beriman kepadamu dan kepada kitab suci yang kamu bawa ialah orang-orang yang berkata tentang diri mereka sendiri, bahwa mereka adalah orang-orang Nasrani. Dan ayat ini menjelaskan bahwa mereka itu lebih bersahabat dengan orang-orang mukmin karena di antara mereka terdapat para ulama yang tekun beribadah, rendah hati, dan tidak sombong. Karena hati orang-orang yang sombong tidak bisa dimasuki kebaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Hai Muhammad, sungguh dengan berjalannya waktu akan tersingkap bagimu fakta-fakta tentang besarnya kebencian dan permusuhan orang-orang Yahudi kepadamu dan kepada dakwahmu. Allah mendahulukan penyebutan orang-orang Yahudi karena permusuhan mereka lebih besar daripada kaum lainnya, Hal ini karena permusuhan mereka telah terjadi secara turun-menurun. Mereka menghalangi jalan dakwah karena kekerasan hati, kesombongan, dan kedengkian yang ada dalam diri mereka. Mereka kafir karena suka membangkang, ingkar, dan meremehkan orang-orang yang berilmu. Adapun orang-orang musyrik adalah para penyembah berhala yang telah tenggelam di dalam kemaksiatan dan syahwat serta terbiasa dengan kekafiran dan kesesatan dalam waktu yang lama. Hai Muhammad, dan kamu akan mendapati orang-orang yang paling dekat persahabatannya dengan kaum muslimin adalah orang-orang yang berkata: \"Kami adalah orang-orang Nasrani\". Sebab kedekatan mereka adalah karena di antara mereka terdapat orang-orang yang mendalami ilmu agama mereka, yang menjalankan agama dengan kebaikan, kasih sayang, dan keadilan, dan mereka memfokuskan diri didalam kuil-kuil untuk berdoa dan beribadah. Mereka tidak enggan mengatakan kebenaran, dan mereka adalah orang-orang yang menerima dakwah Rasulullah dan masuk ke dalam agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدٰوَةً لِّلَّذِينَ ءَامَنُوا۟ الْيَهُودَ وَالَّذِينَ أَشْرَكُوا۟ ۖ (Sesungguhnya kamu dapati orang-orang yang paling keras permusuhannya terhadap orang-orang yang beriman ialah orang-orang Yahudi dan orang-orang musyrik) Kalimat ini ditujukan bagi setiap orang yang sesuai dengan kalimat ini. Makna kalimat ini bahwa orang-orang musyrik dan Yahudi adalah orang-orang yang paling memusuhi orang-orang beriman, sedangkan orang-orang Nasrani adalah orang-orang yang paling dekat rasa cintanya kepada orang-orang beriman. ذٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا(Yang demikian itu disebabkan karena di antara mereka itu (orang-orang Nasrani) terdapat pendeta-pendeta dan rahib-rahib) Yakni karena diantara orang-orang Nasrani terdapat terdapat pendeta-pendeta dan rahib-rahib yang mengajari mereka kerendahan hati, kasih sayang, menolong orang lain, dan pencarian kebenaran. Yang dimaksud dengan pendeta adalah orang yang senantiasa mengikuti para ulama dan ahli ibadah diantara mereka. Sedangkan rahib adalah orang yang beribadah di kuil-kuil. وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ((juga) karena sesungguhnya mereka tidak menymbongkan diri) Yakni tidak menyombongkan diri dari kalimat hak, namun mereka merendahkan diri terhadapnya. Tidak sebagaimana orang-orang Yahudi yang memiliki sifat kebalikan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Wahai Rasul dan setiap orang yang bermaksud baik dalam bercakap, cakap, sungguh kamu akan mendapati orang-orang yang paling keras memusuhi orang-orang yang mengimani risalahmu, yaitu orang-orang Yahudi dan orang-orang musyrik Mekah. Dan kamu akan mendapati dari orang-orang Nasrani, pengikut Isa, orang-orang yang peling menyayangi orang-orang mukmin, karena dalam orang-orang nasrani itu ada pastur (ulama’) yang menguasai Taurat dan Injil, dan pendeta (yang zuhud dan tunduk) di tempat pertapaan mereka yang mana mereka mengajari manusia untuk tunduk kepada Allah, berguna bagi manusia dan mencari kebenaran. Dan mereka itu tidak enggan untuk mengatakan dan mengikuti kebenaran, berbeda dengan orang-orang Yahudi. Ayat ini turun terkait utusan dari An-Najasyi (jumlah mereka 33 laki-laki) yang mendatangi Rasulullah SAW dari Habsyah dan beriman kepadanya. Mereka menangis ketika rasulullah membacakan surah Yasin untuk mereka, lalu mereka berkata: “Betapa hal ini menyerupai apa yang diturunkan kepada Isa AS”. Dan ulama’ lainnya berkata bahwa ayat ini turun terkait utusan rasulullah SAW dari golongan orang Muhajirin yang membawa Al-Qur’an kepada An-Najasyi. Lalu ketika para utusan itu membacakan surah Maryam untuk orang-orang Najasy itu, mereka langsung beriman kepada Al-Qur’an, lalu mengalirlah air mata mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh akan kamu dapati orang yang paling keras permusuhannya terhadap orang-orang yang beriman, yaitu orang-orang Yahudi dan orang-orang musyrik. Sungguh akan kamu dapati pula orang yang paling dekat persahabatannya dengan orang-orang yang beriman, yaitu orang-orang yang berkata, “Sesungguhnya kami adalah orang Nasrani.” Hal itu karena di antara mereka terdapat para pendeta dan rahib} orang-orang yang ahli ilmu dan suka beribadah {juga karena mereka tidak menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Allah berfirman menjelaskan sekelompok terdekat dari dua kelompok kepada kaum Muslimin dan kepada perwalian dan kecintaan mereka dan yang paling jauh dari itu, “ Sesungguhnya kamu dapati orang-orang yang paling keras permusuhannya terhadap orang-orang yang beriman ialah orang-orang yahudi dan orang-orang musyrik.” Kedua kelompok ini secara mutlak adalah orang-orang yang paling keras memusuhi Islam dan kaum Muslimin, paling giat untuk merugikan kaum Muslimin. Hal itu karena kebencian mereka yang besar yang di dasari oleh sikap kesewenang-wenangan, kedengkian, penolakan dan kekufuran. “ Dan sungguh kamu dapati yang paling dekat persahabatannya dengan orang-orang yang beriman ialah orang-orang yang berkata, ‘Sesugguhnya kami ini orang Nasrani’.” Allah menyebutkan beberapa sebab: Di antaranya adalah bahwa di antara mereka “ terdapat pendeta-pendeta dan rahib-rahib,” yaitu para ahli ulama yang zuhud dan ahli ibadah yang beribadah di tempat beribadah mereka. Ilmu yang di barengi zuhud begitu juga ibadah, termasuk yang melembutkan dan melunakkan hati, menghilangkan kekerasan dan kekasaran yang ada padanya. Oleh karena itu di dalam diri mereka tidak terdapat sipat keras orang Yahudi dan sikap kasar orang musyrik. Di antaranya adalah bahwa “ mereka tidak menyombongkan diri,” yakni pada diri mereka tidak terdapat kesombongan dan penolakan untuk mengikuti kebenaran. Hal itu menjadikan diri mereka menjadi dekat dan lebih mencintai kaum Muslimin. Orang yang rendah hati lebih dekat kepada kebanaran daripada orang-orang sombong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 82: Karena kebencian dan kedengkian mereka yang begitu mendalam kepada kaum muslimin, dan karena kebodohan, kekafiran dan karena mereka selalu mengikuti hawa nafsu. Berdasarkan ayat ini, bahwa musuh besar Islam dan kaum muslimin adalah orang-orang Yahudi dan orang-orang musyrik, dan mereka adalah orang-orang yang paling banyak berusaha menimpakan bahaya kepada kaum muslimin. Qissis (pendeta) adalah ulama mereka, sedangkan rahib adalah ahli ibadah di antara mereka. Ilmu yang disertai kezuhudan serta ibadah merupakan hal yang menjadikan hati menjadi lunak dan menyingkirkan kekerasannya. Oleh karena itu, tidak ditemukan dalam diri mereka sikap keras dan kasar sebagaimana dalam diri orang-orang Yahudi dan musyrik. Untuk mengikuti kebenaran, tidak seperti orang-orang Yahudi dan kaum musyrik Mekah yang menyombongkan diri. Orang yang tidak sombong (tawadhu') lebih dekat kepada kebaikan, oleh karenanya mereka lebih dekat kepada kaum muslimin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 82",
    "description": "Pada ayat-ayat yang lalu diterangkan tentang kutukan Allah terhadap orang yahudi, selanjutnya pada ayat ini dijelaskan bagaimana sikap para ahli kitab terhadap orang mukmin. Allah memberikan informasi kepada nabi Muhammad, pasti akan kamu dapati orang yang paling keras permusuhannya terhadap orang-orang yang beriman (umat islam), ialah orang-orang yahudi dan orang-orang musyrik, yang memang merasa tidak senang dan selalu memusuhi rasulullah dan umat islam. Dan di samping itu, pasti akan kamu dapati juga orang yang paling dekat persahabatannya dengan orang-orang yang beriman ialah orang-orang yang berkata, sesungguhnya kami adalah orang nasrani, yaitu yang tekun melaksanakan ajaran agamanya. Yang sedemikian itu karena di antara mereka, orang-orang nasrani, terdapat para pendeta dan rahib yang saleh dan selalu melaksanakan tuntunan agamanya dengan benar, selain itu juga karena sesungguhnya mereka tidak menyombongkan diri dengan segala kesalehan dan ketekunan dalam beribadah. Setelah pada ayat-ayat sebelumnya Allah menjelaskan tentang ahli kitab yang paling memusuhi kaum muslim, yaitu kaum yahudi, dan ahli kitab yang merasa paling dekat dengan kaum muslim, yaitu kaum nasrani; pada ayat ini Allah menjelaskan mengenai sebagian kaum nasrani yang beriman kepada Al-Qur'an. Dan apabila mereka, sebagian ahli kitab seperti utusan kaum nasrani dari ethiopia, mendengarkan apa yang diturunkan kepada rasul, yaitu Al-Qur'an, kamu, wahai nabi Muhammad, akan melihat mata mereka mencucurkan air mata, karena ayat-ayat Al-Qur'an itu meresap ke dalam kalbu mereka secara mendalam, disebabkan mereka telah mengetahui kebenaran Al-Qur'an dari kitab-kitab mereka sendiri, seraya berkata dengan tulus, ya tuhan kami, kami telah beriman kepada Al-Qur'an, maka catatlah kami menjadi bagian yang tidak terpisahkan bersama orang-orang yang menjadi saksi atas kebenaran Al-Qur'an dan kerasulan nabi Muhammad."
  }
]