[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara hal yang menunjukan kedekatan persahabatan mereka dengan kaum muslimin adalah bahwa sesungguhnya segolongan dari mereka (Yaitu utusan orang-orang habsyah ketika menyimak al-qur’an), mata mereka bercucuran air mata, mereka meyakini bahwa sesunggunya itu adalah kebenaran yang diturunkan dari sisi Allah dan mereka beriman kepada Allah dan mengikuti RasulNya, serta tunduk memohon kepada Allah agar berkenan memuliakan mereka dengan kemuliaan bersaksi bersama umat Muhammad atas umat-umat terdahulu pada hari kamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Hati mereka itu (seperti An-Najāsyī dan para sahabatnya) sangat lembut, sehingga mereka mudah menangis ketika mereka mendengar ayat Al-Qur`ān yang diturunkan manakala mereka mengetahui bahwa Al-Qur`ān adalah benar. Karena mereka mengetahui ajaran agama yang dibawa oleh Isa -‘Alaihissalām-, Mereka berkata, “Ya Tuhan kami, sesungguhnya kami percaya kepada apa yang Engkau turunkan kepada rasul-Mu, Muhammad -ṣallallāhu 'alaihi wa sallam-, Maka catatlah kami -wahai Tuhan kami- bersama dengan umat Muhammad -ṣallallāhu 'alaihi wa sallam- yang menjadi hujah bagi manusia kelak di hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Tanda kedekatan persahabatan mereka adalah ketika mereka mendengar Al-quran dibaca, perasaan mereka bergetar, hati mereka menjadi lembut, dan mata mereka bercucur air mata. Dan tidak hanya itu, mereka juga beriman kepada Al-quran dan percaya bahwa ia adalah kalam Allah yang diturunkan kepada Nabi Muhammad. Kemudian mereka memohon kepada Allah dengan penuh ketundukan agar dikaruniai kemuliaan bersyahadat agar menjadi umat Muhammad yang merupakan para saksi atas umat yang lain pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. تَفِيضُ مِنَ الدَّمْعِ (mereka mencucurkan air mata) Yakni menitihkan air mata yang sangat deras saat mendengarkan al-qur’an dibacakan. مِمَّا عَرَفُوا۟ مِنَ الْحَقِّ ۖ( babkan kebenaran (Al Quran) yang telah mereka ketahui) Yakni karena mendengar al-qur’an dibacakan sebab mereka mengetahui bahwa apa yang mereka dengar merupakan kebenaran sesuai dengan apa yang ada dalam kitab mereka. يَقُولُونَ رَبَّنَآ ءَامَنَّا(seraya berkata: “Ya Tuhan kami, kami telah beriman) Yakni kami beriman terhadap kitab yang diturunkan kepada Nabi Muhammad ini dan terhadap Nabi Muhammad itu sendiri. فَاكْتُبْنَا مَعَ الشّٰهِدِين (maka catatlah kami bersama orang-orang yang menjadi saksi) Yakni saksi atas manusia pada hari kiamat bahwa mereka temasuk dari umat Muhammad. Atau saksi atas kebenaran Nabi Muhammad yang diutus kepada umat manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang-orang beriman benar-benar dalam keadaan yang sangat baik, dan ini adalah bukti kuatnya iman mereka, maka barangsiapa yang belum merasakan hal yang sama maka dia belum berada dalam petunjuk yang mereka terima dan tdak pula berada diatas jalan yang mereka tempuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Dan tatkala mereka mendengar Al-Qur’an yang diturunkan Allah kepada rasulullah, mata mereka langsung meneteskan air mata, takut kepada Allah, akibat mendengar Al-Qur’an dan menyadari bahwa itu benar, dan Al-Qur’an itu termasuk sesuatu yang ditunjukkan oleh kitab mereka. Mereka berkata: “Wahai Tuhan kami, kami beriman kepadaMu, Al-Qur’an yang Engkau turunkan ini kepada nabiMu, Muhammad, dan kepada nabi Muhammad ini. Maka catatlah kami bersama orang-orang yang selalu mendekatkan diri yang bersaksi atas ketuhananMu dan mempercayai bahwa nabiMu itu benar dan merupakan rasul yang diutus kepada umat manusia, dan bersama orang-orang mukmin yang bersaksi atas orang mukmin lainnya pada hari kiamat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka mendengar sesuatu apa yang diturunkan kepada Rasul, kamu akan melihat mata mereka bercucuran} meneteskan {air mata karena kebenaran yang telah mereka ketahui. Mereka berkata, “Ya Tuhan kami, kami telah beriman. Maka catatlah kami bersama orang-orang yang menjadi saksi} bersama umat nabi Muhammad SAW yang bersaksi atas umat-umat pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Dan di antaranya adalah bahwa “apabila mereka mendengarkan apa yang diturunkan kepada Rasul,” Muhammad maka hal itu sangat berpengaruh pada hati mereka, mereka khusyu karenanya, air mata mereka menetes karena kebenaran yang mereka dengar dan mereka yakini. Oleh karena itu mereka beriman dan mengakuinya. Mereka berkata, “Ya Tuhan kami, kami telah beriman, maka catatlah kami bersama orang-orang yang menjadi saksi,” yaitu Muhammad, yang bersaksi kepada Allah dengan tauhid, kepada Rasul-rasulNya dengan kerasulan dan kebenaran yang mereka bawa. Mereka menjadi saksi atas umat-umat terdahulu, dengan mereka membenarkan atau mendustakan. Mereka adalah orang-orang yang adil, di mana kesaksian mereka diterima, sebagaimana Firman Allah, \"Dan demikian (pula) Kami telah menjadikan kamu (umat Islam), umat yang adil dan pilihan agar kamu menjadi saksi atas (perbuatan) manusia dan agar Rasul (Muhammad) menjadi saksi atas (perbuatan) kamu. Dan Kami tidak menetapkan kiblat yang menjadi kiblatmu (sekarang) melainkan agar Kami mengetahui (supaya nyata) siapa yang mengikuti Rasul dan siapa yang membelot. Dan sungguh (pemindahan kiblat) itu terasa amat berat, kecuali bagi orang-orang yang telah diberi petunjuk oleh Allah; dan Allah tidak akan menyia-nyiakan imanmu. Sesungguhnya Allah Maha Pengasih lagi Maha Penyayang kepada manusia.\" (Al-Baqarah:143)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 83: Ibnu Abi Hatim meriwayatkan dari Abdullah bin Az Zubair ia berkata, \"Ayat ini turun berkenaan dengan Raja Najasyi dan kawan-kawannya.\" (Hadits ini para perawinya adalah para perawi kitab shahih selain Muhammad bin Idris bapak Ibnu Abi Hatim, sedangkan dia adalah seorang hafizh besar. Al Haafizh Ibnu Katsir menyebutkan dengan sanad ini sambil menisbatkan kepadanya dan diriwayatkan oleh Nasa'i. Al Haitsami dalam Majma'uzzawaa'id juz 9 hal. 419 berkata, \"Diriwayatkan oleh Al Bazzar, dan para perawinya adalah para perawi kitab shahih selain Muhammad bin Utsman bin Bahr, namun dia tsiqah.\") Dalam tafsir Al Jalaalain diterangkan, bahwa Ayat ini turun berkenaan dengan utusan raja Najasyi yang datang kepada Nabi shallallahu 'alaihi wa sallam dari Habasyah. Ketika itu, Rasulullah shallallahu 'alaihi wa sallam membacakan kepada mereka surat Yasin, lalu mereka menangis dan masuk Islam seraya berkata, \"Sungguh mirip sekali perkataan ini dengan yang diturunkan kepada Isa.\" Namun menurut mufassir yang lain, bahwa ayat ini turun berkenaan dengan raja Najasyi dan kawan-kawannya yang menangis, ketika Ja'far bin Abi Thalib membacakan surat Maryam kepada mereka di Habasyah, wallahu a'lam. Yakni umat Nabi Muhammad shallallahu 'alaihi wa sallam, di mana mereka menjadi saksi atas keesaan Allah, menjadi saksi bahwa para rasul telah menyampaikan risalahnya dan menjadi saksi terhadap umat-umat terdahulu, apakah mereka beriman atau tidak. Oleh karena itu, umat Nabi Muhammad shallallahu 'alaihi wa sallam adalah orang-orang yang adil dan persaksian mereka diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 83",
    "description": "Setelah pada ayat-ayat sebelumnya Allah menjelaskan tentang ahli kitab yang paling memusuhi kaum muslim, yaitu kaum yahudi, dan ahli kitab yang merasa paling dekat dengan kaum muslim, yaitu kaum nasrani; pada ayat ini Allah menjelaskan mengenai sebagian kaum nasrani yang beriman kepada Al-Qur'an. Dan apabila mereka, sebagian ahli kitab seperti utusan kaum nasrani dari ethiopia, mendengarkan apa yang diturunkan kepada rasul, yaitu Al-Qur'an, kamu, wahai nabi Muhammad, akan melihat mata mereka mencucurkan air mata, karena ayat-ayat Al-Qur'an itu meresap ke dalam kalbu mereka secara mendalam, disebabkan mereka telah mengetahui kebenaran Al-Qur'an dari kitab-kitab mereka sendiri, seraya berkata dengan tulus, ya tuhan kami, kami telah beriman kepada Al-Qur'an, maka catatlah kami menjadi bagian yang tidak terpisahkan bersama orang-orang yang menjadi saksi atas kebenaran Al-Qur'an dan kerasulan nabi Muhammad. Ayat ini menjelaskan harapan sebagian kaum nasrani yang beriman kepada Al-Qur'an agar Allah memasukkan mereka ke dalam golongan orang-orang yang saleh. Dan tidak ada alasan bagi kami tidak akan beriman kepada Allah, tuhan yang maha esa, tidak beranak dan tidak pula diperanakkan; dan tidak ada sesuatu yang setara dengan dia; dan tidak ada alasan pula bagi kami tidak beriman kepada kebenaran alqur'an yang datang kepada kami, melalui wahyu Allah yang diturunkan kepada nabi Muhammad. Dan kami sangat ingin, dengan senantiasa berdoa dan berusaha, agar tuhan kami memasukkan kami, sejak di dunia hingga di akhirat, ke dalam golongan orang-orang saleh, yakni orang-orang yang baik, taat, dan bermanfaat bagi orang banyak'"
  }
]