[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata , ”dan celaan apapun yang tertuju pada kami terkait keimanan kami kepada Allah dan pembernaran kami terhadap kebenaran yang dibawa Muhammad dari sisi Allah, serta komitmen kami untuk mengikutinya, Dan kami mengharap tuhan kami memasukkan kami bersama orang-orang yang taat kepadaNYa ke dalam surgaNya pada hari kiamat?”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Apa yang menghalangi kami untuk beriman kepada Allah dan kepada kebenaran yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-? Sedangkan kami berharap masuk Surga bersama para nabi dan para pengikutnya yang taat kepada Allah serta takut akan siksa-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Mereka menegaskan keimanan mereka dengan berkata: \"Dan apalagi yang menghalangi kita untuk beriman kepada Allah dan meyakini kebenaran yang dibawa Muhammad dari Tuhannya, dan apa yang menghalangi kita untuk berharap kepada Allah agar memasukkan kita ke dalam surga bersama orang-orang shalih?\" Dalam pernyataan mereka ini terdapat ibarat yang tak terungkap, yakni: dan kami berharap agar Tuhan kami memasukkan kami ke dalam surga bersama orang-orang yang shalih, yaitu kaum muslimin dari umat Muhammad."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَمَا لَنَا لَا نُؤْمِنُ بِاللهِ (Mengapa kami tidak akan beriman kepada Allah) Yakni apa yang menghalangi antara kami dan keimanan kepada Allah padahal sebab-sebab untuk beriman telah ada, yakni berupa keinginan untuk mendapat kenikmatan Allah. وَنَطْمَعُ أَن يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصّٰلِحِينَ(padahal kami sangat ingin agar Tuhan kami memasukkan kami ke dalam golongan orang-orang yang saleh) Yakni kami tidak akan menoleh kepada apa yang membuat kita kafir terhadap Allah dan Rasul-Nya, dan kami ingin masuk surga bersama para orang shaleh dari kalangan para Nabi dan pengikutnya yang senantiasa taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Menanggapi orang-orang Yahudi, mereka berkata: “Mengapa kami tidak beriman hanya kepada Allah dan kebenaran yang datang melalui lisan rasulullah SAW, dan berharap agar Tuhan memasukkan kami ke dalam surgaNya bersama kaum yang shalih, yaitu para nabi, dan pengikut mukminnya yang setia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mengapa kami tidak beriman kepada Allah dan kebenaran yang telah datang kepada kami, padahal kami sangat ingin agar Tuhan kami memasukkan kami bersama kaum yang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Seolah-olah mereka disalahkan atas kecepatan mereka dalam beriman, maka mereka berkata, “Mengapa kami tidak akan beriman kepada Allah dan kepada kebenaran yang datang kepada kami, padahal kami sangat ingin agar Tuhan kami memasukkan kami ke dalam golongan orang-orang yang shalih?” maksudnya, apa yang menghalangi kami beriman kepada Allah sementara kebenaran telah datang kepada kami dari Tuhan kami tanpa keraguan dan kebimbangan. Jika kami beriman dan mengikuti kebenaran, maka kami berharap Allah memasukkan kami ke surga bersama orang-orang yang shalih. Apa yang menghalangi kami? Bukankah itu menuntut agar bersegera dalam beriman dan tidak menunda-nundanya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 84: Ada yang mengatakan, bahwa ucapan ini mereka ucapkan ketika orang-orang Yahudi mencela mereka karena masuk Islam. Yakni, \"Apa yang menghalangi kami untuk beriman, padahal ada yang menghendaki kami beriman (berupa kebenaran yang dibawanya)?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 84",
    "description": "Ayat ini menjelaskan harapan sebagian kaum nasrani yang beriman kepada Al-Qur'an agar Allah memasukkan mereka ke dalam golongan orang-orang yang saleh. Dan tidak ada alasan bagi kami tidak akan beriman kepada Allah, tuhan yang maha esa, tidak beranak dan tidak pula diperanakkan; dan tidak ada sesuatu yang setara dengan dia; dan tidak ada alasan pula bagi kami tidak beriman kepada kebenaran alqur'an yang datang kepada kami, melalui wahyu Allah yang diturunkan kepada nabi Muhammad. Dan kami sangat ingin, dengan senantiasa berdoa dan berusaha, agar tuhan kami memasukkan kami, sejak di dunia hingga di akhirat, ke dalam golongan orang-orang saleh, yakni orang-orang yang baik, taat, dan bermanfaat bagi orang banyak' maka Allah memberi pahala kepada mereka, ahli kitab yang jujur dan konsisten terhadap kebenaran agamanya, atas perkataan yang telah mereka ucapkan, yaitu pernyataan, dan tidak ada alasan bagi kami tidak akan beriman kepada Allah. Mereka mendapat balasan berupa surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, merasakan kenikmatan yang tidak putus. Dan itulah balasan bagi orang-orang yang berbuat kebaikan, terhadap diri mereka sendiri dengan tidak menyembunyikan kebenaran taurat atau injil, yang merupakan wahyu Allah."
  }
]