[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah memberikan balasan bagi mereka atas apa yang mereka ucapkan berupa kebanggaan dengan keimanan mereka terhadap agama islam dan permohononan mereka agar bersama orang-orang yang shalih, yaitu surga-surga yang mengalir di bawah istana-istana dan pohon-pohonnya sungai-sungai. Mereka menetap disana, tidak keluar darinya, dan tidak dipindahkan darinya. Itu adalah balasan atas usaha baik mereka dalam ucapan dan perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Maka Allah akan membalas keimanan dan pengakuan mereka terhadap kebenaran itu dengan Surga yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai, di sana mereka akan tinggal untuk selama-lamanya. Itulah balasan bagi orang-orang yang berbuat baik dalam mengikuti kebenaran dan tunduk kepadanya tanpa batas dan tanpa syarat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Maka Allah membalas keimanan mereka kepada-Nya dan kepada kenabian Muhammad dengan surga-surga yang dibawahnya terdapat sungai-sungai yang mengalir, mereka akan kekal di dalamnya. Itu merupakan balasan atas kebaikan yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. فَأَثٰبَهُمُ اللهُ بِمَا قَالُوا۟ (Maka Allah memberi mereka pahala terhadap perkataan yang mereka ucapkan) Yakni membalas dengan pahala perkataan tersebut yang diucapkan dengan ikhlas dan penuh keimanan atas kandungannya. Rasulullah mengutus ‘Amr bin Umayyah ad-Dhomry dengan membawa surat kepada Najasyi; maka Najazyi memerintahkan untuk mengumpulkan para pendeta dan rahib, lalu ia memerintahkan Ja’far bin Abi Thalib untuk membaca al-qur’an kepada mereka, Ja’far pun membacakan surat Maryam, maka mereka mengungkapkan keimanan kepada al-qur’an sedang mata mereka bercucuran air mata. Mereka lah yang dimaksud dalam firman Allah (ولتجدن أقربهم مودة) sampai ayat (مع الشاهدين)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Maka karena perkataan yang diucapkan dengan benar dan ikhlas, serta pengakuan atas keyakinan mereka itu, Allah akan membalasnya dengan surga-surga yang mengalir sungai-sungai di bawah pepohonan dan rumah-rumahnya. Mereka abadi di dalamnya selamanya. Imbalan itu merupakan balasan bagi orang-orang baik yang selalu melakukan kebaikan dalam mengikuti kebenaran, serta berusaha baik dalam berkata dan beramal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Allah memberi pahala kepada mereka} lalu membalas mereka {atas sesuatu yang telah mereka ucapkan, berupa surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah balasan orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Allah berfirman, “Maka Allah memberi mereka pahala atas perkataan yang mereka ucapkan,” yakni terhadap iman yang mereka ucapkan dan pembenaran kepada kebenaran yang mereka katakan. “(Yaitu) surga yang mengalir sungai-sungai di bawahnya, sedang mereka kekal di dalamnya. Dan itulah balasan (bagi) orang-orang yang berbuat kebaikan (yang ikhlas keimanannya).” Ayat-ayat ini turun pada orang-orang Nasrani yang beriman kepada Muhammad seperti Najasyi dan lain-lainnya yang beriman kepada beliau di antara mereka. Begitu pula masih ada di kalangan mereka yang memilih agama Islam dan yang terkuak baginya kebatilan apa yang mereka pegang selama itu dan mereka lebih dekat kepada agama Islam daripada orang-orang Yahudi dan orang-orang musyrik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 85",
    "description": "Maka Allah memberi pahala kepada mereka, ahli kitab yang jujur dan konsisten terhadap kebenaran agamanya, atas perkataan yang telah mereka ucapkan, yaitu pernyataan, dan tidak ada alasan bagi kami tidak akan beriman kepada Allah. Mereka mendapat balasan berupa surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, merasakan kenikmatan yang tidak putus. Dan itulah balasan bagi orang-orang yang berbuat kebaikan, terhadap diri mereka sendiri dengan tidak menyembunyikan kebenaran taurat atau injil, yang merupakan wahyu Allah. Dan orang-orang kafir, termasuk dari kalangan ahli kitab seperti yahudi dan nasrani, serta orang-orang yang mendustakan ayat-ayat kami, yaitu Al-Qur'an yang diturunkan kepada nabi Muhammad, di akhirat nanti, mereka itu akan menjadi penghuni neraka jahim yang kekal di dalamnya."
  }
]