[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengingkari keesaan Allah dan mengingkari ayat-ayatNya yang diturunkan pada rasul-rasulNya, mereka itu adalah para penghuni neraka yang akan terus berada disana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Orang-orang yang ingkar kepada Allah dan rasul-Nya, dan mendustakan ayat-ayat Allah yang diturunkan kepada rasul-Nya, mereka itu adalah penghuni Neraka yang berkobar-kobar; menetap di sana dan tidak akan keluar darinya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Adapun orang-orang yang kafir terhadap Allah dan menyekutukan-Nya serta mendustakan ayat-ayat-Nya yang diturunkan kepada para Rasul, maka mereka adalah orang-orang yang dijauhkan dari rahmat-Nya, yang akan kekal didalam api neraka yang berkobar-kobar ketika membakar mereka karena begitu panasnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Dan orang-orang yang menolak agama yang benar dan mendustakan Al-Qur’an, mereka itu adalah para penghuni neraka Jahim, yaitu suatu tempat di neraka Jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang ingkar dan mendustakan ayat-ayat Kami, mereka itulah penghuni neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Ketika Allah menyebutkan pahala orang-orang yang berbuat baik, Dia menyebutkan balasan orang-orang yang berbuat buruk. “Dan orang-orang kafir serta mendustakan ayat-ayat Kami, mereka itulah penghuni neraka.” Karena mereka kafir kepada Allah dan mendustakan ayat-ayatNya yang menjelaskan kepada kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 86",
    "description": "Dan orang-orang kafir, termasuk dari kalangan ahli kitab seperti yahudi dan nasrani, serta orang-orang yang mendustakan ayat-ayat kami, yaitu Al-Qur'an yang diturunkan kepada nabi Muhammad, di akhirat nanti, mereka itu akan menjadi penghuni neraka jahim yang kekal di dalamnya. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! janganlah kamu mengharamkan apa yang baik bagi kesehatan kamu, yang telah dihalalkan Allah di dalam Al-Qur'an kepadamu, dan janganlah kamu melampaui batas dalam segala hal yang telah ditetapkan Allah di dalam Al-Qur'an. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas, baik dalam agama maupun kehidupan sosial."
  }
]