[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman,janganlah kelian mengharamkan apa-apa yang baik-baik yang Allah halalkan bagi kalian dari berbagai jenis makanan dan minuman, serta menikahi wanita, sehingga kalian mempersempit apa yang Allah lapangkan bagi kalian. Dan janganlah kalian melampaui batas-batasan apa saja yang telah Allah haramkan. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Wahai orang-orang yang beriman! Janganlah kalian mengharamkan hal-hal yang nikmat berupa makanan, minuman, dan pernikahan yang dihalalkan bagi kalian. Janganlah kalian mengharamkannya dengan niat bersikap zuhud atau beribadah. Dan janganlah kalian melanggar larangan-larangan Allah. Sesungguhnya Allah tidak menyukai orang-orang yang melanggar larangan-larangan-Nya, bahkan Dia membenci mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Hai orang-orang yang beriman kepada Allah janganlah kalian menjadikan hal yang haram menjadi halal dan yang halal menjadi haram; seperti mengharamkan makanan, minuman, dan kenikmatan yang halal bagi kalian, atau menghalalkan makanan dan minuman yang diharamkan. Jika kalian melakukan hal ini maka kalian telah mempersempit apa yang telah diluaskan Allah, dan meluaskan apa yang telah dipersempit Allah kepada kalian. Maka janganlah kalian melewati batas, sehingga menghalalkan apa yang diharamkan Allah dan mengharamkan apa yang dihalalkan Allah. Sungguh Allah membenci orang-orang yang melewati batas. Dan yang dimaksud dalam ayat ini bukanlah larangan mengucapkan dengan lisan bahwa sesuatu itu haram baginya, namun yang dimaksud adalah meninggalkan atau tidak memakan sesuatu karena ingin mempersulit dan bersikap keras terhadap dirinya, baik itu dia mengucapkan keharaman itu dengan lisan maupun tidak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. لَا تُحَرِّمُوا۟ طَيِّبٰتِ مَآ أَحَلَّ اللهُ لَكُمْ(janganlah kamu haramkan apa-apa yang baik yang telah Allah halalkan bagi kamu) Yang dimaksud dengan apa-apa yang baik adalah segala kenikmatan yang dihalalkan Allah untuk hamba-hamba-Nya; Allah melarang mereka untuk mengharamkan hal itu, baik itu karena anggapan mereka bahwa mengharamkannya merupakan ketaatan dan pendekatan kepada Allah, maupun karena mereka berzuhud terhadap kenikmatan dunia, atau memang bermaksud untuk mengharamkan hal itu atas diri sendiri seperti yang banyak dilakukan orang-orang awam yang mengatakan “aku haram memakan ini”, “aku mengharamkan diriku untuk memakan ini” dan perkataan-perkataan lain yang masuk dalam larangan al-qur’an ini. وَلَا تَعْتَدُوٓا۟ ۚ( dan janganlah kamu melampaui batas) sehingga kalian menghalalkan apa yang diharamkan Allah; yakni janganlah kalian mencari-cari rukhshah sehingga menghalalkan hal yang haram, sebagaimana kalian dilarang untuk memberatkan diri kalian sehingga mengharamkan hal yang halal. Imam Abu Hanifah dan Imam Ahmad serta para pengikutnya berpendapat bahwa barangsiapa yang memakan sesuatu yang telah ia haramkan atas dirinya sendiri maka ia wajib membayar kafarat kerena telah melanggar sumpah. Dan ini adalah maksud dari ayat 89."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Wahai orang-orang mukmin, janganlah kalian mengharamkan sesuatu yang baik-baik (kelezatan) yang dihalalkan Allah untuk kalian, dengan alasan zuhud atau mendekatkan diri kepada Allah. Dan janganlah kalian melampaui batas-batas halal-haram, sehingga kalian menghalalkan hal yang diharamkan Allah atas kalian. Sesungguhnya Allah akan menghukum atau membalas orang-orang yang melanggar batas-batas dan aturan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian mengharamkan sesuatu yang baik} yang enak {yang telah dihalalkan oleh Allah bagi kalian, dan janganlah kalian melampaui batas} janganlah kalian melampaui batas hal yang halal menuju hal yang haram. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah berfirman, “Hai orang-orang yang beriman, janganlah kamu haramkan apa-apa yang baik yang telah Alah halalkan bagi kamu,” dari makanan dan minuman, karena ia adalah nikmat Allah yang Allah berikan kepadamu. Bersyukur dan pujilah Dia, karena Dia telah menghalalkannya untukmu, jangan menolaknya dengan mengkufurinya atau tidak menerimanya atau meyakini keharamannya, karena dengan itu kamu menggabungkan antara berdusta atas Nama Allah dengan mengkufuri nikmatNya dan meyakini yang halal lagi baik sebagai yang haram lagi buruk; karena ini termasuk melanggar batas. Dia berfirman, “Dan janganlah kamu melampaui batas. Sesunguhnya Allah tidak menyukai orang-orang yang melampaui batas,” bahkan Dia membenci, memurkai, dan akan menghukum mereka atas hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 87: Ayat ini turun berkenaan sebagian sahabat yang hendak melazimkan puasa, shalat malam dan tidak mendekati istri, serta tidak mau memakai wewangian, tidak memakan daging dan tidak tidur di atas kasur, padahal yang demikian dihalalkan Allah Subhaanahu wa Ta'aala. Nikmat-nikmat yang diberikan Allah patut disyukuri, baik dengan memuji Allah ketika memperolehnya, tidak kufur nikmat dan tidak menolaknya atau meyakini haramnya, karena yang demikian sama saja berkata dusta tentang Allah, kufur nikmat, dan meyakini yang baik sebagai sesuatu yang haram lagi buruk, ini semua merupakan sikap melampaui batas. Dia membenci sikap tersebut, murka dan akan memberikan hukuman terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 87",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! janganlah kamu mengharamkan apa yang baik bagi kesehatan kamu, yang telah dihalalkan Allah di dalam Al-Qur'an kepadamu, dan janganlah kamu melampaui batas dalam segala hal yang telah ditetapkan Allah di dalam Al-Qur'an. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas, baik dalam agama maupun kehidupan sosialdan makanlah oleh kamu wahai orang-orang yang beriman, dari apa yang telah diberikan Allah kepadamu, berupa bahan makanan yang berasal dari darat maupun dari laut, baik protein nabati maupun protein hewani sebagai rezeki yang halal dan baik untuk menopang aktivitas kamu dalam hidup dan kehidupan ini; dan bertakwalah kepada Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya, yang kepada-Nya kamu beriman dengan ikhlas dan istikamah."
  }
]