[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersenang-senanglah kalian (wahai kaum mukminin), dengan menikmati yang halal lagi baik dari apa yang Allah berikan kepada kalian dan anugerahkan kepada kalian. Dan bertakwalah kepada Allah dengan menjalankan perintah-perintahNYa dan menjauhi larangan-laranganNya. Sesungguhnya keimanan kalian kepada Allah mengharuskan kalian bertakwa dan selalu mendekatkan diri kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Makanlah dari rezeki yang Allah berikan kepada kalian dalam kondisi yang halal lagi baik, bukan dalam kondisi haram, seperti rezeki yang diambil secara paksa atau menjijikkan. Dan takutlah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, karena kalian beriman kepada-Nya. Dan iman kalian kepada-Nya mengharuskan kalian takut kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Dan makanlah makanan-makanan yang baik yang telah dihalalkan Allah bagi kalian, karena itu merupakan rezeki yang telah Allah berikan. Dan selama kalian telah beriman kepada Allah maka bertakwalah kepadanya dengan mengikuti segala perintah dan dan menjauhi larangannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. حَلٰلًا طَيِّبًا ۚ (yang halal lagi baik) Yakni yang tidak haram dan menjijikkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Dan dihperbolehkan untuk kalian wahai orang-orang mukmin, untuk mengkonsumsi makanan dan minuman yang yang diberikan oleh Allah dengan halal (yang tidak diharamkan), baik (tidak kotor). Dan takutlah kepada Allah dengan menunaikan syariatNya yang kalian Imani, karena sesungguhnya iman yang benar kepada Allah itu adalah kebaikan yang didukung dengan ketakwaan dan amal shalih. Ayat ini turun terkait orang yang mengharamkan daging bagi dirinya sendiri dan suatu kelompok yang mewajibkan shalat pada malam hari, puasa di siang hari dan meninggalkan perempuan. Mereka itu 10 orang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Makanlah apa yang telah dianugerahkan oleh Allah kepada kalian sebagai rezeki yang halal lagi baik, dan bertakwalah kepada Allah yang hanya kepadaNya kalian beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Kemudian Dia memerintahkan kebalikan dari apa yang dilakukan oleh orang-orang musyrik yang mengharamkan apa yang dihalalkan oleh Allah, “Dan makanlah makanan yang halal lagi baik dari apa yang Allah telah rizkikan kepadamu,” maksudnya, makanlah rizki yang dikirimkanNya kepadamu dengan berbagai jalan yang dimudahkan, jika itu halal bukan pencurian, bukan merampas hak orang dan bukan pula harta-harta yang lain yang diambil dengan cara tidak benar. Dan makanan itu juga baik, yaitu, yang tidak ada keburukan padanya, maka tidak termasuk ke dalamnya binatang buas yang keji dan hewan-hewan yang menjijikkan. “Dan bertakwalah kepada Allah,” dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya. “Yang kamu beriman kepadaNya,” karena imanmu kepada Allah mengharuskanmu bertakwa kepadaNya dan menjaga hakNya, karena ia tidak sempurna kecuali dengan itu. Ayat ini menunjukkan bahwa jika seseorang mengharamkan yang halal untuknya, baik itu makanan atau minuman atau hamba sahaya wanita dan lain-lain, maka ia tidak menjadi haram dengan pengharamannya, akan tetapi seandainya dia melakukannya, maka wajib atasnya membayar kaffarat sumpah, sebagaimana Firman Allah \"Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu; kamu mencari kesenangan hati isteri-isterimu? Dan Allah Maha Pengampun lagi Maha Penyayang\" (At-Tahrim:1). Hanya saja pengharaman istri di dalamnya mewajibkan kaffarat zhihar. Termasuk dalam ayat ini adalah, hendaknya seseorang tidak menjauhi dan mengharamkan apa-apa yang baik untuk dirinya, akan tetapi dia memakannya untuk membantunya taat kepada Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 88: Dalam ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin untuk menyelisihi orang-orang musyrik yang mengharamkan apa yang dihalalkan Allah Ta'ala. Makanan halal adalah makanan yang tidak haram, bukan makanan yang didapatkan dari mencuri, merampas dan mengambil tanpa hak. Sedangkan makanan yang baik adalah makanan yang tidak kotor. Keimanan kepada Allah menghendaki pelakunya bertakwa kepada-Nya dan memperhatikan hak-Nya, di samping itu, iman tidaklah sempurna kecuali dengannya. Ayat di atas juga menunjukkan bahwa apabila seseorang mengharamkan yang halal baik berupa makanan, minuman atau lainnya, maka yang demikian tidaklah menjadikan makanan atau minuman itu haram. Akan tetapi, jika dia memakannya atau meminumnya, maka ia harus membayar kaffarat yamin/sumpah (lih. At Tahrim: 2). Lihat perincian kaffarat yamin di ayat 89 setelahnya. Dan jika yang diharamkan adalah istrinya, maka kaffaratnya adalah kaffarat Zhihar (lih. Al Mujaadilah: 3-4). Ayat ini juga menunjukkan, bahwa tidak layak bagi seseorang menjauhi sesuatu yang baik-baik dan mengharamkan yang demikian bagi dirinya, bahkan seharusnya ia memanfaatkannya dan menggunakannya untuk ketaatan kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 88",
    "description": "Dan makanlah oleh kamu wahai orang-orang yang beriman, dari apa yang telah diberikan Allah kepadamu, berupa bahan makanan yang berasal dari darat maupun dari laut, baik protein nabati maupun protein hewani sebagai rezeki yang halal dan baik untuk menopang aktivitas kamu dalam hidup dan kehidupan ini; dan bertakwalah kepada Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya, yang kepada-Nya kamu beriman dengan ikhlas dan istikamah. Ayat ini menjelaskan macam-macam kafarat atau denda bagi siapa saja yang melanggar sumpah yang diucapkan secara sadar dan sengaja. Namun demikian, kafarat ini tidak berlaku bagi sumpah yang tidak disengaja. Allah tidak akan menghukum kamu, wahai orang beriman, disebabkan sumpah-sumpahmu yang tidak disengaja untuk diucapkan, seperti perkataan, tidak, demi Allah, atau benar, demi Allah, tetapi dia akan menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja. Jika kamu dalam mengucapkan sumpah itu benar-benar bermaksud untuk bersumpah, maka kafaratnya, denda pelanggaran sumpah supaya dosa sumpahmu diampuni oleh Allah, ialah memberi makan sepuluh orang miskin, baik yang kamu kenal maupun tidak, yaitu dari jenis makanan yang biasa kamu berikan kepada keluargamu, baik dari segi jumlah maupun jenis makanannya, atau memberi mereka pakaian baru maupun layak pakai, atau memerdekakan seorang hamba sahaya, baik laki-laki maupun perempuan. Barang siapa tidak mampu melakukannya, salah satu dari tiga pilihan kafarat tersebut, maka kafaratnya berpuasalah tiga hari dengan ikhlas sambil berharap agar Allah mengampuni dosa sumpah yang pernah diucapkannya. Itulah ketentuan Allah tentang kafarat sumpah-sumpahmu, apabila kamu benar-benar bersumpah dengan sengaja. Dan jagalah sumpahmu supaya kamu tidak mudah bersumpah, apalagi bersumpah palsu. Demikianlah Allah menerangkan hukum-hukumnya tentang sumpah kepadamu agar kamu bersyukur kepada-Nya atas segala nikmat yang telah diberikan Allah kepada kamu."
  }
]