[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak menyiksa kalian (wahai kaum Muslimin) atas sesuatu yang kalian tidak bermaksud menyatakannya (sebagai) sumpah dari sumpah-sumpah, seperti ucapan sebagian kalian, ”tidak demi Allah” ,dan ”benar,demi Allah” akan tetapi Allah akan menghukum kalian dalam perkara (sumpah) yang memang sengaja kalian kukuhkan dengan hati kalian. Apabila kalian tidak memenuhi sumpah-sumpah kalian, maka dosanya akan dihapuskan oleh Allah dengan apa yang kalian persembahkan dari ajaran yang Allah syariatkan bagi kalian sebagai penggugurnya, yaitu berupa memberi makan sepuluh orang yang membutuhkan yang tidak memeiliki sesuatu yang bisa mencukupi dan menutup kebutuhan mereka, tiap-tiap orang miskin memperoleh setengah sha makanan standar penduduk negeri setempat, atau memberi pakaian kepada mereka, setiap orang miskin memperoleh apa yang cukup sebagai pakaian berdasarkan kebiasaan yang berlaku, atau memerdekakan seorang budak. Orang yang sumpah yang tidak menepati sumpahnya, dia dihadapkan pada pilihan diantara satu dari tiga pilihan ini. Apabila ia tidak mampu melakukan salah satunya sama sekali, maka dia wajib berpuasa tiga hari. Itu adalah kafarat (penggugur) sikap tidak menepati isi sumpah-sumpah. Dan peliharalah oleh kalian (wahai kaum Muslimin) sumpah-sumpah kalian, dengan menghindari sumpah, atau dengan menepati sumpah bila kalian mengeluarkan sumpah, atau membayar kafarat bila tidak menepati sumpah. Sebagaimana Allah telah menjelaskan kepada kalian hukum bersumpah dan cara-cara membebaskan diri darinya. Dia juga menerangkan kepada kalian hukum-hukum agamaNya agar kalian bersyukur kepadaNya atas hidayah dariNya kepada kalian menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Allah tidak akan menghukum kalian -wahai orang-orang mukmin- berdasarkan sumpah yang kalian ucapkan tanpa sengaja, tetapi Dia akan menghukum kalian berdasarkan sumpah yang disengaja dan hati kalian bertekad untuk itu, kemudian kalian melanggar sumpah itu. Kafarat dari sumpah yang kalian sengaja dan diucapkan dengan sungguh-sungguh, bila kalian melanggarnya, maka salah satu dari tiga pilihan, yaitu: memberi makan 10 orang miskin dengan jenis makanan yang biasa dikonsumsi oleh rata-rata penduduk negerimu. Masing-masing orang miskin mendapat setengah ṣā’ (sekitar satu setengah kilogram), atau memberikan pakaian kepada mereka dengan jenis pakaian yang umum, atau memerdekakan seorang budak belian yang beriman (muslim). Jika seseorang tidak mampu menebus dengan salah satu dari tiga pilihan tersebut, ia boleh berpuasa selama 3 hari. Hal-hal itu semua merupakan kafarat sumpah kalian -wahai kaum mukminin- bila kalian bersumpah atas nama Allah lantas melanggarnya. Hindarilah bersumpah atas nama Allah dengan maksud berdusta, banyak bersumpah, serta tidak memenuhi sumpah selama tindakan memenuhi sumpah tersebut mengandung kebaikan, maka kerjakanlah hal yang baik tersebut. Bayarlah kafarat sumpah kalian sebagaimana yang Allah jelaskan kepada kalian terkait kafarat sumpah. Allah menerangkan kepada kalian hukum-hukum-Nya yang jelas mengenai yang halal dan haram, agar kalian bersyukur kepada Allah atas apa yang telah diajarkan oleh-Nya sebuah pengetahuan yang belum kalian ketahui sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Allah Maha Mengetahui tabiat, kelemahan, dan kekurangan manusia. Dan Allah mempedulikan mereka dari sisi ini, yaitu ketika seseorang mengucapkan sumpah tanpa ada maksud bersumpah di dalam hati, seperti ketika mengucapkan: demi Allah tidak, demi Allah aku akan pergi, dst. Bahwa Allah memaafkan sumpah yang demikian sehingga Dia tidak akan memperhitungkannya. Namun yang akan Allah perhitungkan adalah sumpah yang kalian ucapkan dengan hati yang penuh kesungguhan untuk bersumpah. Dan Allah juga menahan siksaan-Nya dari kalian dengan mensyariatkan pembayaran kafarat. Jika seseorang bersumpah dengan sungguh-sungguh untuk melakukan sesuatu namun dia tidak melakukannya, maka wajib baginya untuk membayar kafarat. Yaitu dengan memberi makan 10 orang miskin dengan makanan yang biasa dia berikan kepada keluarganya, setiap 1 orang miskin mendapat bagian 1 mud; atau dengan memberi mereka pakaian berupa kain sarung, selendang, kemeja, atau pakaian apapun yang dapat mereka pakai sesuai dengan waktu dan tempat; atau dengan memerdekakan 1 budak, baik itu budak laki-laki maupun perempuan. Tiga bentuk kafarat ini dapat mereka pilih salah satunya. Namun jika terdapat orang yang tidak mampu membayar salah satu kafarat tersebut, maka wajib baginya untuk berpuasa selama 3 hari. Ini merupakan kafarat-kafarat dari sumpah yang yang kalian langgar, maka jagalah sumpah-sumpah kalian. Jauhilah bersumpah sebisa mungkin, namun jika kalian memang harus bersumpah maka hendaklah kalian memenuhi sumpah tersebut. Dan bayarlah kafarat jika kalian tidak mampu memenuhi sumpah. Allah telah menjelaskan hukum-hukum agama kalian agar kalian mensyukuri rahmat dan petunjuk yang telah Allah berikan kepada kalian. Bagi Allah keutamaan dan pujian atas syariat-Nya yang telah Dia jelaskan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. لَا يُؤَاخِذُكُمُ اللهُ بِاللَّغْوِ فِىٓ أَيْمٰنِكُمْ (Allah tidak menghukum kamu disebabkan sumpah-sumpahmu yang tidak dimaksud) Orang yang mengucapkan kalimat-kalimat sumpah yang tidak dimaksudkan untuk bersumpah tidak mendapat hukuman dari Allah dan tidak diwajibkan untuk membayar kafarat. Misalnya adalah ucapan seseorang “tidak, demi Allah” dan “bukan demikian demi Allah” yang tidak dimaksudkan untuk bersumpah. وَلٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ الْأَيْمٰنَ ۖ (tetapi Dia menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja) Yakni apabila melanggar perkataan yang diikat dengan sumpah-sumpah yang kalian ucapkan dengan penuh maksud dan niat. فَكَفّٰرَتُهُۥٓ (maka kaffarat (melanggar) sumpah itu) Yakni barang siapa yang bersumpah dengan sumpah yang teguh kemudian ia melanggarnya maka ia wajib membayar kafarat berupa memberi makan sepuluh orang miskin dalam bentuk makanan yang biasa kalian berikan kepada keluarga kalian. إِطْعَامُ عَشَرَةِ مَسٰكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ (ialah memberi makan sepuluh orang miskin, yaitu dari makanan yang biasa kamu berikan kepada keluargamu) Yakni dengan makanan yang rata-rata kalian berikan kepada keluarga kalian, dan tidak wajib mengeluarkan yang lebih baik dari itu namun tidak boleh yang lebih jelek dari itu. Dan kalian memberi mereka (orang-orang miskin) makan sampai kenyang. Umar bin Khattab dan ‘Aisyah berpendapat bahwa yang diberikan kepada setiap orang dari sepuluh tersebut dengan takaran setengah sho’ gandum atau kurma. أَوْ كِسْوَتُهُمْ(atau memberi pakaian kepada mereka) Yakni yang menutup badan meski hanya satu helai. Pendapat lain mengatakan yang dimaksud dengan memberi pakaian ialah pakaian yang sah jika dipakai untuk shalat. أَوْ تَحْرِيرُ رَقَبَةٍ ۖ( atau memerdekakan seorang budak) Yakni membebaskan budak dari perbudakannya. Orang yang melanggar sumpah tersebut boleh memilih satu diantara tiga kaffarat ini sesuai dengan yang ia kehendaki. فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلٰثَةِ أَيَّامٍ ۚ( Barang siapa tidak sanggup melakukan yang demikian, maka kaffaratnya puasa selama tiga hari) Yakni barangsiapa yang tidak memdapatkan salahsatu dari ketiga kaffarat tersebut, maka cukup baginya dengan berpuasa tiga hari, baik puasa tiga hari berturut-turut maupun secara selang-seling. وَاحْفَظُوٓا۟ أَيْمٰنَكُمْ ۚ (Dan jagalah sumpahmu) Allah memerintahkan untuk menjaga sumpah dan tidak bergesa-gesa mengucapkannya atau melanggarnya. Dan jika mereka melanggar maka janganlah meremehkan dengan meninggalkan pembayaran kaffarat. لَعَلَّكُمْ تَشْكُرُونَ (agar kamu bersyukur) Bersyukur atas kenikmatan yang Allah berikan kepada kalian yang meliputi penjelasan syari’at-syari’at dan hukum-hukum-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Allah tidak akan menghukum kalian atas sumpah palsu dan hal itu tidak wajib didenda, yaitu ucapan yang keluar dari lisan tanpa maksud untuk bersumpah, seperti ucapan: “Tidak, demi Allah, benar, demi Allah” yang tidak dimaksudkan untuk bersumpah, namun Allah akan menghukum kalian akibat sumpah kalian yang memang dimaksudkan dan diniatkan untuk bersumpah, lalu kalian mengingkarinya. Dan denda atas sumpah sesungguhnya yang dilanggar adalah memberi makan 10 orang miskin dari makanan yang biasa kalian berikan untuk keluarga kalian, yaitu sesuatu yang biasa kalian makan, tanpa berlaku boros dan pelit di waktu makan siang dan makan malam dengan takaran setengah Sha’ gandum dan kurma (ukuran 1 Sha’ adalah 2751 gram) atau senilai takaran itu atau pakaian yang menutupi badan untuk masing-masing orang miskin, atau memerdekakan budak. Dan orang kaya yang bersumpah lagi mengingkarinya bisa memilih 3 hal ini. Dan barangsiapa tidak bisa melaksanakan hal ini karena fakir, maka cukup baginya untuk berpuasa selama 3 hari berturut-turut. Maka jagalah sumpah kalian, jangan mengingkarinya tanpa sebab yang kuat, berusaha dengan baik terhadap sumpah itu dan jangan mengingkarinya, jika memang sumpah itu untuk hal ketaatan bukan kemaksiatan. Seperti penjelasan itulah, Allah menjelaskan kepada kalian hukum-hukum dalam syariatNya, supaya kalian bisa bersyukur atas nikmat yang diberikan Allah atas kalian berupa penjelasan tentang syariat dan hukum. Ayat ini turun terkait kaum yang mengharamkan perempuan dan daging atas dirinya dengan bersumpah untuk menjelaskan bagaimana perbuatan mereka itu dilakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak menghukum kalian ketidak sengajaan dalam sumpah-sumpah kalian} Allah tidak menghukum sumpah yang keluar dari lisan kalian tanpa ada maksud {tetapi Dia menghukum kalian karena kalian sengaja mengadakan sumpah-sumpah} sumpah yang sengaja dilakukan dengan hati kalian {Maka, dendanya adalah memberi makan sepuluh orang miskin dari makanan} kebaikan {yang kalian berikan kepada keluarga kalian, memberi pakaian kepada mereka, atau memerdekakan seorang hamba sahaya} memerdekakan hamba yang mukmin {Siapa saja yang tidak mampu melakukannya, maka berpuasa tiga hari. Itulah denda sumpah-sumpah kalian apabila kalian bersumpah} melanggar sumpah {Jagalah sumpah-sumpah kalian} Jauhilah melakukan sumpah yang tidak diperlukan {Demikianlah Allah menjelaskan kepada kalian hukum-hukumNya agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. Maksudnya, sumpah yang keluar darimu dalam bentuk main-main (tidak serius), yaitu sumpah yang diucapkan oleh pengucapnya tanpa niat dan maksud atau dia mengucapkannya dengan dugaan bahwa dirinya benar akan tetapi yang terjadi adalah sebaliknya. “Tetapi Dia menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja,” yakni, sumpah yang kamu niatkan dan ikrarkan di dalam hatimu, sebagaimana Firman Allah dalam ayat yang lain, \"Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia Yang Hidup kekal lagi terus menerus mengurus (makhluk-Nya); tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa’at di sisi Allah tanpa izin-Nya? Allah mengetahui apa-apa yang di hadapan mereka dan di belakang mereka, dan mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Allah Maha Tinggi lagi Maha Besar.\" (Al-Baqarah:225). “Maka kaffarat (dendanya),” yakni kaffarat sumpah yang kamu ikrarkan dengan hatimu itu, “Ialah memberi makan sepuluh orang miskin.” Dan memberi makan itu, “yaitu dari makanan yang biasa kamu berikan kepada keluargamu, atau memberi pakaian kepada mereka,” yakni memberi pakaian kepada sepuluh orang miskin. Dan pakaian yang dimaksud di sini adalah yang memadai untuk dipakai shalat. “Atau memerdekakan seorang budak,” yakni hamba sahaya yang beriman sebagaimana ia diberi batasan dengan itu di tempat lain. Kapan dia melakukan satu dari tiga hal tersebut, maka bebaslah dia dari sumpahnya. “Barangsiapa tidak sanggup,” melakukan satu dari tiga perkara ini, “maka kaffaratnya puasa selama tiga hari.” Yang demkian itu,” yakni yang disebutkan, “adalah kaffarat sumpah-sumpahmu bila kamu bersumpah (dan kamu langgar).” Ia melebur, menghapus, dan mencegahnya dari dosa. “Dan jagalah sumpahmu,” dengan tidak bersumpah atas Nama Allah secara dusta, (dan jagalah) dari memperbanyak sumpah. Jika kamu telah bersumpah, maka jagalah ia, jangan melanggarnya kecuali jika ia lebih baik, dan termasuk kesempurnaan menjaga adalah melakukan kebaikan dan sumpahnya jangan dijadikan penghalang melakukan kebaikan itu. “Demikianlah Allah menerangkan kepadamu hukum-hukumNya,” yang menjelaskan yang halal dan yang haram dan yang menjelaskan hukum-hukum, “agar kamu bersyukur (kepadaNya),” kepada Allah yang telah mengajarkan kepadamu apa yang belum kamu ketahui. Seorang hamba wajib bersyukur kepada Allah atas nikmatNYa dalam bentuk pengetahuan dan penjelasan hukum-hukum syar’i."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 89: Laghw atau sumpah yang tidak disengaja adalah ucapan yang biasa keluar dari lisan tanpa ada maksud bersumpah (tanpa niat) atau seseorang meyakini sesuatu yang dikiranya benar, namun ternyata tidak demikian. Contoh laghw adalah seseorang berkata, \"Tidak! Demi Allah\", \"Benar, demi Allah\" dsb. Masing-masing orang miskin mendapatkan satu mud (satu kaupan tangan orang dewasa atau + 6,5 ons) makanan. Yakni tidak terlalu mahal dan tidak terlalu murah, tetapi pertengahan di antara itu. Yang layak dipakai untuk shalat. Yakni yang mukmin, sebagaimana dalam kaffarat pembunuhan dan zhihar mengikuti kaidah hamlul mutlak 'alal muqayyad (membawa yang masih mutlak kepada yang muqayyad/tidak mutlak). Namun ada yang berpendapat bahwa kata raqabah (budak) di ayat ini adalah mutlak, dan tidak bisa ditaqyid dengan yang disebutkan dalam kaffarat pembunuhan karena berbeda hukum (masalah), sehingga tetap sah meskipun bukan mukmin. Zhahirnya tidak mesti berurutan, dan inilah yang dipegang oleh Imam Syafi'i. Jangan kamu langgar selama tidak menghalangi berbuat baik dan mendamaikan manusia (lih. Al Baqarah: 224). Atau maksud \"Jagalah sumpahmu\" adalah dengan tidak bersumpah namun isinya dusta dan banyak bersumpah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 89",
    "description": "Ayat ini menjelaskan macam-macam kafarat atau denda bagi siapa saja yang melanggar sumpah yang diucapkan secara sadar dan sengaja. Namun demikian, kafarat ini tidak berlaku bagi sumpah yang tidak disengaja. Allah tidak akan menghukum kamu, wahai orang beriman, disebabkan sumpah-sumpahmu yang tidak disengaja untuk diucapkan, seperti perkataan, tidak, demi Allah, atau benar, demi Allah, tetapi dia akan menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja. Jika kamu dalam mengucapkan sumpah itu benar-benar bermaksud untuk bersumpah, maka kafaratnya, denda pelanggaran sumpah supaya dosa sumpahmu diampuni oleh Allah, ialah memberi makan sepuluh orang miskin, baik yang kamu kenal maupun tidak, yaitu dari jenis makanan yang biasa kamu berikan kepada keluargamu, baik dari segi jumlah maupun jenis makanannya, atau memberi mereka pakaian baru maupun layak pakai, atau memerdekakan seorang hamba sahaya, baik laki-laki maupun perempuan. Barang siapa tidak mampu melakukannya, salah satu dari tiga pilihan kafarat tersebut, maka kafaratnya berpuasalah tiga hari dengan ikhlas sambil berharap agar Allah mengampuni dosa sumpah yang pernah diucapkannya. Itulah ketentuan Allah tentang kafarat sumpah-sumpahmu, apabila kamu benar-benar bersumpah dengan sengaja. Dan jagalah sumpahmu supaya kamu tidak mudah bersumpah, apalagi bersumpah palsu. Demikianlah Allah menerangkan hukum-hukumnya tentang sumpah kepadamu agar kamu bersyukur kepada-Nya atas segala nikmat yang telah diberikan Allah kepada kamu. Melalui ayat ini, Allah memerintahkan kaum mukmin untuk menjauhi perbuatan setan. Wahai orang-orang yang beriman kepada Allah, kitab-Nya, dan rasul-Nya! sesungguhnya minuman keras, apa pun jenisnya, sedikit atau banyak, memabukkan atau tidak memabukkan; berjudi, bagaimana pun bentuknya; berkurban untuk berhala, termasuk sesajen, sedekah laut, dan berbagai persembahan lainnya kepada makhluk halus; dan mengundi nasib dengan anak panah atau dengan cara apa saja sesuai dengan budaya setempat, adalah perbuatan keji karena bertentangan dengan akal sehat dan nurani serta berdampak buruk bagi kehidupan pribadi dan sosial; dan termasuk perbuatan setan yang diharamkan Allah. Maka jauhilah perbuatan-perbuatan itu dalam kehidupan pribadi dan kehidupan sosial dengan peraturan yang tegas dan hukuman yang berat agar kamu beruntung dan sejahtera lahir batin dalam kehidupan dunia dan terhindar dari azab Allah di akhirat."
  }
]