[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menjanjikan orang-orang yang beriman kepada Allah dan RasulNya dan mengerjakan amal-amal shalih bahwa Dia akan mengampuni dosa-dosa mereka dan akan memberikan pahala bagi mereka atas amal-amal itu berupa surga. Dan Allah tidak memungkiri janjiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Allah -yang tidak pernah mengingkari janji-Nya- menjanjikan kepada orang-orang yang beriman kepada Allah dan rasul-Nya serta beramal saleh, ampunan atas dosa-dosa mereka dan ganjaran yang besar, yaitu masuk Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Ketika Allah memerintahkan untuk bertakwa dan mendorong untuk bersikap adil, maka kemudian Allah menjelaskan balasan bagi orang-orang yang beriman. Yaitu dengan menyandingkan keimanan dan amal shalih, karena keduanya memiliki keterkaitan yang kuat; keimanan merupakan asas amal shalih sedangkan amal shalih merupakan buah dari keimanan. Barangsiapa yang dalam dirinya terdapat dua hal ini niscaya dia akan mendapatkan ampunan dan pahala yang besar. Ini merupakan janji yang benar dan pasti, dan tidak ada yang lebih agung dari pada keridhaan Allah dan surga-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9 Allah telah memberikan janji yang pasti dan baik kepada orang-orang yang beriman yang melakukan amal kebaikan dengan melakukan kewajiban dan melakukan ketaatan dengan mengampuni dosa-dosa mereka dan menganugerahkan pahala yang besar yaitu surga. Kemudian Allah memberi hukuman pada ayat setelahnya dengan menunjukkan keadaan orang-orang kafir untuk menjelaskan perbedaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menjanjikan kepada orang-orang yang beriman dan beramal shalih, bagi mereka ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Allah telah menjanjikan,” –dan Dia tidak mengingkari janjiNya, dan DIa adalah yang paling benar dalam berkata- kepada orang-orang yang beriman kepadaNya, kepada kitab-kitabNya, rasul-rasulNya, dan Hari Akhir, “dan melakukan amal shalih,” yang meliputi perkara-perkara yang wajib dan yang Sunnah, dengan ampunan dari dosa-dosa mereka dan maaf dariNya serta akibat-akibatnya dan menjanjikan pahala besar yang kebesarannya hanya diketahui oleh Allah. “Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang sebagai balasan bagi mereka, atas apa yang mereka kerjakan” (As-Sajdah:17)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 9: Yang wajib atau yang sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 9",
    "description": "Pada ayat ini Allah menjanjikan pahala bagi orang-orang yang beriman dan beramal saleh. Allah telah menjanjikan kepada orang-orang yang beriman dengan ucapan yang sesuai dengan isi hati mereka dan membuktikannya dengan beramal saleh bahwa mereka akan mendapat ampunan atas dosa-dosa mereka dan pahala yang besar berupa surga. Setelah itu, Allah menyatakan pembalasan yang akan ditimpakan kepada orang-orang kafir. Adapun orang-orang yang kafir yang menolak ajakan rasul dan mendustakan ayat-ayat kami yang disampaikan melalui rasul-rasul kami, mereka itulah yang akan menjadi penghuni neraka. Mereka kekal di dalamnya selama-lamanya."
  }
]