[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, sesungguhnya khamar, yaitu segala yang memabukkan dan menutup kesadaran akal, dan maisir, yaitu perjudian, yang mencakup seluruh jenis pertaruhan dan lainnya, yang di dalam prakteknya terdapat taruhan dari kedua belah pihak dan menghalangi dari mengingat Allah, dan anshab, yaitu batu yang dahulu kaum musyrikin melakukan penyembelihan di sisinya sebagai bentuk pengagungan terhadapnya, dan semua ditegakkan untuk diibadahi demi mendekatkan diri kepadanya, dan azlam, yaitu anak panah yang dahulu orang-orang kafir mengundi nasib mereka denganya, sebelum bergerak untuk melakukan sesuatu atau mengurungkan niat darinya; sesungguhnya semua itu merupakan perbuatan dosa dan tipu daya yang dibuat indah oleh setan. Maka jauhilah perbuatan-perbuatan dosa tersebut, mudah-mudahan kalian akan meraih keberuntungan dengan memperoleh surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Wahai orang-orang yang beriman! Sesungguhnya minuman keras yang memabukkan, judi yang mengandung imbalan dari kedua belah pihak, batu yang digunakan oleh orang-orang sebagai tempat menyembelih hewan ternak mereka untuk menghormatinya atau batu yang dipasang untuk disembah, dan batang-batang kayu yang mereka gunakan untuk mengundi nasib mereka, semua itu adalah perbuatan dosa yang dianjurkan oleh setan. Maka jauhilah perbuatan itu agar kalian memperoleh kehidupan yang mulia di dunia dan meraih kenikmatan surga di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Hai orang-orang yang beriman, sesungguhnya khamr -minuman yang memabukkan yang dapat menghilangkan akal- , maisir -taruhan harta yang dibayar oleh dua pihak atau yang biasa disebut dengan judi-, batu yang ditancapkan untuk disembah, Azlam -anak panah yang dipakai oleh orang-orang musyrik untuk mengundi dan mengambil keputusan ketika ingin melakukan sesuatu agar mereka mengetahui apakah mereka akan melakukannya atau tidak-; semua yang disebutkan itu merupakan dosa yang termasuk dari perbuatan setan, maka jauhilah itu semua. Penjelasan tentang pengundian nasib telah ada pada ayat 3 di surat ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ (sesungguhnya (meminum) khamar, berjudi) Tafsir dari kalimat ini telah dijelaskan dalam surat al-Baqarah:21. وَالْأَنصَابُ(berkorban untuk) berhala) Yakni patung-patung yang ditegakkan untuk disembah, atau batu yang dahulu mereka letakkan untuk menyembelih hewan sesembahan diatasnya. وَالْأَزْلٰمُ(mengundi nasib dengan panah) Tafsir dari kata ini telah dijelaskan di awal surat ini. رِجْسٌ(merupakan keburukan dan kekotoran) Yakni kotoran dan hal-hal yang menjijikkan. مِّنْ عَمَلِ الشَّيْطٰنِ(dari perbuatan syaitan) Yakni disebabkan ia menghiasi dan membaik-baikkan perbuatan tersebut. فَاجْتَنِبُوهُ (Maka jauhilah perbuatan-perbuatan itu) Allah menekankan pengharaman khamr dan judi dengan menyandingkan keduanya dengan peribadatan untuk berhala-berhala, dan menjadikan keduanya kotoran, yakni kotoran yang najis secara maknawi. Pendapaat lain mengatakan bahwa khamr juga termasuk barang najis secara hakiki, dan termasuk merupakan perbuatan setan yang tidak berbuat kecuali yang buruk. Allah juga memerintahkan untuk menjauhi perbuatan-perbuatan tersebut sehingga menjadi sebab untuk meraih kemenangan, serta Allah menyebutkan akibat buruk dari keduanya. Ibnu Umar berkata: Allah menurunkan tiga ayat dalam masalah khamr, dan yang pertama adalah (يسألونك عن الخمر والميسر...) al-Baqarah:219, maka dikatakan: Khamr telah diharamkan. Lalu dikatakan: Wahai Rasulullah, izinkanlah kami mengambil manfaat darinya, sebagaimana yang telah Allah sebutkan –dalam ayat tersebut –, maka Rasulullah membiarkan mereka. Kemudian turun ayat lain setelah itu (لا تقربوا الصلاة وأنتم سكارى...) an-Nisa’: 43, lalu Rasulullah bersabda: Khamr telah diharamkan. Maka para sahabat berkata: Wahai Rasulullah kami tidak akan meminumnya berdekatan dengan waktu shalat. Maka Rasulullah membiarkan mereka. Kemudian turun ayat lain (يا أيها الذين آمنوا إنما الخمر..), lalu Rasulullah bersabda: Khamr telah diharamkan. Ibnu Abbas berkata: segala jenis undian adalah termasuk judi, hingga permainan anak-anak dengan melempar biji kacang pohon ke suatu sasaran atau permainan catur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Wahai orang-orang yang beriman, sesungguhnya minuman yang memabukkan, berbagai jenis perjudian, berhala yang dipahat untuk disembah, dan mengundi nasib dengan anak panah (tongkat untuk perjudian) adalah najis dan keburukan yang kotor seperti bangkai. khamr, perbuatan kotor seperti perjudian, dan perbuatan lain yang disebutkan setelahnya di ayat ini, maka tinggalkanlah dan jauhilah sejauh-jauhnya. Hal ini menunjukkan suatu pengharaman dan menakut-nakuti agar tidak melakukannya, seperti perintah Al-Qur’an untuk menjauhi kesyirikan, menyembah berhala, dan bersaksi palsu, supaya kalian bisa memenangkan kebahagiaan dan ketenangan di dunia, dan memenangkan surga beserta kenikmatannya di akhirat. Ayat ini turun karena Sa’d bin Abi Waqash yang meminum khamr sebelum adanya pengharaman khamr, dan bertengkar dengan seorang laki-laki karena keduanya minum (khamr), atau karena ucapannya: “Orang-orang Muhajirin lebih baik daripada orang Anshar,” lalu temannya memukulnya menggunakan kulit kepala unta dan menyakiti hidungnya, kemudian turunlah ayat ini untuk keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman sesungguhnya khamr} minuman yang memabukkan {berjudi} perjudian {berhala} berhala-berhala yang disediakan untuk disembah {dan mengundi nasib dengan anak panah} anak panah yang mereka gunakan untuk menentukan nasib {adalah perbuatan keji} dosa dan kotor {termasuk perbuatan} godaan {setan. Maka jauhilah itu agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-91. Allah mencela hal-hal yang buruk ini. Dia menjelaskan bahwa semua itu termasuk perbuatan setan, bahwa ia adalah perbuatan buruk, “maka jauhilah perbuatan-perbuatan itu,” artinya, tinggalkanlah, “agar kamu mendapat keberuntungan.” Keberuntungan tidak diraih kecuali dengan meninggalkan apa yang dilarang oleh Allah, khususnya perbuatan-perbuatan buruk yang disebutkan disini. Ia adalah khamar yaitu semua yang merusak akal dengan menutupinya karena mabuk, judi; yaitu semua permainan yang memiliki bayaran (timbal balik) dari kedua belah pihak seperti taruhan dan semacamnya. Berhala, yaitu sesembahan dan tandingan dan semacamnya yang diangkat dan disembah selain Allah, dan anak panah yang dengannya mereka mengundi nasib. Allah melarang empat perkara ini, mencercanya, dan menjelaskan dampak negative yang menuntut untuk meninggalkannya: Di antaranya: Bahwa ia adalah rijsun, yakini, najis dan buruk secara maknawi walaupun bukan najis secara materi. Perkara- perkara yang kotor wajib di hindari agar tidak tercemar oleh kotorannya. Di antaranya: Ia termasuk perbuatan setan yang termasuk musuh manusia yang paling berbahaya, dan sudah di maklumi dan harus di waspadai, gerak-gerik gerakannya harus sudah di waspadai khususnya gerak-gerik yang bertujuan untuk menjerat musuhnya, karena padanya terdapat kebinasaan, maka harus dan harus menjauhi perbuatan musuh yang nyata, mewaspadainya, dan takut untuk terjebak ke dalamnya. Di dalamnya: Seorang hamba tidak dapat meraih keberuntungan kecuali menjauhinya, karena keberuntungan itu keberhasilan meraih kemenangan yang di cari dan yang dicintai dan keselamatan dari yang di takuti. Perkara-perkara ini adalah penghalang dan penghambat keberuntungan. Di antaranya: Perkara-perkara ini adalah pemicu permusuhan dan kebencian di antara manusia, dan setan itu rajin menghembuskannya khususnya melalui khamar dan judi, untuk menjerumuskan orang-orang Mukmin ke dalam permusuhan dan kebencian, karena khamar mengakibatkan terganggunya akal dan hilangnya daya kerja yang menyulut permusuhan antara dirinya dengan saudar-saudaranya yang Mukmin, lebih-lebih jika hal itu di iringi dengan sebab-sebab yang merupakan konsekuensi dari mabuk; bisa jadi sampai membunuh. Sementara judi, di mana salah satunya menyalahkan yang lain dan menyita hartanya yang banyak tampa imbalan apa pun adalah salah satu pemicu terbesar bagi permusuhan dan kebencian. Di antaranya: Perkara-perkara ini menghalangi hati dan di ikuti oleh badan dari berdzikir (mengingat) Allah dan shalat, yang mana seorang hamba di ciptakan untuk kedua ibadah tersebut dan dengan keduanyalah kebahagiaan dapat ia raih. Khamar dan judi menghalangi kadar itu dengan hal yang besar, membuat hati dan pikirannya sibuk dari keduannya sehingga waktu yang panjang berlalu, sementara dia tidak mengetahi dimana dia berada. Kemaksiatan apa lagi yang besar dan lebih buruk dari kemaksiatan yang mengotori pelakunya, menjadikannya orang yang buruk, menjerumuskannya ke dalam perbauatan setan dan jebekannya sehingga dia mengikutinya seperti binatang ternak yang menbgikiti pengembalannya. Dan menghalangi keberuntungan seorang hamba, menyulut kebencian dan permusuhan di antara orang-orang Mukmin yang menghalanginya dari dzikir kepada Allah dan dari shalat? Adakah dampak negatif yang lebih besar dari ini? Oleh karena itu Allah menawarkan laranganNya kepada orang-orang yang berakal, “Apakah kamu berhenti?” orang-orang yang berakal, jika dia melihat sebagian dampak negatifnya, niscaya dia akan menolaknya, menahan diri darinya tanpa memerlukan nasihat panjang dan hardikan yang mendalam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 90: Ibnu Jarir meriwayatkan dari Ibnu Abbas, ia berkata, \"Turun ayat pengharaman khamr (minuman keras) berkenaan dengan dua suku Anshar yang meminumnya, ketika mereka mabuk, maka satu sama lain saling bermain-main, saat mereka sadar, salah seorang di antara mereka melihat bekas pada muka dan janggutnya dan berkata, \"Saudaraku si fulan telah berbuat seperti ini kepadaku padahal mereka bersaudara dan tidak ada rasa dendam di antara mereka. Demi Allah, jika dia kasihan dan sayang kepadaku tentu dia tidak melakukan hal ini kepadaku.\" Sehingga timbullah dendam di hati mereka, maka Allah menurunkan ayat, \"Innamal khamru wal maisiru…sampai fahal antum muntahuun.\" Kemudian orang-orang yang membebani diri berkata, \"Ia (khamr) adalah kotor. Namun minuman itu ada dalam perut si fulan yang terbunuh pada perang Badar dan fulan yang terbunuh pada perang Uhud.\" Maka Allah menurunkan ayat, \"Laisa 'alalladziina aamanuu wa 'amilush shaalihaat junaahun fiimaa tha'imuu…dst.\" (Al Maa'idah: 93) Hadits ini diriwayatkan oleh Hakim dan Baihaqi. Haitsami dalam Majma'uzzawaa'id juz 7 hal. 18 berkata, \"Diriwayatkan oleh Thabrani dan para perawinya adalah para perawi kitab shahih.\" Adapun sanad Ibnu Jarir, maka para perawinya adalah para perawi kitab shahih selain Husain bin Ali Ash Shadaa'iy, ia adalah tsiqah. Minuman keras adalah minuman yang menghilangkan akal dan kesadaran, sehingga sikapnya tidak terkendali. Yakni taruhan, seperti perlombaan yang pesertanya mengeluarkan biaya, kemudian biaya itu akan diberikan kepada pemenang perlombaan. Keduanya, yakni minuman keras dan perjudian sangat rawan mengakibatkan permusuhan antara sesama saudara dan menimbulkan kebencian. Di samping itu, kedua perbuatan itu biasa membuat seseorang lupa dari dzikrullah dan lupa dari melaksanakan shalat, padahal untuk itulah manusia diciptakan. Lihat footnote surat Al Maa'idah: 3 tentang Azlaam. Yang menjadikannya indah. Karena keberuntungan tidaklah tercapai kecuali dengan meninggalkan apa yang diharamkan Allah, khususnya perkara keji yang disebutkan di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 90",
    "description": "Melalui ayat ini, Allah memerintahkan kaum mukmin untuk menjauhi perbuatan setan. Wahai orang-orang yang beriman kepada Allah, kitab-Nya, dan rasul-Nya! sesungguhnya minuman keras, apa pun jenisnya, sedikit atau banyak, memabukkan atau tidak memabukkan; berjudi, bagaimana pun bentuknya; berkurban untuk berhala, termasuk sesajen, sedekah laut, dan berbagai persembahan lainnya kepada makhluk halus; dan mengundi nasib dengan anak panah atau dengan cara apa saja sesuai dengan budaya setempat, adalah perbuatan keji karena bertentangan dengan akal sehat dan nurani serta berdampak buruk bagi kehidupan pribadi dan sosial; dan termasuk perbuatan setan yang diharamkan Allah. Maka jauhilah perbuatan-perbuatan itu dalam kehidupan pribadi dan kehidupan sosial dengan peraturan yang tegas dan hukuman yang berat agar kamu beruntung dan sejahtera lahir batin dalam kehidupan dunia dan terhindar dari azab Allah di akhirat Allah menegaskan bahwa setan itu bertujuan menciptakan permusuhan dan kebencian di antara manusia. Dengan membujuk kamu meneguk minuman keras dan mendorong kamu mencoba-coba berjudi, setan hanyalah bermaksud dengan sangat cerdik menimbulkan permusuhan akibat kamu dipengaruhi minuman keras dan kecanduan judi. Minuman keras dan judi juga menimbulkan kebencian antara kamu dengan anak, istri, saudara, tetangga, dan teman-temanmu. Di samping itu, minuman keras dan judi itu menghalang-halangi kamu dari mengingat Allah dan melaksanakan salat, karena pikiranmu menjadi kusut, hatimu menjadi kusam, dan jiwamu menjadi kotor; maka tidakkah kamu mau berpikir jernih dan sadar, serta bertekad untuk berhenti dari kebiasaan meneguk minuman keras dan berjudi itu'"
  }
]