[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya setan hanyalah menghendaki melalai memperindah perbuatan-perbuatan dosa bagi kalian itu untuk melontarkan di tengah kalian perkara-perkara yang menyebabkan permusuhan dan kebencian, disebabkan meminum khamar dan bermain judi, dan ia hendak memalingkan kalian dari mengingat Allah dan shalat dengan hilangnya akal sehat saat meminum khamar dan sibuk dalam kesia-siaan dalam permainan judi. Maka berhentilah kalian darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Sesungguhnya tujuan setan menganjurkan minuman keras dan perjudian ialah memunculkan rasa permusuhan dan kebencian dalam hati antarsesama dan memalingkan orang dari zikir maupun salat. Apakah kalian -wahai orang-orang mukmin- sudah meninggalkan perbuatan-perbuatan dosa tersebut? Tidak ada keraguan bahwa hal itulah yang lebih pantas bagi kalian. Maka berhentilah dari perbuatan-perbuatan dosa tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Tujuan langkah-langkah setan dalam mengajak untuk meminum minuman keras dan berjudi telah tersingkap, yaitu sebagai tipu daya agar terjadi permusuhan, pertikaian, kedengkian, dan kebencian di antara kaum muslimin. Dosa-dosa ini menimbulkan efek negatif bagi manusia; khamr dapat menghilangkan akal sehingga menyebabkan halusinasi dan pertikaian. Sedangkan perjudian dapat menimbulkan kedengkian dan kebencian. Efek negatif lainnya adalah menyebabkan terhalangi dari mengingat Allah dan salat, akibat akal dan kesadaran yang hilang. Maka hendaklah kalian menjauhi itu semua. Kerusakan-kerusakan yang nampak akibat khamr dan perjudian seharusnya cukup untuk menyadarkan manusia agar berhenti melakukannya. Oleh sebab itu, Allah menjelaskan hal ini dengan ungkapan yang mengandung keagungan dan keelokan yang berisi larangan tegas dengan cara yang bijaksana agar mendorong mereka untuk segera melaksanakan perintah-Nya. Sehingga diriwayatkan dari Umar bahwa ketika dia mendengar ayat ini, dia segera berkata: \"kami akan meninggalkannya! Kami akan meninggalkannya!\" Ayat ini hanya menyebutkan kerusakan-kerusakan yang disebabkan oleh khamr dan perjudian, tanpa menyebutkan kerusakan-kerusakan yang ditimbulkan dari penyembahan batu berhala dan pengundian nasib, karena kaum muslimin telah berikrar dalam ayat yang telah lalu untuk meninggalkan dua perbuatan ini, ketika mereka memutuskan untuk masuk Islam, dan karena dua perbuatan ini merupakan sisa dari keyakinan keyakinan syirik yang tidak memberikan kenikmatan bagi jiwa yang dapat mendorong untuk melanggar syariat; tidak seperti yang ada pada khamr dan perjudian yang dapat memberi kenikmatan jiwa yang dapat memberi dorongan untuk melakukan pelanggaran syariat. Oleh sebab itu Allah lebih menegaskan pelarangan pada khamr dan perjudian daripada pelarangan penyembahan berhala dan pengundian nasib. Kemudian Allah mengulangi ajakan untuk meninggalkan perbuatan ini dengan bentuk ungkapan pertanyaan: \"Maka apakah kalian akan berhenti melakukannya?\" Pertanyaan ini merupakan sindiran yang dimaksudkan sebagai perintah, yakni: \"Berhentilah\". Dan ini adalah ungkapan larangan yang sangat tegas untuk memberitahukan bahwa pemerintah dan peringatan untuk meninggalkan perbuatan ini telah sampai pada titik yang paling jauh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. إِنَّمَا يُرِيدُ الشَّيْطٰنُ أَن يُوقِعَ بَيْنَكُمُ الْعَدٰوَةَ وَالْبَغْضَآءَ (Sesungguhnya syaitan itu bermaksud hendak menimbulkan permusuhan dan kebencian di antara kamu) Ini merupakan akibat buruk keduniaan dari khamr dan perjudian. Dan yang termasuk akibat buruk terhadap akhirat adalah keduanya menghalangi kalian dari mengingat Allah dan mengerjakan shalat. فَهَلْ أَنتُم مُّنتَهُونَ (maka berhentilah kamu (dari mengerjakan pekerjaan itu)) Yakni apakah kalian akan meninggalkannya sama sekali? Umar bin Khattab ketika mendengar ayat ini berkata: kami telah berhenti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Sesungguhnya melalui godaannya untuk melakukan kemungkaran ini, setan ingin meletakkan permusuhan dan kebencian di antara kalian dengan meminum khamr dan berjudi karena keduanya adalah sumber keburukan di dunia, dan keduanya itu mengandung kerusakan dalam urusan agama, yaitu menghalangi untuk ingat kepada Allah dan shalat fardhu karena hilangnya agama dan harta dunia kalian. Maka apakah kalian akan meninggalkan hal tersebut sampai akhir waktu? Umar dan sahabat lainnya berkata: “Kami benar-benar berhenti, wahai Tuhan” lalu mereka membuang khamr itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya setan hanya bermaksud} ingin {menimbulkan permusuhan dan kebencian di antara kalian melalui khamr dan judi serta menghalangi kalian dari mengingat Allah dan shalat, maka tidakkah kalian berhenti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-91. Allah mencela hal-hal yang buruk ini. Dia menjelaskan bahwa semua itu termasuk perbuatan setan, bahwa ia adalah perbuatan buruk, “maka jauhilah perbuatan-perbuatan itu,” artinya, tinggalkanlah, “agar kamu mendapat keberuntungan.” Keberuntungan tidak diraih kecuali dengan meninggalkan apa yang dilarang oleh Allah, khususnya perbuatan-perbuatan buruk yang disebutkan disini. Ia adalah khamar yaitu semua yang merusak akal dengan menutupinya karena mabuk, judi; yaitu semua permainan yang memiliki bayaran (timbal balik) dari kedua belah pihak seperti taruhan dan semacamnya. Berhala, yaitu sesembahan dan tandingan dan semacamnya yang diangkat dan disembah selain Allah, dan anak panah yang dengannya mereka mengundi nasib. Allah melarang empat perkara ini, mencercanya, dan menjelaskan dampak negative yang menuntut untuk meninggalkannya: Di antaranya: Bahwa ia adalah rijsun, yakini, najis dan buruk secara maknawi walaupun bukan najis secara materi. Perkara- perkara yang kotor wajib di hindari agar tidak tercemar oleh kotorannya. Di antaranya: Ia termasuk perbuatan setan yang termasuk musuh manusia yang paling berbahaya, dan sudah di maklumi dan harus di waspadai, gerak-gerik gerakannya harus sudah di waspadai khususnya gerak-gerik yang bertujuan untuk menjerat musuhnya, karena padanya terdapat kebinasaan, maka harus dan harus menjauhi perbuatan musuh yang nyata, mewaspadainya, dan takut untuk terjebak ke dalamnya. Di dalamnya: Seorang hamba tidak dapat meraih keberuntungan kecuali menjauhinya, karena keberuntungan itu keberhasilan meraih kemenangan yang di cari dan yang dicintai dan keselamatan dari yang di takuti. Perkara-perkara ini adalah penghalang dan penghambat keberuntungan. Di antaranya: Perkara-perkara ini adalah pemicu permusuhan dan kebencian di antara manusia, dan setan itu rajin menghembuskannya khususnya melalui khamar dan judi, untuk menjerumuskan orang-orang Mukmin ke dalam permusuhan dan kebencian, karena khamar mengakibatkan terganggunya akal dan hilangnya daya kerja yang menyulut permusuhan antara dirinya dengan saudar-saudaranya yang Mukmin, lebih-lebih jika hal itu di iringi dengan sebab-sebab yang merupakan konsekuensi dari mabuk; bisa jadi sampai membunuh. Sementara judi, di mana salah satunya menyalahkan yang lain dan menyita hartanya yang banyak tampa imbalan apa pun adalah salah satu pemicu terbesar bagi permusuhan dan kebencian. Di antaranya: Perkara-perkara ini menghalangi hati dan di ikuti oleh badan dari berdzikir (mengingat) Allah dan shalat, yang mana seorang hamba di ciptakan untuk kedua ibadah tersebut dan dengan keduanyalah kebahagiaan dapat ia raih. Khamar dan judi menghalangi kadar itu dengan hal yang besar, membuat hati dan pikirannya sibuk dari keduannya sehingga waktu yang panjang berlalu, sementara dia tidak mengetahi dimana dia berada. Kemaksiatan apa lagi yang besar dan lebih buruk dari kemaksiatan yang mengotori pelakunya, menjadikannya orang yang buruk, menjerumuskannya ke dalam perbauatan setan dan jebekannya sehingga dia mengikutinya seperti binatang ternak yang menbgikiti pengembalannya. Dan menghalangi keberuntungan seorang hamba, menyulut kebencian dan permusuhan di antara orang-orang Mukmin yang menghalanginya dari dzikir kepada Allah dan dari shalat? Adakah dampak negatif yang lebih besar dari ini? Oleh karena itu Allah menawarkan laranganNya kepada orang-orang yang berakal, “Apakah kamu berhenti?” orang-orang yang berakal, jika dia melihat sebagian dampak negatifnya, niscaya dia akan menolaknya, menahan diri darinya tanpa memerlukan nasihat panjang dan hardikan yang mendalam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 91: Dibicarakan secara terpisah melaksanakan shalat, menunjukkan tingginya kedudukan shalat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 91",
    "description": "Allah menegaskan bahwa setan itu bertujuan menciptakan permusuhan dan kebencian di antara manusia. Dengan membujuk kamu meneguk minuman keras dan mendorong kamu mencoba-coba berjudi, setan hanyalah bermaksud dengan sangat cerdik menimbulkan permusuhan akibat kamu dipengaruhi minuman keras dan kecanduan judi. Minuman keras dan judi juga menimbulkan kebencian antara kamu dengan anak, istri, saudara, tetangga, dan teman-temanmu. Di samping itu, minuman keras dan judi itu menghalang-halangi kamu dari mengingat Allah dan melaksanakan salat, karena pikiranmu menjadi kusut, hatimu menjadi kusam, dan jiwamu menjadi kotor; maka tidakkah kamu mau berpikir jernih dan sadar, serta bertekad untuk berhenti dari kebiasaan meneguk minuman keras dan berjudi itu' Allah memerintahkan orang-orang beriman untuk menaati Allah dan rasul-Nya dengan tulus, serta berhati-hati menghadapi godaan setan. Dan taatlah kamu kepada Allah dengan melaksanakan segala perintah-Nya dengan ikhlas dan penuh kesadaran; dan taatlah kamu kepada rasul dengan memelihara sunnahnya secara istikamah; serta berhati-hatilah dalam segala hal dari bujukan hawa nafsu dan bisikan setan. Jika kamu berpaling dari agama Allah dan ajaran rasul-Nya, maka ketahuilah dengan penuh kesadaran bahwa kewajiban rasul kami hanyalah menyampaikan ajaran Allah dengan jelas kepada kamu, bukan menjadikan kamu beriman dan taat kepada Allah dan rasul-Nya."
  }
]