[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Laksanakanlah oleh kalian (wahai kaum Muslimin) ketaatan terhadap Allah dan ketaatan kepada rasulNya, Muhammad , dalam seluruh perkara yang kalian lakukan dan tinggalkan, dan bertakwalah kepada Allah dan sadarlah bahwa Dia mengawasi kalian dalam menjalankannya. Apabila kalian berpaling dari melaksankannya, lalu melakukan perkara yang kalian dilarang darinya, maka ketahuilah oleh kalian bahwa sesungguhnya kewajiban rasul kami Muhammad hanyalah menyampaikan (risalah) dengan nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Patuhlah kalian kepada Allah dan kepada rasul dengan melaksanakan perintah-perintah syariat dan menjauhi larangan-larangan-Nya. Dan jangan sekali-kali kalian melanggarnya, sebab jika kalian berpaling dari syariat itu maka ketahuilah bahwa tugas rasul Kami hanyalah menyampaikan apa yang Allah perintahkan untuk disampaikan. Dan beliau benar-benar telah menyampaikannya. Maka jika kalian mengikuti jalan yang benar niscaya manfaatnya akan kembali kepada diri kalian sendiri. Dan jika kalian berlaku buruk niscaya akibat buruknya akan menimpa diri kalian sendiri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Hai orang-orang yang beriman, maka tetaplah kalian taat kepada Allah dan taat kepada rasulnya, karena itu merupakan kejayaan dan kemenangan bagi kalian, dan berhati-hatilah dari orang yang bermaksiat dan menyelisihi Allah. Jika kalian tidak melakukan itu dan berpaling dari jalan Tuhan kalian dan dari ketaatan rasul-Nya, maka sesungguhnya kewajiban Rasul Kami hanyalah menyampaikan risalah dengan jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَاحْذَرُوا۟ ۚ (dan berhati-hatilah) Yakni berhati-hatilah dari menyelisihi Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Taatilah perintah Allah dan rasulNya dengan menjauhi khamr, perjudian dan hal-hal haram lainnya, dan jangan sampai kalian menentang Allah dan rasulNya. Jika kalian tidak mau taat, maka sesungguhnya tugas nabi hanya menyampaikan (risalah Allah) dengan terang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Taatlah kepada Allah dan taatlah kepada Rasul serta berhati-hatilah} jangan sampai mengingkari keduanya {Jika kalian berpaling} berpaling dari melakukan perintah {maka ketahuilah bahwa kewajiban Rasul Kami hanyalah penyampai yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. Ketaatan kepada Allah dan ketaatan kepada Rasul adalah satu. Barangsiapa yang menaati Allah, maka dia menaati Rasul, dan barangsiapa yang menaati Rasul, maka dia menaati Allah, dan itu meliputi pelaksanaan apa-apa yang di perintahkan oleh Allah dan Rasulnya berupaperbuatan-perbuatan dan perkataan-perkataan, lahir dan batin, yang wajib dan Sunnah yang berkaitan dengan hak Allah dan hak manusia, juga dengan meninggalkan apa-apa yang dilarang oleh Allah dan RasulNya. Perintah ini adalah perintah paling umum, karena seperti yang Anda lihat, termasuk di dalamnya seluruh perintah dan larangan lahir dan batin. FirmanNya, “ Dan berhati-hatilah” melakukan kemaksiatan kepada Allah dan kepada RasulNya, karena hal itu mengandung hal buruk dan kerugian yang nyata. “jika kamu berpaling” dari apa-apa yang diperintahkan dan yang dilarang kepadaMu, “ maka ketahuilah bahwa sesungguhnya kewajiban Raasul kami, hanyalah menyampaikan amanat Allah dengan terang.” Dan dia telah melaksanakan hal itu. Jika kamu mendapatkan petunjuk, maka kebaikannya adalah untuk dirimu, sebaliknya jika kamu berbuat buruk, maka dosanya adalah tanggung jawabmu dan Allah-lah yang akan menghisabmu sementara Rasulullah telah menunaikan tugasnya dan kewajibannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 92: Terhadap maksiat kepada Allah dan Rasul-Nya. Dari ketaatan. Beliau telah menyampaikan tugasnya, jika kita mengikutinya, maka yang demikian untuk kebaikan diri kita, sedangkan jika kita tidak mengikutinya, maka tidak ada yang dirugikan selain diri kita, dan Allah Subhaanahu wa Ta'aala akan menghisab sikap kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 92",
    "description": "Allah memerintahkan orang-orang beriman untuk menaati Allah dan rasul-Nya dengan tulus, serta berhati-hati menghadapi godaan setan. Dan taatlah kamu kepada Allah dengan melaksanakan segala perintah-Nya dengan ikhlas dan penuh kesadaran; dan taatlah kamu kepada rasul dengan memelihara sunnahnya secara istikamah; serta berhati-hatilah dalam segala hal dari bujukan hawa nafsu dan bisikan setan. Jika kamu berpaling dari agama Allah dan ajaran rasul-Nya, maka ketahuilah dengan penuh kesadaran bahwa kewajiban rasul kami hanyalah menyampaikan ajaran Allah dengan jelas kepada kamu, bukan menjadikan kamu beriman dan taat kepada Allah dan rasul-Nya Allah tidak mempermasalahkan apa yang pernah dimakan dan diminum oleh kaum mukmin sebelum mereka beriman. Tidak berdosa bagi orang-orang yang beriman kepada Allah dan rasul-Nya dan mengerjakan amal-amal saleh, baik kesalehan secara individu maupun sosial, tentang apa yang mereka makan atau minum dahulu pada masa jahiliah seperti minuman keras, apabila mereka bertakwa, takut kepada Allah dan menjauhi larangan-Nya, dan beriman kepada Allah dan rasul-Nya, serta mengerjakan amal saleh, kemudian mereka tetap bertakwa kepada Allah dalam segala keadaan dan beriman kepada Allah dengan memelihara keimanannya. Selanjutnya mereka tetap juga bertakwa dengan mantap dan berbuat kebajikan yang bermanfaat bagi manusia dan kemanusiaan. Dan Allah menyukai orang-orang yang berbuat kebajikan, baik dengan harta maupun tenaga dengan ikhlas semata mengharap keridaan Allah. Ayat ini kemudian di-mansukh atau dihapuskan masa berlakunya oleh surah al-ma'idah ayat 90 yang secara tegas mengharamkan minuman keras."
  }
]