[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada tanggungan dosa atas orang-orang Mukmin yang pernah meminum khamar sebelum diharamkan, bila mereka telah meninggalkannya dan takut akan kemurkaan Allah dan beriman kepadaNYa, dan mempersembahkan amal-amal shalih yang menunjukan keimanan mereka dan keinginan mereka terhadap keridahaan Allah terhadap diri mereka, kemudian mereka semakin bertambah rasa di saksikan Allah dan keimanan mereka dengan itu, sehingga mereka dengan dasar keyakinan kuat mereka menjadi beribadah kepada Allah dan seolah-olah mereka melihatNya. Dan sesungguhnya Allah mencintai orang-orang yang telah mencapai dejarat ihsan,sehingga keimanan mereka terhadap perkara ghaib sama seperti penglihatan mereka terhadap perkara yang terlihat nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Tidak ada dosa bagi orang-orang yang beriman kepada Allah dan mengerjakan amal saleh dalam rangka mendekatkan diri kepada Allah atas perbuatan mereka mengonsumsi khamar sebelum diharamkan, apabila mereka menjauhi hal-hal yang dilarangan karena takut akan murka Allah disertai dengan keimanan kepada-Nya dan amal saleh. Kemudian perasaan mereka yang merasa diawasi oleh Allah semakin menguat, sehingga mereka beribadah kepada-Nya seolah-olah mereka melihat-Nya. Dan Allah menyukai orang-orang yang beribadah kepada-Nya seolah-olah mereka melihat-Nya. Karena sikap itu menandakan adanya perasaan selalu diawasi oleh Allah. Dan hal itu akan mendorong orang yang beriman untuk melaksanakan tugasnya dengan baik dan sempurna."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Terdapat sahabat Rasulullah yang dulu meminum khamr kemudian meninggal sebelum turunnya ayat yang menjelaskan keharamannya. Mereka tidak akan disiksa jika mereka telah bertakwa kepada Allah dengan menjauhi hal-hal yang diharamkan, beriman kepadanya, dan memiliki amalan-amalan soleh yang telah mereka kerjakan; kemudian mereka bertakwa kepada Allah dan merasakan pengawasan nya pada saat sendiri maupun dalam keramaian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. فِيمَا طَعِمُوٓا۟ (atas apa yang telah mereka makan dahulu) Yakni makanan-makanan yang mereka sukai. إِذَا مَا اتَّقَوا۟ (apabila mereka bertakwa) Yakni jauhilah apa yang diharamkan atas mereka seperti khamr dan lainnya. وَعَمِلُوا۟ الصّٰلِحٰتِ (dan mengerjakan amalan-amalan yang saleh) Dari amal-amal shaleh yang ada. ثُمَّ اتَّقَوا۟( kemudian mereka tetap bertakwa) Yakni jauhilah apa yang diharamkan atas mereka setelah itu, karena sebelumnya hal itu dibolehkan bagi mereka. وَّءَامَنُوا۟( dan beriman) Yakni beriman pada pengharamannya. ثُمَّ اتَّقَوا۟( kemudian mereka (tetap juga) bertakwa) Yakni jauhilah apa yang diharamkan atas mereka setelah itu, karena sebelumnya hal itu dibolehkan bagi mereka. وَّأَحْسَنُوا۟ ۗ( dan berbuat kebajikan) Yakni berbuatlah perbuatan baik. Sebab turunnya ayat ini adalah ketika telah turun ayat yang mengharamkan khamr, berkatalah sebagian sahabat: bagaimana nasib orang yang telah meninggal dunia diantara kita, sedangkan ia dulu semasa hidupnya meminum khamr dan memakan hasil perjudian, lalu ia meninggal dan dalam perut mereka terdapat khamr dan hasil judi? Maka Allah menjawab mereka bahwa orang-orang tersebut meninggal sebelum keduanya diharamkan maka mereka tidak mendapatkan dosa saat meminumnya, dan mereka adalah orang-orang yang bertakwa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Syaikh as-Sya'dy mengatakan : aku mempelajari dari pengulangan lafazh taqwa sebanyak tiga kali dalam ayat ini, maka aku menyimpulkan dua hal penting : Pertama : Bahwa lafazh taqwa yang pertama untuk yang lampau dan yang kedua untuk saat ini dan yang ketiga untuk masa yang akan datang. Kedua : Bahwasanya lafazh taqwa yang pertama pada kedudukan islam dan yang kedua pada kedudukan iman dan yang ketiga pada kedudukan ihsan : Dan sesungguhnya seorang mukmin tidak akan lengkap ketaqwaannya sampai ia meninggalkan apa-apa yang diharamkan oleh Allah, dan tidak pula agamanya akan sempurna kecuali dengan tiga perkara ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Tidaklah bagi orang-orang mukmin yang beramal shalih seperti jihad di jalan Allah itu suatu dosa dalam memakan makanan yang mereka inginkan, yaitu mereka telah makan atau minum (khamr), yaitu mereka meminum khamr sebelum diharamkan, jika mereka takut pada kesyirikan dan barang-barang haram setelah adanya pengharaman seperti khamr dan hal lainnya, beriman kepada Allah, rasulullah dan Al-Qur’an, dan mengerjakan amal shalih yang diridhai Allah, kemudian mereka tetap mewaspadai apa yang telah diharamkan, tetap bertakwa, mempercayai pengharaman itu dan menambah keimanannya kepada Allah, kemudian menjauhi barang-barang haram berupa dosa kecil maupun dosa lainnya, serta memperbaiki dan meneguhkan amalnya. Dan Allah itu meridhai orang-orang yang baik amalnya dan membalas mereka dengan pahala yang mulia. Al-Bara’ bin ‘Azib berkata: “Sebagian sahabat meninggal dan mereka meminum khamr. Ketika khamr itu diharamkan, orang-orang berkata: “Bagaimana nasib para sahabat kami, mereka mati dan meminum khamr?” Lalu turunlah ayat ini {Laisa ‘Alalladziina aamanuu …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada bagi orang-orang yang beriman dan mengerjakan amal shalih suatu dosa} kesalahan dan dosa {menyangkut sesuatu yang telah mereka makan} sesuatu yang mereka konsumsi berupa makanan dan minuman {apabila mereka bertakwa} menjauhi sesuatu yang diharamkan {dan beriman, serta mengerjakan amal shalih, kemudian mereka bertakwa dan beriman, selanjutnya mereka (tetap) bertakwa dan berbuat kebaikan. Allah menyukai orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Manakala pengharaman khamar, larangan yang keras terhadapnya dan penegasan padanya diturunkan, ada beberapa orang Mukmin yang berkeinginan untuk mengetahui keadaan saudara-saudaranya yang sudah mati sebelum di haramkannya khamar sementara mereka telah meminumnya, maka Allah menurunkan ayat ini, Dia memberitahukan bahwa “ tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan yang shalih.” Maksudnya tidak ancaman dan azab, “karena memakan makanan yang telah mereka makan dahulu,” berupa khamar dan judi, sebelum keduanya di haramkan. Ketika ditiadakannya dosa ini meliputi apa-apa yang di sebut tadi dan juga selainnya, maka hal itu di beri batasan dengan FirmanNya, “ apabila mereka bertakwa serta beriman, dan mengerjakan amalan-amalan yang shalih.” Maksudnya, dengan syarat mereka meninggalkan kemaksiatan, beriman kepada Allah dengan iman yang benar yang mengharuskan mereka melakukan perbuatan baik, kemudian mereka terus-menerus di atas itu. Jika tidak, maka bisa jadi seorang hamba memiliki kriteria tersebut, tetapi hanya dalam beberapa waktu saja. Ini tidak cukup sebelum Dia malakukannya sampai ajal datang kepadaNya, dia terus menerus di atas kebaikan. Karena Allah menyukai orang-orang yang berbuat baik dalam beribadah kepada Allah dan dalam memberi manfaat kepada makhluk. Termasuk dalam ayat ini adalah orang yang memakan harta haram dan selainnya setelah pengharaman, lalu dia mengakui dosannya dan bertaubat kepada Allah, dan beramal shalih, maka Allah mengampuninya dan dosanya terangkat karenanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 93: Ketika turun ayat yang melarang minuman keras, sebagian sahabat Nabi shallallahu 'alaihi wa sallam ingin mengetahui keadaan saudara-saudaranya yang meninggal dalam keadaan muslim sebelum diharamkan minuman keras, di mana ketika itu mereka meminumnya, maka Allah Ta'ala menurunkan ayat di atas. Yaitu makanan dari hasil perjudian dan meminum minuman keras sebelum adanya larangan. Menjauhi hal-hal yang dilarang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 93",
    "description": "Allah tidak mempermasalahkan apa yang pernah dimakan dan diminum oleh kaum mukmin sebelum mereka beriman. Tidak berdosa bagi orang-orang yang beriman kepada Allah dan rasul-Nya dan mengerjakan amal-amal saleh, baik kesalehan secara individu maupun sosial, tentang apa yang mereka makan atau minum dahulu pada masa jahiliah seperti minuman keras, apabila mereka bertakwa, takut kepada Allah dan menjauhi larangan-Nya, dan beriman kepada Allah dan rasul-Nya, serta mengerjakan amal saleh, kemudian mereka tetap bertakwa kepada Allah dalam segala keadaan dan beriman kepada Allah dengan memelihara keimanannya. Selanjutnya mereka tetap juga bertakwa dengan mantap dan berbuat kebajikan yang bermanfaat bagi manusia dan kemanusiaan. Dan Allah menyukai orang-orang yang berbuat kebajikan, baik dengan harta maupun tenaga dengan ikhlas semata mengharap keridaan Allah. Ayat ini kemudian di-mansukh atau dihapuskan masa berlakunya oleh surah al-ma'idah ayat 90 yang secara tegas mengharamkan minuman kerasayat ini menjelaskan tentang ujian yang akan diberikan Allah kepada orang-orang yang sedang berihram untuk haji atau umrah. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! Allah pasti akan menguji kamu pada waktu kamu sedang berihram untuk haji atau umrah dengan diharamkan membunuh hewan buruan yang hidup di tanah haram yang dengan mudah kamu peroleh dengan tangan dan tombakmu, karena banyak dan jinak. Hal ini bertujuan agar Allah mengetahui di antara kamu yang sedang berhaji dan umrah siapa yang benar-benar takut kepada-Nya dengan konsisten menjauhi larangan berihram, meskipun dia tidak melihat-Nya. Barang siapa melampaui batas kewajaran dalam berburu hewan setelah selesai melaksanakan haji dan umrah dalam berburu hewan di tanah haram, maka dia akan mendapat azab yang pedih di akhirat dengan dimasukkan ke dalam neraka."
  }
]