[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah danrasulNya,serta melaksanakan syariatNya, janganlah kalian membunuh binatang buruan darat, sedangkan kalian tengah berada dalam keadaan ihram dengan haji atau umrah. Atau kalian sedang berada di tanah haram. Dan barangsiapa membunuh jenis apa saja dari binatang buruan darat dengan sengaja, maka dendanya adalah menyembelih binatang ternak yang sepadan dengan buruan, seperti unta,sapi,dan kambing, setelah ada dua orang adil yang memutuskan perkiraan nilainya dan kemudian menghadiahkannya bagi fakir miskin di tanah haram, atau hendaknya dia membeli makanan yang setara dengan harganya, yang dia hadiahkan bagi kaum fakir miskin di tanah haram, untuk setiap fakir miskin setengah sho, atau sebagi gantinya dia berpuasa dengan hitiungan sehari puasa untuk menganti tiap setengah sha dari makanan yang dihadiahkan. Allah mewajibkan denda ini atas dirinya, agar dengan kewajiban membayar denda yang disebutkan itu, orang yang bersangkuatan akan merasakan akibat dari perbuatannya. Dan orang-orang yang terjerumus dalam satu jenis dari perbuatan tersebut sebelum datang pengharamannya, maka sesungguhnya Allah telah memafkan mereka. Dan barangasiapa kembali melakukan pelanggaran dengan sengaja setelah datangnya ketetapan pengharamannya, sesungguhnya dia telah terancam dengan pembalasan Allah terhadap dirinya. Dan Allah Maha perkasa, Maha kuat lagi kokoh dalam kekuaasaanNya. Dan diantara bukti sifat keperkasaanNya, bahwasannya Dia akan membalas orang-orang yang berbuat maksiat kepadaNya bila Dia menghendaki, tidak ada yang dapat menghalangiNya dari pembalasan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Wahai orang-orang yang beriman! Janganlah kalian membunuh hewan buruan darat ketika kalian sedang berihram untuk haji atau umrah. Barangsiapa yang membunuh hewan buruan darat itu secara sengaja, ia harus menggantinya dengan hewan ternak yang setara dengannya seperti unta, sapi, atau kambing. Hewan pengganti itu harus diputuskan oleh dua orang muslim yang adil. Hewan pengganti yang telah diputuskan itu harus diperlakukan sebagaimana perlakuan terhadap hewan hadyu. Yaitu harus dikirim ke Makkah dan disembelih di tanah haram. Atau diganti dengan bahan makanan yang senilai dengan hewan itu dan dibagikan kepada orang-orang miskin yang ada di tanah haram. Setiap orang mendapatkan setengah ṣā’ (sekitar satu setengah kilogram). Atau diganti dengan puasa satu hari untuk tiap-tiap setengah ṣā’ dari bahan makanan. Semua itu ditujukan agar orang yang membunuh hewan buruan itu merasakan akibat perbuatannya membunuh hewan buruan tersebut. Allah mengampuni apa yang terjadi di masa lalu terkait pembunuhan hewan buruan di tanah haram dan pembunuhan hewan buruan darat oleh orang yang sedang berihram. Barangsiapa yang mengulanginya setelah ada pengharaman atas hal itu maka Allah akan membalasnya dengan adzab yang pedih. Dan Allah Mahakuat lagi Maha Perkasa. Salah satu bukti kekuatan-Nya ialah Dia kuasa menghukum siapa saja yang durhaka kepada-Nya jika Dia menghendakinya. Tidak ada sesuatu pun yang dapat menghalangi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Hai orang-orang yang beriman, janganlah kalian membunuh hewan buruan ketika sedang melakukan ihram haji, umrah, atau keduanya. Dan jika kalian tidak sedang melakukan ihram maka janganlah kalian membunuh hewan buruan ketika kalian berada di tanah suci karena Allah telah melarang perburuan hewan dan pengambilan harta temuan yang ada dalam batas-batas wilayah tanah suci sebagai bentuk penghormatan baginya. Barangsiapa yang melanggar larangan dengan membunuh hewan buruan, maka hukumannya adalah mengganti dengan hewan yang serupa -yaitu dengan memperkirakan hewan yang dibunuh itu seperti apa, kemudian menggantinya dengan hewan yang serupa dari hewan yang dapat disembelih, baik itu unta, sapi, atau kambing-. Yang dimaksud dengan keserupaan di sini adalah dari sisi bentuknya, yang ditentukan oleh dua orang yang adil dengan memperkirakan hewan yang dibunuh itu menyerupai hewan ternak apa dari sisi besar dan kecilnya. Dan barangsiapa yang berkewajiban menunaikan hal ini maka wajib baginya menjadikan hewan ini sebagai hadyu yang digiring ke kota Makkah untuk dibagikan sebagai makanan bagi orang-orang miskin yang ada di sana; atau dengan membeli makanan untuk disedekahkan sesuai dengan harga hewan yang harus dibayarkan; atau dengan berpuasa sebagai ganti menyedekahkan makanan, yaitu setiap takaran setengah sha' harus dia ganti dengan sehari puasa. Kemudian Allah menyebutkan sebab hukuman ini, yaitu agar orang yang membunuh hewan buruan itu merasakan besarnya perbuatan yang dia lakukan, mengetahui akibat buruknya, dan menyadari bahwa dia telah menodai kehormatan ihram. Allah telah mengampuni perbuatan ini yang dilakukan sebelum pengharamannya; namun Barang siapa yang kembali melanggar larangan ini dengan sengaja, maka Allah akan menghukumnya atas kemaksiatan tersebut. Allah Maha Perkasa dan Maha Kuat untuk membalas orang yang menyelisihi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. لَا تَقْتُلُوا۟ الصَّيْدَ وَأَنتُمْ حُرُمٌ ۚ (janganlah kamu membunuh binatang buruan) Yakni dalam keadaan beihram. وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدًا (Barangsiapa di antara kamu membunuhnya dengan sengaja) Maka tidak ada kaffarat bagi orang yang tidak sengaja melakukannya. Namun pendapat lain mengatakan: diwajibkan juga baginya untuk membayar kaffarat. فَجَزَآءٌ مِّثْلُ مَا قَتَلَ (maka dendanya ialah mengganti yang seimbang dengan buruan yang dibunuhnya) Yakni dendanya adalah sesuai dengan apa yang ia bunuh. مِنَ النَّعَمِ (dari binatang ternak) Yakni berupa unta, sapi, atau kambing. يَحْكُمُ بِهِۦ (yang diputuskan) Tentang kadar denda atau kesetaraan yang dibunuh. ذَوَا عَدْلٍ مِّنكُمْ(dua orang yang adil di antara kamu) Yakni dua orang yang dikenal orang-orang beriman sebagai orang yang adil. Dan apabila keduanya memutuskan dengan suatu putusan maka wajib dijalankan. هَدْيًۢا بٰلِغَ الْكَعْبَةِ(sebagai had-yad yang dibawa sampai ke Ka’bah) Yakni apabila keduanya telah memutuskan kadar dendanya maka denda (kaffarat) tersebut harus diperlakukan sebagaimana diperlakukannya hewan untuk hadyu, dengan mengirimkannya ke Makkah dan disembelih disana. Yang dimaksudkan dalam ayat ini bukan bangunan ka’bah itu sendiri karena hewan hadyu juga tidak dibawa kesana, namun yang dimaksud adalah tanah haram Makkah dan sekitarnya sampai batas tanah haram; tidak ada perbedaan pendapat dalam hal ini. أَوْ كَفّٰرَةٌ طَعَامُ مَسٰكِينَ أَوْ عَدْلُ ذٰلِكَ صِيَامًا(atau (dendanya) membayar kaffarat dengan memberi makan orang-orang miskin atau berpuasa) Para ulama telah menetapkan bahwa ganti dari setiap hewan yang dibunuh adalah dengan memberi makan dan berpuasa, dan pelakunya dapat memilih dari jenis-jenis kaffarat tersebut. لِّيَذُوقَ وَبَالَ أَمْرِهِۦ ۗ( supaya dia merasakan akibat buruk dari perbuatannya) Yakni akibat buruk dari membunuh hewan buruan. عَفَا اللهُ عَمَّا سَلَفَ ۚ( Allah telah memaafkan apa yang telah lalu) Yakni sebelum diturunkan pengharaman perbuatan ini. وَمَنْ عَادَ (Dan barangsiapa yang kembali mengerjakannya) Yakni kembali membunuh hewan buruan setelah mendapat penjelasan ini. فَيَنتَقِمُ اللهُ مِنْهُ ۗ (niscaya Allah akan menyiksanya) Yakni di akhirat, dengan mengazabnya atas dosanya. Pendapat lain mengatakan Allah akan menyiksanya dengan memerintahkannya membayar kaffarat. Syuraih dan Said bin Jubair berkata: orang yang melakukan ini pertama kali harus dihukum dengan membayar kaffarat, dan apabila ia mengulanginya lagi maka tidak dihukum, namun dikatakan kepadanya: “pergilah, Allah-lah yang akan menghukummu”. Yakni dosamu lebih besar untuk ditebus dengan kaffarat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Wahai orang-orang mukmin, janganlah kalian membunuh binatang buruan dalam keadaan ihram saat berhaji, umrah atau di tanah haram Mekah. Barangsiapa membunuhnya dengan sengaja tanpa melakukan kesalahan, maka dia wajib mengganti apa yang dibunuhnya dengan balasan yang sepadan, berupa binatang ternak (unta, sapi, dan kambing) yang mana balasan serupa itu ditentukan oleh dua lelaki muslim yang adil. Balasan itu dilakukan sebagaimana melakukan pemberian hadiah, lalu hewan (denda) itu dikirim ke tanah haram dan disembelih disana, lalu dagingnya dibagikan untuk orang-orang miskin di tanah haram, atau menebusnya dengan memberi makan orang-orang miskin, yaitu satu mud kurma atau gandum untuk setiap orang miskin yang nilainya sepadan dengan balasan tersebut, atau berpuasa satu hari untuk masing-masing orang miskin yang seharusnya diberi makan. Ini adalah pilihan antara jenis-jenis hukuman yang disebutkan itu, supaya dia merasakan akibat dari perbuatannya. Allah mengampuni sesuatu yang telah berlalu, yaitu membunuh hewan buruan sebelum adanya pengharaman dan adanya denda. Dan barangsiapa kembali membunuh hewan buruan dengan sengaja yang mana itu diharamkan, maka Allah akan mengazabnya di akhirat akibat dosanya. Dan Allah itu Maha Kuat, tidak bisa dikalahkan, dan Maha Membalas para penentang yang berbuat maksiat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian membunuh hewan buruan, sedangkan kalian sedang berihram} keadaan berihram dalam ibadah haji atau umrah {Siapa saja di antara kalian membunuhnya dengan sengaja, maka dendanya yang sepadan dengan yang dibunuhnya berupa ternak} maka dia harus membayar denda yang sepadan dengan hewan buruan yang dibunuh berupa unta, sapi atau kambing {menurut putusan dua orang} dua orang {yang adil di antara kalian sebagai hadyu yang dibawa sampai ke Ka‘bah} diantar sampai Baitul Haram lalu disembeli di sana dan desedekahkan kepada orang-orang miskin di sana {atau denda dengan memberi makan orang-orang miskin atau berpuasa seimbang dengan makanan yang dikeluarkan itu, agar dia merasakan akibat buruk dari perbuatannya} hukuman atas perbuatannya {Allah telah memaafkan perbuatan yang telah lalu. Siapa saja yang kembali mengerjakannya, maka Allah akan menyiksanya. Allah Maha perkasa lagi Maha Memiliki untuk membalas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Kemudian Allah menyampaikan dengan jelas larangan membunuh binatang buruan pada waktu ihram. Dia berfirman, “ Hai orang-orang yang beriman, janganlah kamu memburu binatang buruan, ketika kamu sedang ihram.” Yakni ihram dengan haji atau umrah. Larangan membunuhnya meliputi larangan segalah hal yang mengantarkan untuk membunuh, bekerjasama membunuh, menunjukan, membantu untuk membunuh bahkan termasuk kesempurnaan hal itu adalah bahwa seorang yang sedang berihram dilarang makan apa yang diburunya. Semua itu adalah penghormatan terhadap manasik yang agung ini, bahwa orang yang berihram di larang membunuh binatang buruan yang sebelumnya halalkan baginya. FirmaNya, “ Barangsiapa di antara kamu membunuhnya dengan sengaja,” maksudnya, membunuh binatang buruan dengan sengaja, “maka” atasnya “ dengannya ialah mengganti dengan binatang ternak seimbang dengan buruan yang di bunuhnya.” Yakni unta, atau sapi atau kambing. Dilihat mana yang mirip, maka itulah yang wajib di sembelih dan disedekahkan. Kemiripan ini harus, “ menurut putusan dua orang yang adil di antara kamu.” Yaitu, dua orang yang adil dan mengetahui hukum dan titik kemiripan yang seperti di lakukan oleh para sahabat, di mana mereka memutuskan merpati dengan kambing, burung unta dengan unta, sapi liar dengan binatang ternak, maka dendanya adalah yang mirip dengannya. Jika tidak ada yang mirip, maka yang wajib adalah harganya seperti dalam kaidah ganti rugi. Hadyu itu haruslah “ hadyu yang di bawa sampai ke Ka’bah,” yakni sembelihan di daerah Haram. “ Atau dendanya membayar kaffarat dengan memberi makan orang-orang miskin,”yakni, kaffarat pelanggaran tersebut adalah memberi makan orang-orang miskin seharga binatang ternak yang sepadan, yang berbentuk makanan untuk orang-orang miskin. Banyak ulama berkata, “ Kaffarat itu dihargai lalu dengan harganya dia membeli makanan, maka setiap miskin di beri satu mud gandum atau setengah sha dari selainnya. “ Atau berpuasa seimbang dengan makanan yang di keluarkan itu.” Yakni berpuasa satu hari mengimbangi memberi makan satu orang miskin. “ supaya dia merasakan,” dengan ganti rugi di atas akibat yang buruk dari perbuatannya. Allah telah memaafkan apa yang telah lalu dan barangsiapa yang kembali mengerjakannya sesudah itu, niscaya Allah akan menyiksannya. “ Allah Maha Kuasa Lagi Mempunyai Kekuasaan untuk menyiksa.” Allah hanya menyatakan dengan jelas orang yang membunuh binatang buruan dengan sengaja padahal kafarat berlaku untuk orang yang sengaja dengan yang tidak sengaja, sebagaimana hal itu sesuai dengan kaidah syar’I bahwa orang yang merusak nyawa dan harta-harta yang wajib di hormati, dia wajib memikul ganti ruginya dalam kondisi apa pun, jika pengrusakan itu tanpa alasan yang benar. Hal itu karena Allah mengaitkan ganti rugi, hukuman, dan balasan dengannya. Ini untuk orang yang sengaja. Adapun orang yang tidak sengaja, maka dia tidak memikul dosa, akan tetapi dia memikul ganti rugi. Ini adalah pendapat jumhur ulama. Dan yang benar adalah apa yang secara jelas dikatakan oleh ayat, bahwa orang yang tidak sengaja tidak memikul ganti rugi sebagaimana juga dia tidak memikul dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 95: Dikecualikan daripadanya burung gagak, burung elang, kalajengking, tikus dan anjing buas berdasarkan As Sunnah. Dalam sebuah riwayat, termasuk juga ular. Larangan membunuh mencakup pula larangan terhadap mukaddimah(pengantar)nya, ikut serta membunuh, menunjukkan dan membantu membunuh. Lebih dari itu, seseorang yang ihram dilarang pula memakan hewan yang dibunuh atau diburu karena sebabnya. Ini semua merupakan sikap penghormatan terhadap ibadah yang agung ini. Namun demikian, denda ini berlaku pula untuk orang yang tidak sengaja, karena kaidah syar'i menetapkan bahwa jiwa atau harta yang terpelihara jika dibinasakan harus diganti bagaimana pun keadaannya. Hanya saja untuk orang yang tidak sengaja tidak terancam hukuman. Yakni dua orang yang mengerti hukum dan dapat memperkirakan dengan tepat pengganti binatang yang diburu itu. Contohnya adalah, jika burung unta yang dibunuh, maka dendanya adalah unta, jika yang diburu adalah sapi liar atau keledai liar, maka dendanya sapi, dan jika kijang yang diburu, maka dendanya kambing, demikian juga jika yang diburu adalah burung merpati dendanya adalah kambing. Tetapi jika binatang yang diburu itu tidak sebanding dengan binatang ternak, misalnya belalang, maka diperkirakan berapa harganya, kemudian uang itu disedekahkan. Ialah binatang (unta, sapi, kambing, biri-biri) yang dibawa ke ka'bah untuk mendekatkan diri kepada Allah, disembelih di tanah Haram dan dagingnya dihadiahkan kepada fakir miskin dalam rangka ibadah haji. Yang dibawa sampai ke daerah Haram untuk disembelih di sana dan dagingnya dibagikan kepada fakir miskin. Yakni makanan pokok daerah setempat yang sesuai jumlahnya dengan harga binatang ternak yang menjadi pengganti binatang yang dibunuhnya itu, dan masing-masing orang miskin mendapat satu mud dari makanan tersebut. Mayoritas para ulama berkata, \"Hewan yang dijadikan pengganti hewan yang dibunuh dinilai berapa harganya, setelah itu uangnya digunakan untuk membeli makanan, lalu ia berikan kepada setiap orang miskin satu mud bur/gandum atau setengah sa' (2 mud) jika makanan lainnya.\" Yaitu puasa yang jumlah harinya sebanyak mud yang diberikan kepada fakir miskin, di mana seorang fakir miskin mendapat satu mud. Ali bin Thalhah berkata: Dari Ibnu Abbas, ia berkata tentang ayat, “Sebagai hadyu yang dibawa ke Ka'bah, atau kaffarat (membayar tebusan) dengan memberi makan kepada orang-orang miskin, atau berpuasa, seimbang dengan makanan yang dikeluarkan itu,” yaitu apabila seorang yang berihram membunuh binatang buruan, maka dihukumi demikian. Oleh karena itu, jika ia membunuh seekor kijang atau sejenisnya, maka ia wajib menyembelih seekor kambing yang disembelih di Mekah. Jika tidak memperolehnya, maka dengan memberi makan enam orang miskin. Jika tidak memperolehnya, maka dengan berpuasa tiga hari. Jika ia membunuh rusa atau sejenisnya, maka ia wajib menyembelih seekor sapi, jika tidak memperolehnya, maka dengan memberi makan dua puluh orang miskin, dan jika tidak memperolehnya, maka dengan berpuasa dua puluh hari. Jika ia membunuh seekor burung unta, keledai liar atau sejenisnya, maka ia wajib menyembelih seekor unta. Jika tidak memperolehnya, maka dengan memberi makan 30 orang miskin, dan jika tidak memperolehnya, maka dengan berpuasa selama tiga puluh hari.” (Diriwayatkan oleh Ibnu Abi Hatim dan Ibnu Jarir, dan Ibnu Jarir menambahkan, “Makanan itu satu mud (untuk seorang miskin), yaitu mud yang mengenyangkan mereka.”). Dilihat dari zhahir ayat 95 surat Al Maa’idah, ayat tersebut memakai kata “او ” (atau) yang menunjukkan bahwa orang yang membunuh binatang buruan itu diberikan takhyir/pilihan antara menyembelih binatang ternak yang seimbang atau memberi makan orang miskin atau berpuasa. Wallahu a’lam. Maksudnya membunuh hewan sebelum turun ayat yang melarang ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 95",
    "description": "Hewan buruan di tanah haram, haram dibunuh. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! selama kamu berihram untuk haji atau umrah janganlah kamu membunuh hewan buruan, baik yang boleh dimakan maupun tidak, kecuali burung gagak, burung elang, kalajengking, tikus, anjing buas, dan juga ular; ketika kamu sedang berihram untuk haji atau umrah. Barang siapa di antara kamu membunuhnya dengan sengaja, ketika kamu sedang berihram untuk haji atau umrah, maka dendanya ialah mengganti hewan yang dibunuh secara sengaja itu dengan hewan ternak yang sepadan jenis, usia, maupun beratnya dengan buruan yang dibunuhnya, di tanah haram tersebut yang ditentukan menurut putusan dua orang hakim atau dua orang tokoh yang adil di antara kamu sebagai hadyu, denda karena melanggar larangan ihram, yang dibawa ke ka'bah, yakni dibawa sampai ke tanah haram untuk disembelih di sana dan dagingnya dibagikan kepada fakir miskin; atau membayar kafarat (tebusan) dengan memberi makan kepada orang-orang miskin, sepadan dengan harga hewan pengganti hewan yang dibunuh pada waktu berihram tersebut; atau berpuasa beberapa hari sepadan dengan makanan yang dikeluarkan itu; yaitu setiap satu mud lebih kurang 6, 5 ons beras yang diberikan kepada fakir miskin diganti dengan satu hari berpuasa. Ini bertujuan agar dia merasakan akibat buruk dari perbuatannya, yaitu melanggar larangan ihram dengan membunuh hewan ternak yang hidup di tanah haram. Allah telah memaafkan apa yang kamu lakukan di masa lalu, membunuh hewan ternak pada waktu berihram di tanah haram sebelum turun ayat yang mengharamkan ini. Dan barang siapa kembali mengerjakannya dengan sengaja setelah ada larangan ini, niscaya Allah akan menyiksanya dengan azab yang pedih. Dan Allah mahaperkasa menghadapi hamba yang membangkang, memiliki kekuasaan untuk menyiksa siapa saja yang melanggar hukum-Nya. Allah membolehkan kaum mukmin untuk memakan hewan buruan yang hidup di laut. Dihalalkan bagimu orang-orang beriman memakan hewan buruan laut yang diperoleh dengan berbagai cara seperti memancing, menjala, atau memukat. Termasuk dalam pengertian laut di sini ialah sungai, danau, kolam, dan sebagainya. Dan dihalalkan pula makanan yang berasal dari laut, ikan atau hewan laut yang diperoleh dengan mudah, karena telah mati terapung atau terdampar di pantai sebagai makanan yang lezat bagimu dan makanan yang lezat bagi orangorang yang dalam perjalanan di laut. Dan tetap diharamkan atasmu menangkap hewan darat yang hidup di tanah haram selama kamu sedang berihram untuk haji atau umrah. Dan bertakwalah kepada Allah dengan mengerjakan apa yang diperintahkan Allah dan menjauhi larangannya, yang hanya kepada-Nya kamu sekalian akan dikumpulkan kembali pada hari kiamat di padang mahsyar."
  }
]