[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menghalalkan bagi kalian (Wahai kaum Muslimin), saat keadaan berihram, untuk berburu binatang laut, yaitu binatang yang diburu dari laut dalam keadaan hidup-hidup, dan makanan darinya, maksudnya binatang yang telah mati darinya, untuk kemanfaatan bagi kalian saat kalian berada dirumah maupun sedang menempuh perjalanan jauh. Dan Dia mengharamkan atas kalian binatang buruan darat, selama kalian dalam keadaan ihram dengan haji atau umrah. Dan takutlah kalian kepada Allah dan laksanakan oleh kalian semua perintahNya dan jauhi oleh kalian seluruh laranganNya, sehingga kalian akan menggapai pahalaNya yang besar dan selamat dari pedihnya siksaNya ketika kalian dikumpulkan untuk menghadapi perhitungan amal dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Allah menghalalkan bagi kalian memburu hewan yang hidup di air dan mengonsumsi ikan laut yang terlempar ke darat baik dalam kondisi hidup maupun mati, baik bagi penduduk setempat maupun bagi orang yang sedang dalam perjalanan sebagai bekal. Dan Dia mengharamkan bagi kalian memburu hewan buruan darat selama kalian sedang berihram dalam haji atau umrah. Dan bertakwalah kalian kepada Allah dengan cara menjalankan perintah-Nya dan menjauhi larangan-Nya. Karena hanya kepada-Nya kalian akan dikembalikan pada hari Kiamat kelak, kemudian Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Hai orang-orang yang beriman, Allah telah menghalalkan bagi kalian hewan buruan laut ketika kalian sedang melakukan ihram haji atau umrah. Hewan buruan laut ini meliputi segala yang dikeluarkan dari laut baik itu hewan-hewan yang hidup di sana atau hewan yang telah mati yang terdampar di pantai. Allah telah menjadikan makanan yang berasal dari laut sebagai bahan bekal untuk orang-orang yang bermukim maupun musafir. Kemudian Allah menegaskan kembali pengharaman hewan buruan darat pada saat menjalankan ihram haji atau umrah. Dan bertakwalah kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, karena kalian pasti akan kembali kepada-Nya pada hari kiamat kelak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ (Dihalalkan bagimu binatang buruan laut) Yang dimaksud dengan hewan buruan laut adalah semua hewan yang diburu di air. Dan yang dimaksud dengan laut disini adalah semua air yang didalamnya terdapat hewan air, dan masuk didalamnya sungai dan waduk. وَطَعَامُهُۥ(dan makanan (yang berasal) dari laut) Yakni yang terdampar di pinggir laut atau yang mengapung diatasnya. مَتٰعًا لَّكُمْ(sebagai makanan yang lezat bagimu) sebagai kenikmatan bagi kalian. Yakni orang yang bermukim dapat menikmatinya dalam keadaan segar. وَلِلسَّيَّارَةِ ۖ( dan bagi orang-orang yang dalam perjalanan) Yakni orang yang sedang bepergian dapat menggunakannya sebagai bekal. وَحُرِّمَ عَلَيْكُمْ صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا ۗ (dan diharamkan atasmu (menangkap) binatang buruan darat, selama kamu dalam ihram) Yakni selama kalian menjalankan ihram haji atau umrah. Begitu juga diharamkan hewan buruan dari hasil orang yang tidak sedang berihram, apabila ia berburu hewan tersebut untuk orang yang berihram."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Diperbolehkan untuk kalian hewan buruan laut dan sungai meskipun di tengah keadaan ihram, dan (diperbolehkan juga) makanan yang keluar dari laut atau mengapung di laut untuk bisa dinikmati dan dimanfaatkan bagi orang-orang yang bermukim maupun yang berpergian. Dan diharamkan atas kalian binatang buruan darat selama kalian berada dalam kondisi ihram atau kalian bisa memburunya dalam keadaan tidak ihram. Takutlah kalian pada azab Allah yang mana kalian dikumpulkan pada hari kiamat untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dihalalkan bagi kalian hewan buruan laut dan makanan laut} sesuatu yang hidup ataupun mati yang dikeluarkan dari laut {sebagai kesenangan} manfaat {bagi kalian, dan bagi orang-orang yang dalam perjalanan} bagi para musafir {dan diharamkan atas kalian hewan buruan darat selama kalian dalam keadaan ihram. Bertakwalah kepada Allah yang hanya kepadaNya kalian akan dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. Karena binatang buruan itu meliputi binatang darat, dan binatang laut, maka Allah mengecualikan binatang laut. Dia berfirman, “ Dihalalkan bagimu binatang buruan laut dan makanan yang berasal dari laut,” maksudnya, di halalkan untukmu dalam keadaan ihram binatang buruan laut yaitu hewan laut yang hidup dan makanan yang berasal darinya adalah binatang laut yang sudah mati. Ini menunjukan kehalalan bangkai laut. “Sebagai makanan yang lezat bagimu, dan bagi orang-orang yang dalam perjalanan,” yakni manfaat kehalalannya bagimu adalah agar kamu memanfaatkannya dan juga temanmu yang dalam perjalanan. “ dan diharamkan atasmu manangkap binatang buruan darat, selama kamu dalam ihram,” batasan yang dapat di ambil dalam kata “ binatang buruan” adalah bahwa binatang yang dilarang ini haruslah binatang liar dan halal di makan, maka yang jinak bukanlah binatang buruan dan tidak boleh dimakan itu tidak di buru dan tidak di sebut binatang buruan. “ Dan bertakwalah kepada Allah yang kepadaNyalah kamu akan di kumpulkan,” Bertakwalah dengan melakukan apa yang di perintahkan-Nya dan menjauhi apa yang dilarang-Nya. Gunakanlah ilmumu bahwa kamu akan dikumpulkan kepadaNya sebagai pendorong, lalu Dia memberimu balasan. Apakah dengan kamu bertakwa kepadanya, maka di memberimu pahala yang besar ataukah dengan kamu tidak bertakwa, maka Dia menghukumMu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 96: Baik dalam keadaan ihram maupun tidak. Yakni hewan yang tidak hidup kecuali di air seperti ikan, berbeda dengan hewan yang hidup di air dan di darat seperti kepiting. Maksud ayat ini adalah hewan buruan laut yang diperoleh dengan jalan usaha seperti mengail, memukat dan sebagainya adalah halal. Termasuk dalam pengertian laut di sini adalah sungai, danau, kolam dan sebagainya. Maksudnya ikan atau binatang laut yang diperoleh dengan mudah, karena telah mati terapung atau terdampar di pantai dan sebagainya. Hewan dikatakan sebagai hewan buruan adalah jika sifatnya wahsyi (liar atau tidak jinak), karena jika tidak liar bukanlah hewan buruan. Demikian juga \"yang bisa dimakan\", karena yang tidak bisa dimakan bukanlah dinamakan binatang buruan. Yakni gunakanlah keyakinan bahwa kamu akan dikumpulkan kepada Allah untuk membantu kamu bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 96",
    "description": "Allah membolehkan kaum mukmin untuk memakan hewan buruan yang hidup di laut. Dihalalkan bagimu orang-orang beriman memakan hewan buruan laut yang diperoleh dengan berbagai cara seperti memancing, menjala, atau memukat. Termasuk dalam pengertian laut di sini ialah sungai, danau, kolam, dan sebagainya. Dan dihalalkan pula makanan yang berasal dari laut, ikan atau hewan laut yang diperoleh dengan mudah, karena telah mati terapung atau terdampar di pantai sebagai makanan yang lezat bagimu dan makanan yang lezat bagi orangorang yang dalam perjalanan di laut. Dan tetap diharamkan atasmu menangkap hewan darat yang hidup di tanah haram selama kamu sedang berihram untuk haji atau umrah. Dan bertakwalah kepada Allah dengan mengerjakan apa yang diperintahkan Allah dan menjauhi larangannya, yang hanya kepada-Nya kamu sekalian akan dikumpulkan kembali pada hari kiamat di padang mahsyar. Ayat ini menjelaskan bahwa pada bulan haram, orang-orang beriman dilarang berperang di sekitar ka'bah. Allah telah menjadikan kakbah rumah suci tempat manusia berkumpul. Ka'bah dan sekitarnya menjadi tempat yang aman bagi manusia untuk mengerjakan urusan dunia seperti berbisnis dan berdagang; dan urusan akhirat seperti berhaji dan berumrah. Demikian pula Allah telah menjadikan bulan haram, yaitu bulan zulkaidah, zulhijah, muharam, dan rajab, sebagai waktu yang diharamkan untuk berperang di sekitar kakbah dan tanah haram. Allah juga telah menetapkan hadyu, hewan yang menjadi denda atas pelanggaran larangan ihram yang akan disembelih di tanah haram; dan qala'id, hewan yang diberi kalung sebagai tanda akan disembelih di tanah haram. Semuanya merupakan tanda keagungan Allah, tuhan yang memelihara kakbah. Yang demikian itu agar kamu mengetahui bahwa Allah tuhan yang menciptakan alam semesta ini mengetahui apa yang ada di langit dan apa yang ada di bumi, dan bahwa Allah maha mengetahui segala sesuatu, baik yang terlihat maupun yang tersembunyi dalam penglihatan manusia."
  }
]