[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengingatkan kenikmatanNYa kepada hamba-hambaNya dengan menjadikan ka’bah, baitul haram, sebagai sumber kebaikan bagi agama mereka dan tempat amam bagi kehidupan mereka. Dan itu berlaku sekiranya mereka beriman kepada Allah dan rasulNya dan menegakan apa-apa yang diwajibkanNya. Dan Dia mengharamkan tindakan permusuhan dan peperangan di bulan-bulan haram (yaitu bulan dulqadah, dzulhijjah, muharram, dan rajab). sesorang tidak boleh berbuat aniaya dibulan tersebut kepada orang lain. Dan Allah juga mengharamkan tindakan aniaya terhadap binatang hadyu yang dibawa ketanah suci dari binatang-binatang ternak. Dan Dia juga mengharamkan tindakan aniaya kepada qala’id, yaitu biinatang yang dikalungi sebagai pertanda bahwa binatang itu diperuntukan dalam ibadah haji. Demikian itu supaya kalian mengetahui bahwa Allah mengetahui semua yang ada di langit dan di bumi, termasuk apa yang disyariatkaNya untuk melindungi makhlukNya, sebagian dari sebagian yang lain. Dan sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada yang tersembunyi bagiNya sesuatu pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Allah menjadikan Kakbah, rumah suci itu sebagai pokok kehidupan bagi manusia. Pokok kehidupan itu menjadi sandaran bagi tegaknya kepentingan agama manusia, seperti salat, haji, dan umrah. Dan juga menjadi sandaran bagi kepentingan duniawi mereka dengan adanya jaminan keamanan dan tersedianya berbagai macam buah-buahan dan hasil bumi dari berbagai penjuru. Dan Allah juga menjadikan bulan-bulan haram (Zulkaidah, Zulhijah, Muharam, dan Rajab) sebagai pokok kehidupan bagi mereka dengan memberikan jaminan kepada mereka bahwa pada bulan-bulan itu mereka aman dari serangan lawan. Allah menjadikan hewan hadyu dan qalā`id yang diberi tanda bahwa hewan-hewan itu digiring ke tanah haram sebagai penopang kehidupan bagi mereka dengan memberikan jaminan keamanan bagi para pemiliknya dari gangguan dari pihak mana pun. Anugerah yang Allah berikan kepada kalian itu dimaksudkan agar kalian tahu bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi. Dan tahu bahwa Allah Maha Mengetahui segala sesuatu. Karena penetapan ketentuan syariat -yang akan mewujudkan maslahat bagi kalian dan menghindarkan kalian dari mudarat sebelum terjadi- itu menunjukkan bahwa Allah mengetahui apa yang terbaik bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Allah mengagungkan Ka'bah yang mulia sebagai bentuk pengagungan bagi Baitul haram dengan dijadikan sebagai tempat yang baik, makmur, aman, dan tentram; sehingga orang yang tinggal di sana akan merasa aman dari ketakutan dan kecemasan. Dan Allah mengagungkan seluruh bulan haram, yaitu Dzulqa'dah, Dzulhijjah, Muharram, dan Rajab; dengan menjadikannya masa untuk memperbaiki urusan manusia mereka di dunia dan di akhirat, sehingga manusia akan merasa aman terhadap dirinya, hartanya, penghidupannya, dan perniagaannya. Pada bulan-bulan itu manusia dapat melakukan ibadah melaksanakan haji, menyambung silaturahim, dan mengumpulkan makanan untuk bekal selama satu tahun. bulan-bulan ini menjadi bulan-bulan haram karena itu merupakan masa untuk melaksanakan haji dan umrah, maka janganlah ada seorangpun yang terzalimi pada masa itu. Allah juga mengharamkan kezaliman terhadap hewan hadyu yang telah dikirim ke Ka'bah, dan hewan-hewan ternak yang telah diberi kalung sebagai tanda bahwa itu adalah hewan hadyu. Hal ini agar kalian mengetahui bahwa Allah Maha Mengetahui apa yang ada di langit dan apa yang ada di bumi. Allah-lah yang mengatur mereka, dan tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. قِيٰمًا لِّلنَّاسِ (sebagai pusat (peribadatan) bagi manusia) Yakni sebagai pusat untuk mata pencaharian dan peribadatan mereka, yang dapat memperbaiki urusan keduniaan dan agama mereka. Didalamnya orang yang takut akan merasa aman, orang yang lemah akan mendapat pertolongan, orang yang berdagang akan mendapat untung, dan orang yang beribadah akan beribadah dengan khusyu’. وَالشَّهْرَ الْحَرَامَ(dan (demikian pula) bulan Haram) Yakni bulan Dzul Qa’dah, Dzul Hijjah, Muharram, dan Rajab; didalamnya tidak boleh menuntut qishash, memerangi musuh, dan melanggar kehormatan. Maka dengan keadaan ini menjadikannya sebagai pusat kebaikan bagi manusia. وَالْهَدْىَ وَالْقَلٰٓئِدَ ۚ( serta hadyu dan qalaid) Yakni apabila mereka mengalungi hewan hadyu miliknya maka dia akan diketahui sebagai orang yang sedang melaksanakan haji atau umrah sehingga dia tidak diganggu oleh seorangpun, dan hal ini merupakan suatu kemudahan bagi kehidupan dan safar mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Haji adalah pondasi utama dalam agama ini dan urusan-urusan dunia, Ibnu Jarir berkata tentang firman Allah : { جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيَامًا لِلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلَائِدَ } \"Allah telah menjadikan Ka'bah, rumah suci itu sebagai pusat (peribadatan dan urusan dunia) bagi manusia, dan (demikian pula) bulan Haram, had-ya, qalaid\" : \"dahulu di kalangan bangsa Arab empat perkara ini adalah pondasi utama bagi mereka, yang merupakan sumber kebaikan bagi mereka pada zaman jahiliah, lalu kemudian dalam islam menjadi tempat didirikannya ibadah Haji, dan manasik, dan juga tempat mereka bertuju sebagai qiblat dalam melaksanakan ibadah shalat\". 2 ). Pada awalnya Ka'bah dijadikan sebagai pusat ibadah kaum muslimin (yakni bangsa Arab saat itu) adalah karena ia merupakan sebab turunya hidayah yang membawa mereka kepada tauhid, dan agama ini datang di masa kejahiliaan mereka, kemudian setelah datangnya islam ibadah haji di tempat itu adalah ibadah yang paling utama, dan dengannya dosa-dosa diampuni, oleh karena itu ka'bah ini menjadi pusat urusan akhirat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Allah menjadikan Ka’bah dan daerah sekelilingnya, yaitu Baitul haram sebagai tempat untuk manusia mendirikan perintah agama dengan berhaji, dan tempat untuk urusan dunia mereka dengan memberi keamanan di dalamnya, memberi pertolongan bagi yang lemah dan memberi keuntungan perniagaan di dalamnya. Begitu juga bulan-bulan haram (yaitu Dzulqa’dah, Dzulhijjah, Muharram, dan Rajab) sebagai bulan yang diharamkan untuk berperang dan menuntut darah orang yang telah melakukan pembunuhan, begitu juga Hadyun (binatang ternak yang dipersembahkan untuk tanah haram) dan hewan persembahan yang diberi kalung, yaitu ketika pemiliknya memberi tanda hewan ternaknya dengan kalung atau hal semacamnya, maka hewan itu tidak boleh dilukai (disembelih) oleh siapapun, supaya kalian mengetahui bahwa sesungguhnya Allah mengetahui setiap sesuatu yang mengandung kemaslahatan dan kebaikan di dunia dan akhirat dan sesungguhnya tidak ada satupun sesuatu di bumi dan langit yang tersembunyi dari Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menjadikan Ka‘bah, Baitul Haram itu sebagai pusat kegiatan bagi manusia} bagi manusia untuk melakukan perkara agama dan dunia mereka {dan bulan haram, hadyu dan hewan kurban yang diberi kalung. Yang demikian itu agar kalian mengetahui bahwa sesungguhnya Allah mengetahui apa pun yang ada di langit dan apa pun yang ada di bumi dan sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Allah memberikan bahwa Allah menjadikan “ Ka’bah rumah suci itu sebagai peribadatan dan urusan dunia bagi manusia,” di mana mereka mengagungkannya, meliputi agama dan dunia mereka, dengan itu sempurnalah iman mereka. Dengannya dosa-dosa mereka di hapuskan, dengan berangkat kepadanya merka memperoleh pemberian yang besar dan kebaikan yang banyak,karenanya harta-harta dibelanjakan dan resiko-resiko di terjang, tempat berkumpul seluruh jenis kaum Muslimin dari seluruh penjuru. Mereka saling berkenalan, saling tolong-menolong, bermusywarah dalam kepetingan bersama, ikatan-ikatan mengumpulkan mereka demi kebaikan agama dan dunia mereka Firman Allah \"supaya mereka menyaksikan berbagai manfaat bagi mereka dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan atas rezeki yang Allah telah berikan kepada mereka berupa binatang ternak. Maka makanlah sebahagian daripadanya dan (sebahagian lagi) berikanlah untuk dimakan orang-orang yang sengsara dan fakir.\" ( Al-Hajj:28). Karena Baitullah merupakan pusat peribadatan manusia, maka ada sebagian ulama yang berpendapat bahwa berhaji ke Baitullah adalah fardhu kifayah pada setiap tahunnya. Kalau manusia meninggalkan haji ke Baitullah, niscaya setiap orang yang mampu akan berdosa, bahkan seandainya semua manusia meninggalkan haji kepadanya, niscaya ia tidak lagi menjadi pusat peribadatan dan KIamat pun tiba. Firmannya, “Dan Hadyu dan qala’id.” Yakni, begitu pula Allah menjadikan hadyu (binatang kurban yang dibawa ke Ka’bah untuk disembelih sebagai taqarrub kepada Allah) dan qala’id (Hadyu yang telah ditandai dengan kalung) yang merupakan bentuk hadyu yang paling mulia sebagai bentuk ibadah bagi manusia. Mereka mengambil manfaatnya dan diberi pahala karenanya. “(Allah menjadikan yang) demikian itu agar kamu tahu, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan bahwa sesungguhnya Allah Maha Mengetahui segala sesuatu.” Termasuk ilmuNya adalah Dia menjadikan Baitullah al-Haram, karena Dia mengetahui kemaslahatan dalam agama dan duniamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 97: Ka'bah dan sekitarnya menjadi tempat yang aman bagi manusia untuk mengerjakan urusan-urusannya yang berhubungan dengan duniawi dan ukhrawi, dan menjadi pusat bagi amalan haji. Dengan adanya ka'bah, bulan haram, hadyu dan qalaa'id, kehidupan manusia menjadi tegak, karena di sana terdapat tindakan penarikan berbagai manfaat dan pencegahan berbagai bahaya sebelum terjadinya. Ini semua menunjukkan bahwa Allah Subhaanahu wa Ta'aala mengetahui apa yang ada di langit dan apa yang ada di bumi dan apa yang akan terjadi serta hal yang bermaslahat bagi manusia. Di sana manusia dari beragam bangsa dan bahasa berkumpul, saling kenal-mengenal dan saling bahu-membahu serta bermusyawarah untuk maslahat bersama dan memperbaiki hubungan. Oleh karena Baitullah menjadi tempat berkumpul manusia, berkata sebagian ulama, \"Sesungguhnya berhaji ke Baitullah fardhu kifayah pada setiap tahunnya. Jika sampai manusia meninggalkannya, maka berdosalah semua yang mampu. Bahkan, jika manusia meninggalkan haji, maka akan menyingkir penopang hidup mereka dan akan tegak kiamat.\" Maksudnya adalah bulan-bulan Haram, yaitu bulan Zulkaidah, Zulhijjah, Muharram dan Rajab. Pada bulan-bulan itu dilarang mengadakan peperangan, oleh karenanya manusia merasakan keamanan di bulan-bulan itu. Lihat footnote ayat 95. Dengan penyembelihan hadyu dan qalaaid, orang yang berkorban mendapatkan keamanan di samping pahala yang besar, sedangkan orang fakir miskin mendapat bagian dari daging binatang-binatang sembelihan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 97",
    "description": "Ayat ini menjelaskan bahwa pada bulan haram, orang-orang beriman dilarang berperang di sekitar ka'bah. Allah telah menjadikan kakbah rumah suci tempat manusia berkumpul. Ka'bah dan sekitarnya menjadi tempat yang aman bagi manusia untuk mengerjakan urusan dunia seperti berbisnis dan berdagang; dan urusan akhirat seperti berhaji dan berumrah. Demikian pula Allah telah menjadikan bulan haram, yaitu bulan zulkaidah, zulhijah, muharam, dan rajab, sebagai waktu yang diharamkan untuk berperang di sekitar kakbah dan tanah haram. Allah juga telah menetapkan hadyu, hewan yang menjadi denda atas pelanggaran larangan ihram yang akan disembelih di tanah haram; dan qala'id, hewan yang diberi kalung sebagai tanda akan disembelih di tanah haram. Semuanya merupakan tanda keagungan Allah, tuhan yang memelihara kakbah. Yang demikian itu agar kamu mengetahui bahwa Allah tuhan yang menciptakan alam semesta ini mengetahui apa yang ada di langit dan apa yang ada di bumi, dan bahwa Allah maha mengetahui segala sesuatu, baik yang terlihat maupun yang tersembunyi dalam penglihatan manusia. Wahai orang-orang beriman, ketahuilah bahwa Allah sangat keras siksaan-Nya bagi siapa saja yang melanggar hukum-Nya; dan ketahuilah juga bahwa Allah maha pengampun bagi siapa saja di antara hamba-hamba-Nya yang bertobat dari dosa-dosanya dengan tobat nasuha, maha penyayang kepada siapa saja yang menyayangi makhluk-Nya."
  }
]