[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketahuilah (wahai sekalian manusia), sesungguhnya Allah Maha keras siksaanNya bagi orang yang mendurhakaiNya, dan sesungguhnya Allah Maha pengampun lagi Maha penyayang terhadap hamba yang bertaubat dan kemabli kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Ketahuilah -wahai manusia- bahwasanya hukuman Allah sangat berat bagi orang yang durhaka kepada-Nya. Tetapi Dia Maha Pengampun lagi Maha Penyayang bagi orang yang mau bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Hai Manusia, ketahuilah bahwa Allah sangat keras siksaan-Nya bagi orang yang menyelisihi perintah-Nya dan bermaksiat kepada-Nya, dan Allah Maha Pengampun dan Maha Penyayang bagi orang yang mematuhi dan mentaati perintah-Nya, serta bagi orang yang bertaubat. Allah mendahulukan kata 'siksaan' atas kata 'kasih sayang' sebagai tanda bahwa kasih sayang-Nya lebih besar, karena kasih sayang-Nya melampaui kemurkaan-Nya, sebagaimana yang disebutkan dalam hadits; oleh sebab itu Allah berfirman: ويعفوا عن كثير “Dan banyak (pula yang) dibiarkannya.” (Al-Maidah: 15)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Setiap insan selalu membutuhkan dukungan untuk membangkitkan harapannya dan menghilangkan rasa futur yang tertimbun dalam drinya, karena sesungguhnya rasa pesimis yang membayang dalam benaknya adalah faktor utama yang akan membawanya kepada kehancuran, dan tertipu oleh perkara-perkara yang menghalanginya untuk berlomba-lomba untuk menghadirkan kebaikan, oleh karena itu al-Qur'an memberikan solusi dengan menggabungkan antara rasa takut dan harapan yang tiggi sebagaimana yang dijelaskan dalam ayat ini : { اعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"Ketahuilah, bahwa sesungguhnya Allah amat berat siksa-Nya dan bahwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\" agar manusia senantisa berjalan dengan bekal rasa takut dan harapan kepada tuhan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Dan ketahuilah sesungguhnya Allah itu sangat dahsyat hukumanNya bagi orang yang menentang perintahNya dan Maha Pengampun lagi Maha Penyayang bagi orang yang mau bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah bahwa Allah sangat keras hukumanNya dan bahwa Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. “Ketahuilah, bahwa sesungguhnya Allah amat berat siksaNya dan bahwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Maksudnya, hendaknya kedua ilmu ini ada di dalam hatimu dengan keyakinan dan kepastian. Kamu mengetahui bahwa Dia amat berat siksaNya kepada siapa yang menyelisihiNya di dunia dan di akhirat, dan bahwa Dia adalah Maha Pengampun lagi Maha Penyayang kepada siapa yang bertaubat dan taat kepadaNYa. Ilmu ini membuahkan untukmu rasa takut terhadap azabNya dan harapan terhadap ampunan dan pahalaNya dan kamu mengetahui apa yang menjadi konsekuensi takut dan harapan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 98: Hendaknya kedua ilmu ini, yakni mengetahui bahwa Allah sangat keras siksaan-Nya terhadap orang yang bermaksiat kepada-Nya dan Maha Pengampun lagi Maha Penyayang terhadap orang yang bertobat dan taat kepada-Nya, ada dalam diri seseorang sehingga membuahkan rasa takut terhadap siksa-Nya dan mengharap ampunan dan pahala-Nya serta mengerjakan konsekwensi dari keduanya berupa mengerjakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 98",
    "description": "Wahai orang-orang beriman, ketahuilah bahwa Allah sangat keras siksaan-Nya bagi siapa saja yang melanggar hukum-Nya; dan ketahuilah juga bahwa Allah maha pengampun bagi siapa saja di antara hamba-hamba-Nya yang bertobat dari dosa-dosanya dengan tobat nasuha, maha penyayang kepada siapa saja yang menyayangi makhluk-Nya. Allah menyatakan bahwa tidak ada kewajiban seorang rasul menjadikan seseorang untuk beriman, selain menyampaikan kepadanya ajaran Allah dengan benar sehingga ia tidak dapat beralasan bahwa ajaran Allah tidak sampai kepadanya. Dan ketahui jugalah dengan penuh keinsafan bahwa Allah mengetahui apa yang kamu tampakkan dengan ucapan dan perbuatan dan apa yang kamu sembunyikan di dalam hati."
  }
]