[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menerangkan bahwa misi penting rasulNya ialah mengarahkan petunjuk dan menyampaikan (risalahNya), dan ditangan Allah sematalah adanya hidayah taufik. Dan apa saja yang mengisi hati-hati manusia, baik yang mereka rahasiakan dan mereka perlihatkan terang-terangan dari bentuk hidayah dan kesesatan, Allah telah mengetahuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Tugas seorang rasul hanyalah menyampaikan apa yang Allah perintahkan untuk disampaikannya. Dia tidak berkewajiban menyadarkan manusia ke jalan yang benar. Karena hal itu adalah wewenang Allah sendiri. Allah mengetahui hidayah dan kesesatan yang kalian tunjukkan dan yang kalian sembunyikan. Dan Dia akan memberimu balasan yang setimpal atas hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Tugas Nabi Muhammad adalah menyampaikan risalah kepada manusia, dan mereka berkewajiban untuk melaksanakan risalah itu. Jika mereka melaksanakan dan mentaatinya maka mereka akan meraih surga, namun jika mereka bermaksiat dan menyelisihinya maka balasan bagi mereka adalah neraka. Allah Maha Mengetahui apa yang mereka ungkapkan dari hati mereka dan apa yang mereka sembunyikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. إِلَّا الْبَلٰغُ ۗ( tidak lain hanyalah menyampaikan) Yakni menyampaikan kepada mereka, apabila mereka tidak mentaati maka hal itu tidaklah memberi madharat kecuali kepada diri mereka sendiri, dan mereka tidak berbuat jahat kecuali kepada diri mereka sendiri. Adapun Rasulullah, maka ia telah menjalankan apa yang diwajibkan kepadanya dan menunaikan apa yang diperintahkan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Tidaklah kewajiban rasul itu memberi petunjuk kepada manusia, melainkan hanya menyampaikan wahyu Tuhan kepada mereka. Dan Jika mereka tidak menerima dakwahnya, maka mereka itu tidak memberi kerugian kecuali untuk diri mereka sendiri. Dan Allah itu mengetahui ucapan dan tindakan yang kalian tampakkan, serta niat dan maksud yang kalian sembunyikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kewajiban Rasul tidak lain hanyalah sebagai penyampai. Allah mengetahui apa pun yang kalian tampakkan} kalian tunjukkan {dan apa pun yang kalian sembunyikan} kalian sembunyikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Kemudian Allah berfirman, “Kewajiban Rasul tidak lain hanyalah menyampaikan.” Dan dia telah menyampaikan dan menunaikan tugasnya dan lain-lainnya, dia tidak memiliki sedikit pun dari perkara tersebut. “Dan Allah mengetahui apa yang kamu tampakkan dan apa yang kamu sembunyikan.” Maka Dia membalasmu sesuai dengan apa yang diketahuiNya darimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 99: Selain itu, bukanlah tugasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 99",
    "description": "Allah menyatakan bahwa tidak ada kewajiban seorang rasul menjadikan seseorang untuk beriman, selain menyampaikan kepadanya ajaran Allah dengan benar sehingga ia tidak dapat beralasan bahwa ajaran Allah tidak sampai kepadanya. Dan ketahui jugalah dengan penuh keinsafan bahwa Allah mengetahui apa yang kamu tampakkan dengan ucapan dan perbuatan dan apa yang kamu sembunyikan di dalam hatikatakanlah, wahai nabi Muhammad, tidaklah sama yang buruk, kekufuran, kemusyrikan, kemunafikan, dan harta yang haram dengan yang baik, iman, tauhid, kejujuran, dan harta yang halal; meskipun banyaknya keburukan itu, kekayaan hasil korupsi dan harta yang diperoleh dengan cara yang haram secara lahiriah, menarik hatimu, karena tertarik kepada kenikmatan, kepuasan dan kemudahan, serta kebanggaan sebagai seorang yang kaya; maka bertakwalah kepada Allah dengan menjauhkan diri kamu dari kekufuran, kemusyrikan, dan kemunafikan, serta dari harta yang haram; wahai orang-orang yang mempunyai akal sehat sehingga kamu berpikir jernih dan mendalam agar kamu beruntung dunia dan akhirat."
  }
]