[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Ha Mim). Pembicaraan tentang huruf-huruf penggalan (di awal surat seperti ini) telah hadir di awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. حمٓ تَنزِيلُ الْكِتٰبِ مِنَ اللهِ الْعَزِيزِ الْحَكِيمِ (Haa Miim. Diturunkan Kitab ini dari Allah Yang Maha Perkasa lagi Maha Bijaksana) Telah dijelaskan ayat yang serupa dengan ayaat ini pada awal surat Ghafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Haa miim: untuk menunjukkan kemukjizatan Alquran yang tersusun dalam rangkaian huruf Arab ini. Orang Arab sendiri tidak akan pernah bisa menyanggah atau melawannya. Ini juga berfungsi sebagai peringatan atas akan adanya hukum yang penting setelah huruf tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 1: Telah berlalu perkataan atas huruf-huruf muqatha’ah di awal surat Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 1",
    "description": "Surah ini diawali dengan dua huruf arab ha m'm, sebagaimana beberapa surah lainnya, untuk menunjukkan mukjizat Al-Qur'an yang tersusun dari huruf-huruf arab serupa itu, dan untuk memberikan peringatan akan pentingnya apa yang diwahyukan dalam ayat-ayat sesudahnya. (surah-surah yang dimulai dengan huruf ha m'm ada tujuh surah, yaitu : surah al-Mu'min, surah as-sajdah, surah asy-sy'r', surah az-zukhruf, surah ad-dukh'n, surah al-j'iyah dan surah al-ahq'f). 2. Selanjutnya Allah menyatakan bahwa kitab Al-Qur'an ini diturunkan secara berangsur-angsur dari Allah yang mahaperkasa kerajaan dan kekuasaannya lagi mahabijaksana perbuatan dan ketetapan-Nya."
  }
]