[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang musyrik dari kaummu, “Kabarkanlah kepadaku, seandainya al-Quran ini datang dari sisi Allah lalu kalian mengingkarinya, lalu seorang saksi dari Bani Israil, seperti Abdullah bin Salam, bersaksi atas apa yang sepadan dengan al-Quran, yaitu apa yang ada di dalam Taurat, berupa pembenaran kepada kenabian Muhammad, lalu Abdullah membenarkan dan mengamalkan apa yang ada di dalam al-quran, sementara kalian memilih mengingkarinya dengan kesombongan, bukankah itu adalah kezhaliman paling besar dan kekafiran paling berat? Sesungguhnya Allah tidak memberikan taufik kepada Islam dan mengikuti kepada suatu kaum yang menzhalimi diri mereka dengan kafir kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Katakanlah -wahai Rasul- kepada orang-orang yang mendustakan, “Beritahukan kepadaku jika Al-Qur`ān dari sisi Allah dan kalian mengingkarinya dan seseorang dari Bani Israil telah bersaksi bahwa Al-Qur`ān ini dari sisi Allah berdasarkan apa yang disebutkan di dalam kitab Taurat tentangnya kemudian dia mengimaninya sementara kalian menyombongkan diri dari mengimaninya, bukankah berarti kalian saat itu adalah orang-orang yang zalim? Sesungguhnya Allah tidak akan memberikan taufik bagi orang-orang yang zalim untuk mendapatkan kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. قُلْ أَرَءَيْتُمْ (Katakanlah: “Terangkanlah kepadaku) Yakni beritahukan kepadaku. إِن كَانَ(jika Al Quran itu) Jika al-Qur’an itu sebenarnya. مِنْ عِندِ اللهِ (datang dari sisi Allah) Sedangkan kalian mengingkarinya. وَشَهِدَ شَاهِدٌ مِّنۢ بَنِىٓ إِسْرٰٓءِيلَ (n seorang saksi dari Bani Israil mengakui (kebenaran)) Yang mengetahui kebenarannya dari kitab Taurat yang diturunkan Allah. عَلَىٰ مِثْلِهِۦ (yang serupa dengan (yang tersebut dalam) Al Quran) Dengan makna-makna yang ada dalam Taurat yang sesuai dengan al-Qur’an berupa keesaan Allah dan berita kenabian serta lain sebagianya. فَـَٔامَنَ (lalu dia beriman) Yakni bersaksi bahwa al-Qur’an adalah kalamullah dan termasuk apa yang diturunkan Allah kepada para Rasul-Nya. Dan orang yang bersaksi adalah Abdullah bin Salam, ia masuk Islam setelah Rasulullah berhijrah. وَاسْتَكْبَرْتُمْ ۖ( sedang kamu menyombongkan diri) Hingga enggan untuk beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Katakanlah wahai Nabi: “Tunjukkan padaku wahai orang musyrik bukti dari kalian jika Alquran ini bukan dari Allah, yang telah kalian sangkal dan dustakan. Padahal telah ada saksi seorang ulama’ Bani Israil yang bersaksi tentang kebenaran Alquran yang semakna dengan isi dalam Taurat. Perintah yang semakna menyeru kepada pengesaan Allah (tauhid) dan dasar-dasar berbagai keutamaan. Lalu saksi itu mengimani Alquran, namun kalian sombong dan tidak beriman kepada Alquran. Sesungguhnya Allah tidak memberi petunjuk iman kepada orang-orang kafir.” Diriwayatkan dari Bukhori dan Muslim dari Sa’ad bin Abi Waqash bahwa ayat ini turun untuk Abdullah bin Salam, dan ada seorang Bani Israil yang bersaksi tentang kebenaran Alquran sesuai Taurat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Bagaimana pendapat kalian} Beritahukanlah kepadaku {jika (Al-Qur’an) itu datang dari sisi Allah dan kalian mengingkarinya, padahal seorang saksi dari Bani Israil mengakui yang serupa dengannya} serupa denga apa yang disebutkan bahwa Al-Qur’an itu dari sisi Allah {lalu dia beriman, sedangkan kalian menyombongkan diri. Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Katakanlah kepadaku, bagaimanakah pendapatmu jika al-Qur’an itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari bani israil mengakui (kebenaran) yang serupa dengan (yang di sebutkan dalam) al-Qur’an lalu dia beriman, sedang kamu menyombongkan diri,” Artinya, beritahukanlah kepadaku jika al-Qur’an ini berasal dari sisi Allah subhanahu wata’ala dari kalangan ahli kitab, yaitu orang-orang yang memiliki kebenaran namun mereka tidak mengetahui bahwa itu adalah kebenaran. Berimanlah kepada al-Qur’an dan jadikanlah sebagai petunjuk, semua kisah para nabi dan para pengikutnya yang berakal itu sama, sedangkan kalian tetap saja mengingkari wahai orang-orang bodoh dan tolol. Perbuatan kalian ini tidak lain adalah kezhaliman dan kekufuran paling besar. ”Sesungguhnya Allah tiada memberi petunjuk kepada orang-orang yang zhalim.” Termasuk kezhaliman adalah menyombongkan diri terhadap kebenaran setelah memahaminya dengan baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 10: Dan pada kali yang lain Allah memerintahkan Nabi-Nya ﷺ agar berkata kepada orang-orang musyrik : Kabarkan kepadaku seandainya Al Qur’an ini dari sisi Allah dan kalian kafir dengannya. Sebagian ulama bani israil seperti Abdullah bin Salam meyakini bahwasanya Al Qur’an adalah kebenaran, dan Al Qur’an mengandung tauhid dan peringatan sebagaimana di dalam kitab yang diturunkan kepada Musa dan selainnya dari para Nabi. Kemudian setelah itu dia meyakini, beriman terhadapa Al Qur’an dan beramal dengan apa yang ada di dalamnya. Adapun kalian menolak dengan sombong dan merasa tinggi. Maka bukankah hal ini sebesar-besarnya kedzaliman dan kekafiran ? Ketahuilah bahwa Allah tidak menyetujui suatu kaum yang mereka dzalim terhadap diri mereka sendiri dengan sombong dari kebenaran setelah mengetahui kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Abdurrahman bin Jubair bin Nufair dari bapaknya dari ‘Auf bin Malik ia berkata: Suatu hari Nabi shallallahu 'alaihi wa sallam pernah pergi dan aku ikut bersamanya sehingga kami memasuki tempat ibadah orang-orang Yahudi di Madinah pada hari raya mereka, lalu mereka tidak senang terhadap masuknya kami kepada mereka, maka Rasulullah shallallahu 'alaihi wa sallam bersabda kepada mereka, “Wahai kaum Yahudi! Tunjukkanlah kepadaku 12 orang dari kamu yang bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah dan bahwa Muhammad adalah utusan Allah. Allah akan menjatuhkan kemurkaan kepada setiap orang Yahudi dari atas langit.” Lalu mereka semua diam dan tidak ada seorang pun dari mereka yang menjawab, lalu Beliau mengulangi lagi namun tidak ada yang menjawab sehingga ketiga kalinya Beliau mengulangi lagi, namun tidak ada yang menjawab. Kemudian Beliau bersabda, “Demi Allah, kamu memang tidak mau. Sesungguhnya aku adalah orang yang akan mengumpulkan, orang (nabi) yang terakhir, dan nabi yang terpilih, baik kamu beriman atau mendustakan.” Lalu Beliau pulang dan aku ikut bersama Beliau, sehingga ketika kami hendak keluar ada seorang laki-laki yang memanggil dari belakang, “Sebagaimana engkau wahai Muhammad?” Lalu orang itu datang, dan berkata, “Siapakah seseorang yang mau memberitahuku wahai kaum Yahudi?” Mereka (orang-orang Yahudi) menjawab, “Demi Allah, kami tidak mengetahui di antara kami orang yang paling tahu dan paling paham tentang kitab Allah daripada engkau, demikian pula daripada bapakmu sebelummu dan kakekmu yang sebelum bapakmu.”:Lalu orang tersebut berkata, “Sesungguhnya aku bersaksi bahwa dia adalah nabi Allah yang kalian temukan dalam Taurat.” Mereka menjawab, “Engkau dusta.” Kemudian mereka membantah perkataannya dan mengatakan, bahwa pada orang tersebut ada keburukan. Rasulullah shallallahu 'alaihi wa sallam bersabda, “Kamu dusta dan ucapanmu tidak lagi diterima. Sebelumnya kamu puji dia karena kebaikannya, namun ketika ia beriman, kamu malah mendustakannya dan kamu katakan terhadapnya ucapan yang telah kamu ucapkan sehingga ucapanmu tidak lagi diterima.” Lalu kami keluar dalam keadaan bertiga; yaitu Rasulullah shallallahu 'alaihi wa sallam, aku, dan Abdullah bin Salam, maka Allah ‘Azza wa Jalla menurunkan ayat tentangnya (Abdullah bin Salam), “Katakanlah, \"Terangkanlah kepada-Ku, bagaimana pendapatmu jika sebenarnya Al Quran ini datang dari Allah, dan kamu mengingkarinya, padahal ada seorang saksi dari Bani Israil yang mengakui (kebenaran) yang serupa dengan (yang disebut dalam) Al Qur’an lalu dia beriman, kamu menyombongkan diri. Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim.” (Hadits ini menurut Haitsami dalam Majma’uz Zawaa’id juz 7 hal. 106, diriwayatkan oleh Thabrani dan para perawinya adalah para perawi hadits shahih. Ibnu Hibban juga menyebutkannya dalam Mawaariduzh Zham’aan hal. 518, Thabrani juz 26 hal. 12, Hakim dalam Mustadrak juz 3 hal. 416 dan ia berkata, “Shahih sesuai syarat Bukhari dan Muslim dan didiamkan oleh Adz Dzahabi.” Syaikh Muqbil berkata, “Hadits tersebut sesuai syarat Muslim, karena Bukhari tidak menyebutkan hadits dari Abdurrahman bin Jubair dan bapaknya, demikian pula Shafwan bin ‘Amr, ia (Bukhari) tidak menyebutkannya selain secara mu’allaq sebagaimana dalam biografinya di Tahdziibut tahdziib, wallahu a’lam.”) Catatan: Disebutkan dalam Shahih Bukhari dan Muslim bahwa Abdullah bin Salam radhiyallahu 'anhu adalah orang yang datang kepada Rasulullah shallallahu 'alaihi wa sallam ketika Beliau baru datang dari Mekah, dan disebutkan hal yang serupa dengan kisah tersebut, namun di sana tidak disebutkan sebab turunnya ayat. Sedangkan kisah ini menunjukkan bahwa Beliau yang pergi ke tempat ibadah mereka. Lalu bagaimanakah menggabungnya? Menurut Syaikh Muqbil, bahwa Abdullah bin Salam ketika telah masuk Islam saat ia datang kepada Rasulullah shallallahu 'alaihi wa sallam, maka ia pergi ke kumpulan orang-orang Yahudi, namun mereka tidak mengetahui keislamannya. Ketika Rasulullah shallallahu 'alaihi wa sallam datang kepada mereka, Beliau berkata kepada mereka apa yang Beliau katakan, wallahu a’lam. Jika penggabungan ini diridhai, atau Allah membukakan kepada hati anda penggabungan yang lebih baik darinya, jika tidak maka dikuatkan hadits yang disebutkan dalam Shahih Bukhari dan Muslim, terlebih ‘Auf bin Malik menurut al Waaqidiy, masuk Islam pada perang Khaibar, yang lain berpendapat, bahwa ia hadir pada penaklukkan Mekah, sedangkan menurut Ibnu Sa’ad, bahwa Nabi shallallahu 'alaihi wa sallam mempersaudarakan antara ‘Auf bin Malik dengan Abud Dardaa’ (dari Al Ishaabah juz 3 hal. 43). Dalam Al Istii’aab, bahwa perang yang dihadirinya pertama kali adalah Khaibar, juz 3 hal. 131 dengan Al Ishaabah. Dalam Ath Thabaqaat juz 7 qaaf 2, bahwa ‘Auf bin Malik Al Asyja’i masuk Islam sebelum peristiwa Hunain dan hadir pada saat perang Hunanin sampai selesai. Dalam Al Mustadrak juz 3 hal. 546 dari Al Waaqidiy sama dengan yang disebutkan di sini, sehingga yang tampak adalah tidak sahnya hadits di atas, wallahu a’lam. Demikianlah menurut Syaikh Muqbil). Yakni beritahukanlah kepadaku jika sekiranya Al Qur’an dari sisi Allah, dan kebenarannya disaksikan oleh orang-orang Ahli Kitab yang mendapat taufiq, dimana mereka memiliki sesuatu yang dengannya mereka dapat mengetahui kebenaran, lalu mereka beriman kepadanya sehingga sesuailah berita para nabi dan para pengikutnya yang mulia, namun kamu wahai orang-orang yang jahil dan sesat malah bersikap sombong? Yang dimaksud dengan seorang saksi dari Bani Israil ialah Abdullah bin salam. Ia menyatakan keimanannya kepada Nabi Muhammad shallallahu 'alaihi wa sallam setelah memperhatikan bahwa di antara isi Al Quran ada yang sesuai dengan Taurat, seperti ketauhidan, janji dan ancaman, kerasulan Muhammad shallallahu 'alaihi wa sallam, adanya kehidupan akhirat dan sebagainya. Termasuk kezaliman adalah sombong terhadap yang hak setelah mengetahuinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 10",
    "description": "Lebih lanjut Allah memerintahkan kepada nabi Muhammad agar mengatakan kepada orang-orang musyrik itu 'terangkanlah kepadaku, bagaimana pendapatmu jika sebenarnya Al-Qur'an yang kusampaikan kepadamu ini datang dari Allah, dan kamu mengingkarinya dengan menuduh bahwa aku telah mengada-adakannya, padahal ada seorang saksi dari bani israil yang mengakui kebenaran yang serupa dengan yang disebut dalam Al-Qur'an, yakni wahyu Allah yang disebut dalam kitab taurat dan kitab-kitab sebelumnya yang mengajarkan tentang tauhid, hari akhir dan ajaran-ajaran lainnya yang serupa dengan ajaran Al-Qur'an lalu dia beriman kepada apa yang tertulis di dalamnya, sedangkan kamu menyombongkan diri, tidak percaya kepada ajaran serupa itu yang terdapat di dalam kitab suci Al-Qur'an. Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim, disebabkan keengganan mereka untuk menerima petunjuk-Nya. 11. Orang-orang kafir tetap menolak beriman kepada Al-Qur'an walaupun bukti-bukti kebenaran Al-Qur'an telah jelas dinyatakan kepada mereka. Kini mereka mengolok-olok Al-Qur'an dengan mengatakan bahwa Al-Qur'an itu tidak lain adalah dongengan orang-orang terdahulu. Dan orang-orang yang kafir kepada Allah dan rasul-Nya berkata kepada orang-orang yang beriman, 'sekiranya keimanan kepada Al-Qur'an itu sesuatu yang baik, lebih baik dari tradisi yang kami dapati dari nenek moyang kami tentu mereka orang-orang yang beriman yang miskin dan rendah kedudukan sosialnya tidak pantas mendahului kami, orang-orang yang kaya lagi tinggi kedudukan sosialnya beriman kepadanya, yakni kepada Al-Qur'an. ' tetapi disebabkan oleh karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata, ini adalah dusta yang lama. ' mereka mengingkari Al-Qur'an dan mengatakan bahwa apa yang tertulis di dalamnya hanyalah dongeng masa lalu yang berisi kebohongan."
  }
]