[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengingkari kenabian Muhammad berkata kepada orang-orang yang beriman kepadanya, “Bila pembenaran kalian kepada apa yang Muhammad bawa merupakan kebaikan, niscaya kalian tidak mendahului kami dalam hal ini.” Karena mereka tidak mengambil petunjuk dari al-Quran dan manfaaat darinya, maka mereka akan berkata, “Ini adalah dusta yang diwariskan dari orang-orang terdahulu.’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan orang-orang yang mendustakan Al-Qur`ān dan apa yang dibawa oleh rasul mereka berkata, “Jika apa yang dibawa Muhammad adalah kebenaran yang memberi petunjuk kepada kebaikan, maka tentulah orang-orang fakir, para hamba sahaya dan orang-orang duafa tidak akan mendahului kami kepadanya.” Dan karena mereka belum mendapat petunjuk dengan apa yang dibawa oleh Rasul mereka maka mereka berkata, “Apa yang dibawanya kepada kami adalah kebohongan yang lama dan kami tidak akan mengikuti kebohongan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Orang-orang kafir berkata kepada orang-orang beriman: “Jika al-Qur’an ini adalah sesuatu yang baik maka orang-orang lemah dan miskin itu tidak akan mendahului kami untuk menerimanya.” Dan karena mereka tidak mendapatkan petunjuk melalui al-Qur’an padahal ia mengandung bukti dan mukjizat yang jelas, maka mereka berkata, ‘Al-Qur’an ini adalah kedustaan yang diambil dari orang-orang terdahulu’. Sebelum al-Qur’an terdapat kitab Taurat yang Allah turunkan kepada Musa sebagai panutan dalam agama Allah dan rahmat bagi orang yang mengimani dan mengamalkannya. Dan al-Qur’an adalah kitab membenarkan kitab-kitab sebelumnya dan kitab yang diturunkan dengan bahasa Arab yang fasih, sebagai peringatan bagi oarng-orang kafir dan pelaku dosa dan kabar gembira bagi orang-orang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَقَالَ الَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوا۟ (Dan orang-orang kafir berkata kepada orang-orang yang beriman) Yakni mereka mengatakan tentang orang-orang beriman. لَوْ كَانَ خَيْرًا(Kalau sekiranya di (Al Quran) adalah suatu yang baik) Yakni apa yang dibawa oleh Nabi Muhammad berupa al-Qur’an dan kenabian. مَّا سَبَقُونَآ إِلَيْهِ ۚ( tentulah mereka tiada mendahului kami (beriman) kepadanya) Ibnu Mundzir meriwayatkan: dahulu Umar bin Khattab memiliki seorang budak wanita yang masuk Islam sebelum dia; budak wanita itu bernama Zinnirah, dan Umar memukulinya karena masuk Islam. Orang-orang kafir Quraisy mengatakan: “Seandainya al-Qur’an itu baik maka Zinnirah tidak akan mendahului kami masuk Islam. Maka Allah menurunkan ayat tentang perihal wanita ini: وقال الذين كفروا..... وَإِذْ لَمْ يَهْتَدُوا۟ بِهِۦ(Dan karena mereka tidak mendapat petunjuk dengannya) Yakni dengan al-Qur’an. فَسَيَقُولُونَ هٰذَآ إِفْكٌ قَدِيمٌ (maka mereka akan berkata: “Ini adalah dusta yang lama”) Yakni kedustaan orang terdahulu. Sebagaimana perkataan mereka: dongeng-dongeng orang terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Orang-orang yang ingkar terhadap Allah dan rasul-Nya berkata tentang orang-orang yang beriman – lam bermakna ‘an – artinya membicarakan orang-orang yang beriman. Orang kafir itu adalah Abdullah bin Salam dan para komplotannya: “Kalaupun Alquran ini lebih baik dari apa yang kami dapatkan dari para pendahulu kami, maka mereka tidak pantas beriman mendahului kami. Orang-orang yang telah beriman itu adalah orang-orang kelas rendah. Mereka berkata seperti itu dengan tujuan mengolok atas kemiskinan orang-orang yang beriman. Namun, karena mereka tidak beriman maka mereka akan berkata: “Alquran ini hanyalah dusta lama, dongeng orang-orang terdahulu. Idz lam yahtaduu bermakna lam ta’lil yang menjelaskan keadaan sesungguhnya. Ayat ini turun untuk orang-orang musyrik yang berkata “Kami ini lebih mulia, kami ini dan seterusnya, kalaupun Alquran ini memang baik, makan mereka fulan dan fulan tidak pantas mendahului beriman sebelum kami.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir berkata tentang orang-orang yang beriman,“Jika Al-Qur’an itu adalah sesuatu yang baik} Jika agama Muhammad itu benar {maka mereka tidak pantas mendahului kami kepadanya. Dan ketika tidak mendapat petunjuk dengannya} dengan Al-Qur’an itu {mereka akan berkata,“Ini adalah kebohongan} kebohongan {yang lama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-12. Artinya, mereka mengingkari dan menentang kebenaran serta menolak seruan Nabi Muhammad sholallohu ‘alaihi wasallam dengan berkata, “Kalau sekitarnya ia (al-Qur’an) adalah suatu yang baik, tentu tidak mendahului kami ( beriman ) kepadanya.” Artinya, tentu tidak di dahului orang-orang beriman dan tentu kami adalah orang-orang yang pertama mendahuluinya. Pertanyaan mereka ini merupakan kepalsuan. Bukti apa yang bisa menunjukan bahwa tanda-tanda kebenaran itu pasti di dahului oleh mereka yang mendustakan, bukan orang-orang yang percaya terlebih dahulu? Apakah jiwa mereka paling bersih, akalnya paling sempurna atau apakah petunjuk ada di tangan mereka? Hanya saja perkataan yang muncul dari mulut mereka ini adalah ucapan duka cita untuk diri mereka sendiri seperti orang yang tidak mampu berbuat sesuatu kemudian mencelanya. Karena itulah Allah subhanahu wata’ala berfirman, “Karena mereka tidak mendapat petunjuk dengannya, maka mereka berkata, ‘Ini adalah dusta yang lama’.” Artinya, penyebab yang membuat mereka melakukan hal itu adalah mereka tidak mendapat petunjuk al-Qur’an ini, merekapun tidak mendapat karunia terbesar dan keinginan paling agung. Mereka tidak menerima al-Qur’an karena mereka berdusta, padahal al-Qur’an adalah kebenaran yang tidak ada keraguan dan tidak bisa ditambah. Al-Qur’an sesuai dengan kitab samawi sebelumnya dari segi kesempurnaan dan keutamaan yaitu kitab Taurat yang di turunkan oleh Allah subhanahu wata’ala kepada “Musa, sebagai petunjuk dan rahmat.” Artinya, di teladani oleh Bani Israil dan dijadikan petunjuk dan mereka pun mendapatkan kebaikan dunia dan akhirat. “Dan ini,” yakni al-Qur’an, “adalah kitab yang membenarkannya,” yakni, membenarkan kitab-kitab sebelumnya dan bersaksi atas kebenarannya karena sesuai dengan kitab-kitab sebelumnya. Allah menjadikannya “dalam Bahasa Arab,” agar mudah dibaca dan diingat, “untuk memberi peringatan kepada orang-orang yang zhalim” terhadap diri mereka dengan kekufuran, kefasikan, dan pembangkangan bahwa jika mereka terus menerus dalam kedzakiman, maka mereka akan mendapatkan siksaan. Dan juga memberikan kabar gembira bagi orang-orang yang berbuat baik dengan menyembah sang Khaliq dan yang berguna bagi orang lain dengan pahala yang besar di dunia dan di akhirat dan diberi peringatan akan amalan-amalan yang diperingatan dan amalan-amalan yang digembirakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 11: Berkata orang-orang yang mendustakan kenabian Muhammad ﷺ yaitu dari dedengkot Quraisy : Kalau saa beriman dengan Al Qur’an dan agama ini adalah kebenaran, maka telah mendahului kami oang-orang miskin. Mereka berkata dengan sombong, dan kebenaran tidak berdampak kepada mereka, karena sebab mereka adalah para pembesar dan orang-orang yang kaya. Adapun para sahabat Muhammad ﷺ mereka adalah orang-orang lemah dan miskin; Dimana mereka (orang-orang Quraisy) tidak mendapatkan petunjuk dengan Al Qur’an karena kesombongan mereka, dan tidak berguna kebenaran pada mereka, mereka mencela dan mencela, mereka berkata : Sesungguhnya Al Qur’an adalah bualan, tidaklah di dalamnya kecuali hanya dongeng orang-orang terdahulu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menolak kebenaran lagi menentangnya. Ada pula yang menafsirkan dengan “beriman.” Maksud ayat ini ialah bahwa orang-orang kafir itu mengejek orang-orang Islam dengan mengatakan, kalau sekiranya Al Quran ini benar tentu kami lebih dahulu beriman kepadanya daripada mereka itu, yaitu orang-orang miskin dan lemah seperti Bilal, 'Ammar, Suhaib, Habbab radhiyallahu anhum dan lain-lain. Padahal siapakah yang lebih bersih jiwanya dan sempurna akalnya daripada orang-orang mukmin itu? Ucapan yang muncul dari mereka ini, mereka maksudkan untuk menghibur diri mereka seperti halnya orang yang tidak mendapatkan sesuatu lalu segera mencelanya. Ini sebab mereka berkata seperti itu, yakni karena mereka tidak mendapat petunjuk dari Al Qur’an ini dan kehilangan pemberian yang paling besar serta harapan yang paling agung, maka mereka berkata bahwa Al Qur’an adalah dusta, padahal ia adalah kebenaran yang tidak ada lagi keraguan di dalamnya; yang sesuai dengan kitab-kitab samawi (dari langit), khususnya kitab samawi yang paling lengkap dan paling utama setelah Al Qur’an yaitu Taurat yang Allah turunkan kepada Nabi Musa ‘alaihis salam yang menjadi petunjuk dan rahmat bagi Bani Israil sehingga mereka memperoleh kebaikan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 11",
    "description": "Orang-orang kafir tetap menolak beriman kepada Al-Qur'an walaupun bukti-bukti kebenaran Al-Qur'an telah jelas dinyatakan kepada mereka. Kini mereka mengolok-olok Al-Qur'an dengan mengatakan bahwa Al-Qur'an itu tidak lain adalah dongengan orang-orang terdahulu. Dan orang-orang yang kafir kepada Allah dan rasul-Nya berkata kepada orang-orang yang beriman, 'sekiranya keimanan kepada Al-Qur'an itu sesuatu yang baik, lebih baik dari tradisi yang kami dapati dari nenek moyang kami tentu mereka orang-orang yang beriman yang miskin dan rendah kedudukan sosialnya tidak pantas mendahului kami, orang-orang yang kaya lagi tinggi kedudukan sosialnya beriman kepadanya, yakni kepada Al-Qur'an. ' tetapi disebabkan oleh karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata, ini adalah dusta yang lama. ' mereka mengingkari Al-Qur'an dan mengatakan bahwa apa yang tertulis di dalamnya hanyalah dongeng masa lalu yang berisi kebohongan. 12. Untuk menunjukkan kebenaran Al-Qur'an, Allah menyatakan pada ayat ini bukti yang lain yaitu diturunkannya kitab taurat kepada nabi musa. Tidak lain Al-Qur'an itu diturunkan untuk membenarkan dan menyempurnakan kandungan kitab taurat dan kitab-kitab yang diturunkan sebelumnya. Dan sebelum turunnya Al-Qur'an telah ada kitab musa, yaitu kitab taurat, sebagai imam, yakni petunjuk atau teladan dan rahmat bagi orang-orang bani isra'il yang beriman. Dan Al-Qur'an ini, adalah kitab yang membenarkan kandungannya, yang tersusun dalam dalam bahasa arab untuk memberi peringatan kepada orang-orang yang zalim yang berbuat aniaya kepada dirinya dengan menyekutukan tuhan dan memberi kabar gembira kepada orang-orang yang senantiasa berbuat baik bahwa mereka akan masuk surga dan kekal di dalamnya selama-lamanya."
  }
]