[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebelum al-Quran ini, Kami telah menurunkan Taurat sebagai imam (pemandu) bagi Bani Israil, mereka mengikutinya, dan sebagai rahmat bagi siapa yang beriman dan mengamalkannya. Dan al-Quran ini membenarkan kitab-kitab yang turun sebelumnya. Kami menurunkannya dengan Bahasa Arab agar ia memperingatkan orang-orang yang menzhlimi diri mereka dengan kekafiran dan kemaksiatan, memberi kabar baik bagi orang-orang yang menaati Allah, dan berbuat baik dalam iman dan ketaatan mereka di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan sebelum munculnya Al-Qur`ān ini ada Taurat, kitab yang diturunkan Allah kepada Musa -'alaihissalām- sebagai imam yang dijadikan sebagai petunjuk menuju kebenaran dan menjadi rahmat bagi orang yang mengimaninya dan mengikutinya dari kalangan Bani Israil. Dan Al-Qur`ān yang diturunkan kepada Muhammad ini adalah kitab yang membenarkan kitab-kitab yang sebelumnya, dengan bahasa Arab untuk memperingatkan orang-orang yang menganiaya diri mereka sendiri dengan melakukan syirik terhadap Allah dan mengerjakan maksiat, dan dia adalah kabar gembira bagi orang-orang yang berbuat baik yang memperbaiki hubungan mereka dengan Pencipta mereka dan hubungan mereka dengan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَمِن قَبْلِهِۦ كِتٰبُ مُوسَىٰٓ( Dan sebelum Al Quran itu telah ada kitab Musa) Yakni kitab Musa, yaitu Taurat yang mendahului al-Qur’an. Dua kitab ini sesuai dalam asas-asas syari’at, hal ini menunjukkan bahwa al-Qur’an adalah benar dan berasal dari Allah. إِمَامًا وَرَحْمَةً ۚ( sebagai petunjuk dan rahmat) Yang menjadi pedoman dalam agama, dan ia adalah rahmat Allah bagi orang yang mengimaninya. وَهٰذَا كِتٰبٌ مُّصَدِّقٌ(Dan ini (Al Quran) adalah kitab yang membenarkannya) Yakni membenarkan kitab Musa yang merupakan petunjuk dan rahmat, dan juga membenarkan kitab-kitab Allah yang lain. لِّسَانًا عَرَبِيًّا(dalam bahasa Arab) Yakni menggunakan bahasa Arab yang mereka pahami. لِّيُنذِرَ الَّذِينَ ظَلَمُوا۟( untuk memberi peringatan kepada orang-orang yang zalim) Yakni memperingatkan dari azab Allah, sehingga tidak ada alasan lagi bagi mereka. وَبُشْرَىٰ لِلْمُحْسِنِينَ (dan memberi kabar gembira kepada orang-orang yang berbuat baik) Yakni kesudahan mereka adalah kemenangan dan surga sebagai balasan kebaikan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sebelum Alquran turun, Kami jadikan Taurat kitab Musa sebagai tuntunan dan sebab turunnya rahmat bagi Bani Israil. Sesungguhnya Alquran ini adalah pembenaran terhadap kitab-kitab samawi yang turun sebelumnya. Alquran termaktub dengan bahasa Arab yang fushha (fasih), agar orang-orang musyrik Makkah yang mendholimi dirinya sendiri dalam kekafiran bisa mengambil peringatan dan pelajaran, juga sebagai pemberi kabar gembira kepada orang-orang mukmin dan orang-orang yang senantiasa berbuat kebaikan dengan balasan surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebelum itu} sebelum Al-Qur’an {ada kitab Musa sebagai panutan dan rahmat. (Al-Qur’an) ini adalah kitab yang membenarkan} Al-Qur’an ini membenarkan kitab-kitab sebelumnya {yang berbahasa Arab untuk memberi peringatan kepada orang-orang yang zalim dan memberi kabar gembira kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-12. Artinya, mereka mengingkari dan menentang kebenaran serta menolak seruan Nabi Muhammad sholallohu ‘alaihi wasallam dengan berkata, “Kalau sekitarnya ia (al-Qur’an) adalah suatu yang baik, tentu tidak mendahului kami ( beriman ) kepadanya.” Artinya, tentu tidak di dahului orang-orang beriman dan tentu kami adalah orang-orang yang pertama mendahuluinya. Pertanyaan mereka ini merupakan kepalsuan. Bukti apa yang bisa menunjukan bahwa tanda-tanda kebenaran itu pasti di dahului oleh mereka yang mendustakan, bukan orang-orang yang percaya terlebih dahulu? Apakah jiwa mereka paling bersih, akalnya paling sempurna atau apakah petunjuk ada di tangan mereka? Hanya saja perkataan yang muncul dari mulut mereka ini adalah ucapan duka cita untuk diri mereka sendiri seperti orang yang tidak mampu berbuat sesuatu kemudian mencelanya. Karena itulah Allah subhanahu wata’ala berfirman, “Karena mereka tidak mendapat petunjuk dengannya, maka mereka berkata, ‘Ini adalah dusta yang lama’.” Artinya, penyebab yang membuat mereka melakukan hal itu adalah mereka tidak mendapat petunjuk al-Qur’an ini, merekapun tidak mendapat karunia terbesar dan keinginan paling agung. Mereka tidak menerima al-Qur’an karena mereka berdusta, padahal al-Qur’an adalah kebenaran yang tidak ada keraguan dan tidak bisa ditambah. Al-Qur’an sesuai dengan kitab samawi sebelumnya dari segi kesempurnaan dan keutamaan yaitu kitab Taurat yang di turunkan oleh Allah subhanahu wata’ala kepada “Musa, sebagai petunjuk dan rahmat.” Artinya, di teladani oleh Bani Israil dan dijadikan petunjuk dan mereka pun mendapatkan kebaikan dunia dan akhirat. “Dan ini,” yakni al-Qur’an, “adalah kitab yang membenarkannya,” yakni, membenarkan kitab-kitab sebelumnya dan bersaksi atas kebenarannya karena sesuai dengan kitab-kitab sebelumnya. Allah menjadikannya “dalam Bahasa Arab,” agar mudah dibaca dan diingat, “untuk memberi peringatan kepada orang-orang yang zhalim” terhadap diri mereka dengan kekufuran, kefasikan, dan pembangkangan bahwa jika mereka terus menerus dalam kedzakiman, maka mereka akan mendapatkan siksaan. Dan juga memberikan kabar gembira bagi orang-orang yang berbuat baik dengan menyembah sang Khaliq dan yang berguna bagi orang lain dengan pahala yang besar di dunia dan di akhirat dan diberi peringatan akan amalan-amalan yang diperingatan dan amalan-amalan yang digembirakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 12: Allah mengabarkan bahwa sebelum turunnya Al Qur’an ini, maka diturunkan Taurat kepada Musa yang di dalamnya terdapat petunjuk dan cahaya; Menunjuki dengannya orang-orang bani israil, kemudian datanglah Al Qur’an ini yang isinya membenarkan akan Taurat dan kitab-kitab sebelumnya yang diturunkan Allah dan mnyetujui kitab-kitab tersebut; Dan Allah menurunkan Al Qur’an dengan lisan arab, agar Nabi menjadikan padanya peringatan ﷺ kepada kaumnya yang mereka di dalam kegelapan diri-diri mereka dengan kesyirikan dan maksiat. Dan memberi kabar gembira bagi orang-orang yang ikhlas beribada kepada Tuhan mereka, dan orang-orang yang ikhlas beribadah kepada Allah akan mendapatkan kemenangan, keberuntungan dan keberhasilan di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni membenarkan kitab-kitab yang terdahulu, ia (Al Qur’an) menjadi saksi terhadap kebenaran kitab-kitab itu dan ia (Al Qur’an) dibenarkan pula oleh kitab-kitab sebelumnya. Agar mudah diterima dan mudah dipelajari. Yang menzalimi diri mereka dengan kekufuran, kefasikan dan kemaksiatan jika mereka tetap terus di atasnya, yaitu diberi peringatan dengan azab yang buruk. Baik dalam beribadah kepada Tuhan mereka maupun dalam memberikan manfaat kepada manusia, yaitu diberi kabar gembira dengan pahala yang banyak, di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 12",
    "description": "Untuk menunjukkan kebenaran Al-Qur'an, Allah menyatakan pada ayat ini bukti yang lain yaitu diturunkannya kitab taurat kepada nabi musa. Tidak lain Al-Qur'an itu diturunkan untuk membenarkan dan menyempurnakan kandungan kitab taurat dan kitab-kitab yang diturunkan sebelumnya. Dan sebelum turunnya Al-Qur'an telah ada kitab musa, yaitu kitab taurat, sebagai imam, yakni petunjuk atau teladan dan rahmat bagi orang-orang bani isra'il yang beriman. Dan Al-Qur'an ini, adalah kitab yang membenarkan kandungannya, yang tersusun dalam dalam bahasa arab untuk memberi peringatan kepada orang-orang yang zalim yang berbuat aniaya kepada dirinya dengan menyekutukan tuhan dan memberi kabar gembira kepada orang-orang yang senantiasa berbuat baik bahwa mereka akan masuk surga dan kekal di dalamnya selama-lamanya. 13-14. Ayat sebelumnya ditutup dengan kabar gembira bagi orang-orang yang berbuat baik. Kini dijelaskan tentang keadaan dari orang-orang yang berbuat baik itu, yaitu sesungguhnya orang-orang yang berkata, 'tuhan kami, pemelihara kami, adalah Allah, ' kemudian mereka tetap istiq'mah bersungguh-sungguh meneguhkan pendirian mereka dengan melaksanakan tuntunan Allah, maka tidak ada rasa khawatir, tidak ada rasa takut pada mereka berkaitan dengan apa yang akan terjadi bagaimana pun dahsyatnya, dan tidak pula mereka bersedih hati apa pun keadaan yang dialami. Kelak di akhirat, mereka itulah para penghuni surga, kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan."
  }
]