[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang berkata, “Tuhan kami adalah Allah.” kemudian mereka berpegang teguh kepada iman tersebut, maka tidak ada ketakutan atas mereka dari kegoncangan dan kengerian Hari Kiamat, mereka juga tidak sedih atas apa yang mereka tinggalkan di belakang mereka dari bagian dunia yang tidak mereka raih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Sesungguhnya orang-orang yang berkata, “Rabb kami adalah Allah, kami tidak mempunyai Rabb lagi selain-Nya.” Kemudian mereka istikamah dalam keimanan dan amal saleh, maka tidak ada ketakutan bagi mereka pada apa yang akan mereka hadapi nanti di Akhirat, dan tidak pula mereka bersedih atas kekayaan dunia yang tidak mereka dapatkan ataupun kekayaan dunia yang mereka tinggalkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Orang-orang yang pada diri mereka terdapat tauhid -yang merupakan inti dari ilmu- dan keistiqamahan dalam perkara agama -yang merupakan puncak dari amalan-, maka mereka tidak akan mendapat ketakutan dari kengerian hari kiamat, dan tidak pula merasa sedih atas perkara dunia yang mereka lewatkan. Orang-orang yang memiliki derajat yang tinggi itu adalah para penghuni surga yang kekal di dalamnya, mereka mendapat kenikmatan ini sebagai balasan atas amal shalih yang telah mereka kerjakan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. إِنَّ الَّذِينَ قَالُوا۟ رَبُّنَا اللهُ ثُمَّ اسْتَقٰمُوا۟ (Sesungguhnya orang-orang yang mengatakan: “Tuhan kami ialah Allah”, kemudian mereka tetap istiqamah) Mereka mengesakan Allah dan teguh di atas syari’at-Nya. فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ(maka tidak ada kekhawatiran terhadap mereka dan mereka tiada (pula) berduka cita) Yakni mereka tidak takut akan terjerumus ke dalam hal yang tidak mereka harapkan, dan mereka tidak merasa sedih atas terlewatnya hal yang mereka sukai; keadaan mereka ini berlangsung selamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sesungguhnya orang-orang yang berkata: “Tuhan kami adalah Allah Yang Maha Esa, tidak ada sekutu bagi-Nya. Kemudian mereka tetap istiqamah dalam menjalankan syariat. Mereka menyelaraskan antara tauhid dan taat terhadap syariat. Sehingga tidak ada lagi ketakutan dalam diri mereka terhadap hiruk pikuk hari kiamat. Mereka juga tidak merasa sedih ketika kehilangan segala yang mereka cintai selama di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang berkata,“Tuhan kami adalah Allah” kemudian tetap istiqamah, maka tidak ada rasa takut pada mereka, dan mereka tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Maksudnya, sesungguhnya orang-orang yang mengakui Rabb mereka dan bersaksi akan keesaanNya, melaksanakan ketaatan secara kontinu dan “tetap istiqamah,” selama mereka hidup, “maka tidak ada kekhawatiran,” terhadap segala sesuatu yang ada di hadapan mereka, “dan mereka (tiada) pula berduka cita,” atas segala sesuatu yang telah mereka tinggikan setelahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 13: Ketahuilah wahai manusia mereka yang berkata : Rabb kami adalah Allah kemudian mereka istiqamah di atas agama dan syariat, atau mereka mengumpulkan antara ketauhidan, keikhlasan dan amalan salih serta terus menerus di atasnya; Maka mereka tidak akan takut dari kedahsyatan pada hari kiamat dan keadaan padanya, mereka tidak akan bersedih atas apa yang dibelakang mereka setelah kematian dari nasib di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Istiqamah ialah teguh pendirian dalam tauhid dan tetap beramal saleh. Yakni mereka yang mengakui Tuhan mereka, menyaksikan keesaan-Nya dan menaati-Nya serta konsisten di atasnya selama mereka masih hidup, maka tidak ada kekhawatiran atas mereka terhadap keburukan yang ada di hadapan mereka dan tidak pula mereka bersedih hati terhadap yang mereka tinggalkan di belakang mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 13",
    "description": "13-14. Ayat sebelumnya ditutup dengan kabar gembira bagi orang-orang yang berbuat baik. Kini dijelaskan tentang keadaan dari orang-orang yang berbuat baik itu, yaitu sesungguhnya orang-orang yang berkata, 'tuhan kami, pemelihara kami, adalah Allah, ' kemudian mereka tetap istiq'mah bersungguh-sungguh meneguhkan pendirian mereka dengan melaksanakan tuntunan Allah, maka tidak ada rasa khawatir, tidak ada rasa takut pada mereka berkaitan dengan apa yang akan terjadi bagaimana pun dahsyatnya, dan tidak pula mereka bersedih hati apa pun keadaan yang dialami. Kelak di akhirat, mereka itulah para penghuni surga, kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan"
  }
]