[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami berwasiat kepada manusia agar memperlakukan bapak ibunya dengan baik semasa keduanya hidup dan sesudah keduanya wafat. Ibunya telah mengandungnya saat dia masih berupa janin dalam rahimnya dengan penuh kelelahan dan kepayahan, lalu melahirkannya dengan penuh kelelahan dan kepayahan juga. Masa kehamilan dan penyapihan adalah 30 bulan. Disebutnya beban berat yang dipikul ibu bukan bapak ini menunjukkan bahwa hak ibu lebih besar dari hak bapak. Saat manusia mencapai puncak kekuatan pada akal dan jasmaninya, dia mencapai umur 40 tahun, dia berdoa kepada Tuhannya dengan berkata, “Wahai Tuhanku, bimbinglah aku untuk mensyukuri nikmatMu yang telah Engkau berikan kepadaku dan kepada bapak-ibuku. Jadikanlah aku orang yang beramal shalih yang Engkau ridhai. Perbaikilah anak keturunanku untukku. Sesungguhnya aku bertaubat kepadaMu dari dosa-dosaku. Sesungguhnya aku termasuk orang-orang yang tunduk kepadaMu, menaatiMu, berserah diri kepada perintah dan laranganMu, serta patuh kepada hukumMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan Kami telah memerintahkan kepada manusia suatu perintah yang kuat agar berbuat baik kepada kedua orang tuanya dengan berbakti kepada keduanya dalam kehidupan mereka dan setelah kematian mereka dengan cara yang tidak menyalahi syariat, lebih khusus lagi kepada ibunya yang telah mengandungnya dengan penderitaan dan melahirkannya dengan penderitaan. Jarak antara mengandungnya hingga mulai menyapihnya tiga puluh bulan, hingga jika ia telah mencapai kesempurnaan kekuatan akalnya dan tubuhnya, ia berkata, “Wahai Rabb! Berilah aku petunjuk untuk mensyukuri kenikmatan yang telah Engkau berikan kepadaku dan kepada kedua orang tuaku dan berilah aku petunjuk untuk mengerjakan amal saleh yang Engkau ridai dan terimalah dariku, serta perbaikilah untukku anak-anakku, sesungguhnya aku bertobat kepada-Mu atas dosa-dosaku dan sesungguhnya aku termasuk orang-orang yang tunduk kepada ketaatan-Mu dan pasrah kepada perintah-perintah-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Kami perintahkan manusia dengan tegas untuk berlaku bagi kepada kedua orangtua dalam perkataan dan perbuataannya. Ibunya telah mengandungnya dengan penuh kesulitan dan melahirkannya dengan penuh kesulitan pula. Masa mengandung dan menyusuinya adalah 30 bulan Qamariyah. Dan ketika ia telah sampai pada usia dimana ia telah memiliki tubuh dan akal yang kuat dan sampai pada usia 40 tahun, ia berkata: “Ya Tuhanku, ilhamkanlah kepadaku agar aku mensyukuri kenikmatan-Mu yang agung ini, yang telah Engkau berikan kepadaku dan kepada kedua orangtuaku berupa kenikmatan dalam perkara agama dan dunia. Dan berilah kepadaku taufikmu dalam menjalankan amal shalih yang Engkau terima. Serta jadikanlah anak cucuku dan keturunan mereka sebagai orang-orang yang shalih. Sungguh aku bertaubat kepada-Mu dari semua dosaku, dan aku adalah termasuk orang yang taat kepada-Mu dan tunduk kepada perintah-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَوَصَّيْنَا الْإِنسٰنَ بِوٰلِدَيْهِ إِحْسٰنًا ۖ (Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya) Yakni dan Kami wasiatkan kepadanya agar berbuat baik kepada kedua orang tua. حَمَلَتْهُ أُمُّهُۥ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ( ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula)) Yakni ibunya mengandungnya dalam perut dengan penuh kesusahan, begitu pula ketika dia melahirkannya. وَحَمْلُهُۥ وَفِصٰلُهُۥ ثَلٰثُونَ شَهْرًا ۚ( Mengandungnya sampai menyapihnya adalah tiga puluh bulan) Yakni demikianlah waktu yang dibutuhkan, mulai dari awal kehamilannya sampai masa penyapihan. Kemudian kedua orang tua akan bersusah payah dalam mengasuhnya sampai dia dapat hidup mandiri. حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ(sehingga apabila dia telah dewasa) Yakni sampai ketika telah sempurna kekuatan dan akalnya. وَبَلَغَ أَرْبَعِينَ سَنَةً(dan umurnya sampai empat puluh tahun) Ini menunjukkan bahwa sampai pada umur empat puluh tahun merupakan masa setelah memasuki masa dewasa. قَالَ رَبِّ أَوْزِعْنِىٓ( ia berdoa: “Ya Tuhanku, tunjukilah aku) Yakni ilhamilah kepadaku. أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وٰلِدَىَّ(untuk mensyukuri nikmat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku) Yakni ilhamilah aku agar dapat mensyukuri atas hidayah yang telah Engkau berikan kepadaku dan atas rasa kasih sayang kedua orang tua terhadapku yang telah mengasuhku saat aku masih kecil. وَأَنْ أَعْمَلَ صٰلِحًا تَرْضَىٰهُ(dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai) Dan ilhamilah aku agar melakukan amal shalih yang Engkau ridhai. وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ ۖ( berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku) Yakni jadikanlah anak keturunanku orang-orang yang benar-benar shalih. Diriwayatkan bahwa ayat ini diturunkan untuk Abu Bakar. إِنِّى تُبْتُ إِلَيْكَ(Sesungguhnya aku bertaubat kepada Engkau) Dari dosa-dosaku. وَإِنِّى مِنَ الْمُسْلِمِينَ(dan sesungguhnya aku termasuk orang-orang yang berserah diri) Yakni yang menyerahkan diri kepada-Mu dan tunduk dalam ketaatan-Mu serta ikhlas untuk mengesakan-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Kami telah memerintahkan manusia tentang perintah yang berkaitan dengan perhatian dan kepedulian dalam memperlakukan kedua orang tua mereka dengan baik. Ibu mereka telah mengandung dengan penuh kepayahan, melahirkan dengan kesakitan. Ibu mengandung dan menyapih mereka selama 30 bulan, disapih dari susunya ketika berumur 2 tahun. Masa kandungan paling singkat adalah 6 bulan sehingga sampai mencapai kekuatan raga dan akal secara maksimal. Sehingga ketika dia telah dewasa yang ditandai dengan maksimalnya akal, pemikiran dan kekuatan atau sudah mencapai umur 40 tahun, usia dimana kemampuan jiwa dan raga dikatakan maksimal. Kemudian ketika itu juga mereka berkata: “Ya Tuhan kami ilhamkanlah kepada kami agar bisa selalu bersyukur terhadap berbagai nikmat di dunia yang Engkau anugerahkan kepadaku juga kepada kedua orang tuaku. Tuntunlah aku untuk berbuat kebaikan yang Engkau ridhoi. Jadikan keluargaku selalu dinaungi dan selalu ditetapkan dalam kebaikan, yaitu ketakwaan. Aku sungguh bertaubat kepada-Mu atas semua dosaku. Aku termasuk orang-orang yang tunduk dan patuh atas perintahmu.” Ayat ini turun untuk Abu Bakar Ash Shiddiq radliyallahu ‘anhu yang telah memeluk Islam dan mengimani rasulullah. Saat itu beliau Abu Bakar berumur 38 tahun, seiring dengan diangkatnya nabi Muhammad SAW saat berusia 40 tahun. Ketika Abu Bakar berusia 40 tahun beliau berkata: “Ya Allah ilhamkanlah kami agar bisa selalu bersyukur terhadap berbagai nikmat-Mu....”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah mewasiatkan} Kami telah memerintahkan {kepada manusia agar berbuat baik kepada kedua orang tuanya. Ibunya telah mengandungnya dengan susah payah} dengan menderita {dan melahirkannya dengan susah payah. Mengandung dan menyapihnya} menyapihnya {selama tiga puluh bulan. Sehingga apabila telah dewasa} sempurna kekuatan badan dan akalnya {dan umurnya mencapai empat puluh tahun, dia berkata,“Wahai Tuhanku, berilah petunjuk} ilhamkanlah kepadaku {agar aku dapat mensyukuri nikmatMu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku, dapat beramal shalih yang Engkau ridhai, dan berikanlah keshalihan kepadaku sampai anak cucuku. Sesungguhnya aku bertaubat kepadaMu dan sesungguhnya aku termasuk orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Ayat ini adalah di antara bentuk kasih Allah kepada para hambaNya dan balasan baikNya terhadap para orang tua. Allah berwasiat dan memerintahkan para anak untuk berbuat baik terhadap orang tua dengan berkata yang lemah lembut, memberikan nafkah dan uang serta perbuatan baik lainnya, selanjutnya Allah menjelaskan sebab mengapakah berbuat baik terhadap orang tua diwajibkan, Allah menyebutkan beban mengandung yang ditanggung oleh seorang ibu serta berbagai rasa sakit yang dihadapi pada saat mengandung., selanjutnya beban berat pada saat melahirkan merupakan beban yang teramat besar, dilanjutkan lagi dengan beban menyusui dan merawat. Semua beban berat tersebut tidak berlangsung hanya sesaat, namun hal itu berlangsung dalam waktu yang lama yaitu, “tiga puluh bulan,” menjalani hamil menghabiskan waktu Sembilan bulan, bisa kurang bisa lebih, sedangkan sisanya untuk menyusui, dan waktu ini berdasarkan pada umumnya. Dari ayat ini dan ayat lainnya, “para ibu menyusui anak-anaknya selama dua tahun penuh,” bisa dijadikan dalil bahwa batas minimal lamanya hamil adalah enam bulan sebab masa menyusui, yaitu dua tahun, jika tiga puluh bulan dikurangi waktu menyusui tersebut maka masih tersisa enam bulan untuk masa hamil. “Sehingga apabila ia telah dewasa,” yaitu mencapai puncak kekuatan dan kematangan akal, “dan umurnya samapi empat tahun, ia berdoa, ‘Ya Rabbku, tunnjukilah aku’,” artinya, berilah aku ilham dan pertolongan “untuk mensyukuri nikmatMu yang telah Engkau berikan kepadaku dan kepada ibu bapakku,” yakni nikmat agama dan dunia serta rasa syukurnya dengan menggunakan kenikmatan tersebut dalam ketaatan terhadap Dzat yang memberi serta berusaha dengan sungguh-sunggguh memuji Allah atas nikmat yang diberi. Nikmat yang dimiliki orang tua adalah nikmat yang dimiliki anak dan juga keturunan mereka, sebab mereka itu (anak-anak dan keturunannya) pasti akan mendapatkannya, mendapatkan sebab-sebab dan sisa-sisanya, khususnya nikmat agama, karena keshalihan orang tua dengan ilmu dan amal adalah factor kebaikan dan keshalihan terbesar bagi anak-anak. “Dan supaya aku dapat berbuat amal yang shalih yang Engkau ridhai,” yakni mencakup semua yang menjadikannya baik dan bebas dari apa-apa yang merusaknya. Dan inilah amal yang diridhai, diterima, dan dibalas dengan pahala oleh Allah. “Dan berilah kebaikan kepadaku dengan (menberi kebaikan) kepada anak cucuku.” Tatkala beliau berdoa untuk kebaikan dan keshalehan diri, tidak lupa beliau mendoakan kebaikan dan keshalihan bagi keturunannya agar Allah berkenan memperbaiki keadaan mereka. Dan Allah menyebutkan bahwa manfaat kebaikan dan keshalihan keturunan akan berpulang pada orang tua mereka, berdasarkan FirmanNya, “Dan berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku.” “Sesungguhnya aku bertaubat kepadaMu,” dari segala dosa dan kemaksiatan, aku kembali kepadaMju dengan ketaatan. “dan sesungguhnya aku termasuk orang-orang yang berserah diri.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 15: Allah memerintahkan manusia agar berbuat baik kepada orang tuanya dan agar mendahulukan mereka berdua dalam menjalankan kebaikan serta memuliakan mereka. Ibunya sungguh telah mengandung dan melahirkan dengan susah payah dan disapih ketika telah mencapai 30 bulan; Dan penyebutan bukti kepayahan ini adalah sebagai dalil bahwa hak ibu lebih besar daripada hak kepada bapak. Maka jika manusia telah sampai kesempurnaan dalam kekuatan, akal dan telah mencapai usia 40 tahun, Allah berkata : Rabbku, (ilhamkan) berikan aku rasa syukur atas nikmatmu yang Engkau berikan kepadaku dan kepada kedua orang tuaku. Dan tetapkan aku agar terus beramal shalih menurut yang Engkau ridhai, dan jadikanlah keturunanku orang-orang yang baik; Sungguh aku bertaubat kepada-Mu dengan taubat yang sesungguhnya (nasuha), dan sunggu aku termasuk orang-orang yang berserah diri kepada-Mu dan mengerjakan apa yang Engkau perintahkan dan larang. Dalam ayat ini terdapat syubhat yang bahwasanya Allah mengulang-ulang wasiat bagi anak kepada bapak dalam sepuluh tempat kurang lebih dan ayah tidak mewasiatkan kepada anak-anaknya kecuali hanya dalam warisan sebagaimana dalam surat An Nisa, maka sebab dari permasalahan ini dijelaskan oleh ustadz jurusan tafsir kami yaitu Syaikh Muhammad Amin Asy Syinqithi penulis Adhwaul Bayan, beliau berkata : Karena berbuat baiknya anak kepada bapak mereka adalah kewajiban dan ketaatan dan bukan sebagaimana kepemimpinan dan perhatian seorang bapak kepada anak-anak mereka yang itu adalah sudah menjadi watak, bawaan dan tabiat kepada anak-anaknya. Kemudian Syaikh menambahkan : Dan bahwasanya seorang bapak menjadi sebab dalam adanya seorang anak, dan Allah Dialah yang menjadikan sebab di antara seluruh sebab, Dialah pencipta, dan bahwasanya barangsiapa luput dan abai atas hak kedua orang tua, akan pantas pula diabaikan dan luput dari hak yang menjadikan sebab yaitu Allah. Makna dari كُرْهًۭا adalah payah dan menderita serta sakit yang diderita oleh seorang ibu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini termasuk kelembutan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya dan syukur-Nya kepada mereka; Dia memerintahkan manusia untuk berbuat baik kepada kedua orang tua mereka baik dengan berkata yang lembut dan halus, memberi nafkah dan perbuatan lainnya yang termasuk ihsan. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan sebab yang mengharuskan demikian, yaitu karena ibunya mengandungnya dengan merasakan penderitaan saat mengandung, lalu penderitaan saat melahirkan dan penderitaan saat menyusui dan mengasuhnya, dan waktunya tidak sebentar; tidak satu jam atau dua jam; bahkan dalam waktu yang cukup lama, yaitu 30 bulan; untuk hamilnya sembilan bulan dan sisanya untuk menyusui, ini menurut rata-rata. Ulama berdalil dengan ayat ini, bahwa masa kehamilan paling sedikit adalah enam bulan, karena masa menyusui selama dua tahun, sehingga 30 bulan dikurang 24 bulan sama dengan 6 bulan. Yakni telah sempurna kekuatannya, akalnya, dan pandangannya, dimana paling sedikitnya adalah 30 atau 33 tahun. Baik nikmat agama maupun nikmat dunia. Mensyukurinya adalah dengan menggunakan nikmat-nikmat itu untuk menaati pemberi nikmat, mengakuinya dan merasa dirinya kurang bersyukur serta bersungguh-sungguh dalam memuji Allah Subhaanahu wa Ta'aala. Nikmat yang Allah berikan kepada orang tua kita merupakan nikmat bagi kita. Di antara sekian nikmat yang Allah limpahkan kepada orang tua kita yang paling besarnya adalah nikmat beragama Islam dan mengamalkannya sehingga kita dapat mengikutinya. Setelah ia berdoa kepada Allah untuk kebaikan dirinya, maka dia berdoa kepada Allah untuk kebaikan anak cucunya, yaitu agar Allah memperbaiki keadaan mereka, dan bahwa kesalihan mereka manfaatnya kembali juga kepada kedua orang tua mereka. Dari dosa dan maksiat serta kembali menaati-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 15",
    "description": "Ayat-ayat yang lalu menjelaskan tuntunan tentang pemurnian akidah disertai perintah agar mengesakan Allah dan tidak menyekutukan kepada-Nya. Kini Allah mewasiatkan kepada umat manusia agar berbuat baik kepada kedua orang tua. Dan kami telah mewasiatkan, yakni telah perintahkan kepada manusia agar berbuat baik kepada kedua orang tuanya dengan kebaikan yang sempurna. Ibunya telah mengandungnya dengan susah payah, dan melahirkannya dengan susah payah pula. Masa mengandung sampai menyapihnya yang sempurna adalah selama tiga puluh bulan, sehingga apabila dia, sang anak itu telah dewasa dan umurnya mencapai empat puluh tahun, merupakan usia yang menunjukkan kesempurnaan bagi perkembangan jasmani dan rohani manusia, maka dia berdoa, 'ya tuhanku, berilah aku petunjuk agar aku dapat mensyukuri nikmat-Mu yang telah engkau limpahkan kepadaku dan kepada kedua orang tuaku dan berilah aku kemampuan agar aku dapat berbuat kebajikan yang engkau ridai; dan berilah aku kebaikan yang akan mengalir turun temurun sampai kepada anak cucuku. Sungguh, aku bertobat kepada engkau atas segala dosa-dosaku dan sungguh, aku termasuk orang muslim, yang tunduk patuh dan berserah diri kepada Allah. 16. Allah memuji orang-orang yang berbuat baik kepada orang tua dengan menyatakan bahwa mereka itulah orang-orang yang mensyukuri nikmat dan berbuat kebaikan yang kami terima amal baiknya yang telah mereka kerjakan dan kepada mereka kami anugerahkan pahala yang besar sebagai balasan atas amalnya dan mereka itulah orang-orang yang kami maafkan kesalahan-kesalahannya, maka kami tidak menimpakan azab atasnya. Kelak di akhirat, mereka akan menjadi penghuni-penghuni surga. Itu janji yang benar dari Allah yang telah dijanjikan melalui para utusan-Nya kepada mereka."
  }
]