[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu orang-orang yang Kami menerima amal shalih yang mereka lakukan, memaafkan keburukan mereka dalam rombongan para penghuni syurga. Janji yang Kami janjikan kepada mereka ini merupakan janji yang benar yang tidak ada keraguan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Orang-orang sedemikian inilah yang Kami terima dari mereka sebaik-baik amal saleh yang telah mereka kerjakan dan Kami maafkan keburukan amal perbuatan mereka, sehingga Kami tidak membalasnya dan mereka termasuk dalam golongan penghuni Surga. Janji yang dijanjikan kepada mereka ini adalah janji yang benar, pasti akan terjadi, tidak ada keraguan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Orang-orang yang bersyukur dan bertaubat itu adalah orang-orang yang memiliki derajat yang tinggi, yang amal shalih mereka Kami terima dan Kami ampuni dosa-dosa mereka, mereka termasuk penduduk surga. Inilah janji pasti yang Kami berikan bagi mereka melalui lisan para rasul Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. أُو۟لٰٓئِكَ(Mereka itulah) Yakni orang-orang yang menempuh jalan demikian. الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا۟( orang-orang yang Kami terima dari mereka amal yang baik yang telah mereka kerjakan) Yakni amal-amal kebaikan yang mereka kerjakan di dunia. وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمْ(dan Kami ampuni kesalahan-kesalahan mereka) Sehingga Kami tidak menghukum mereka karena kesalahan-kesalahan itu. فِىٓ أَصْحٰبِ الْجَنَّةِ ۖ( bersama penghuni-penghuni surga) Yakni termasuk golongan mereka yang teguh di atas jalan mereka. وَعْدَ الصِّدْقِ الَّذِى كَانُوا۟ يُوعَدُونَ(sebagai janji yang benar yang telah dijanjikan kepada mereka) Melalui lisan para Nabi ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Merekalah orang-orang yang senantiasa dikatakan pada mereka perkataan ini: “Merekalah orang-orang yang Kami terima amal baiknya di dunia. Kemudian akan Kami beri balasan pahala atas amal baik mereka sesuai dengan kebaikannya dengan keutamaan dan rahmat. Kami juga mengampuni dan membersihkan mereka dari dosa mereka, Kami tidak akan menyiksa mereka, karena mereka adalah golongan penghuni surga. Janji itu disampaikan melalui lisan para rasul ketika di dunia dengan janji yang benar untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang Kami terima amal terbaiknya yang telah mereka kerjakan, Kami memaafkan kesalahan-kesalahan mereka dan termasuk para penghuni surga. Itu merupakan janji yang benar yang dahulu dijanjikan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Mereka itulah,” orang-orang yang sifatnya disebutkan di atas, “orang-orang yang Kami terima dari mereka amal yang baik,” yaitu ketaatan, sebab mereka juga mengerjakan yang lainnya, “Kami ampuni kesalahan-kesalahan mereka, bersama,” golongan “penghuni-penghuni surga,” di mana mereka mendapatkan kebaikan dan kesenangan serta dihindarkan dari keburukan dan bencana. “Sebagai janji yang benar yang telah dijanjikan kepada mereka.” Artinya, janji yang Kami berikan kepada mereka ini adalah janji yang benar yang diucapkan oleh Allah yang tidak pernah mengingkari janjiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 16: Allah mengabarkan mereka anak-anak yang berbuat baik yang mereka telah lalu disebutkan, Allah mensifati mereka dengan sifat kebaikan, ketaatan dan beramal dengan amalan shalih. Kami hapuskan dan dan kami hilangkan keburukan-keburukan mereka, kami tidak mengadzab mereka, juga tidak menghukum mereka, mereka adalah penghuni surga yang menang. Ini adalah janji Allah yang benar, mereka dijanjikan di dunia, dan diampuni dihari pengampunan atas apa yang telah Allah janjikan kepada mereka, sebagai janji dari Allah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang telah disebutkan sifatnya di ayat sebelumnya. Yaitu amal ketaatan. Sehingga mereka memperoleh kebaikan dan sesuatu yang mereka cintai, dan mereka akan terhindar dari keburukan serta sesuatu yang mereka benci. Hal itu, karena janji tersebut adalah janji dari Allah yang tidak pernah mengingkari janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 16",
    "description": "Allah memuji orang-orang yang berbuat baik kepada orang tua dengan menyatakan bahwa mereka itulah orang-orang yang mensyukuri nikmat dan berbuat kebaikan yang kami terima amal baiknya yang telah mereka kerjakan dan kepada mereka kami anugerahkan pahala yang besar sebagai balasan atas amalnya dan mereka itulah orang-orang yang kami maafkan kesalahan-kesalahannya, maka kami tidak menimpakan azab atasnya. Kelak di akhirat, mereka akan menjadi penghuni-penghuni surga. Itu janji yang benar dari Allah yang telah dijanjikan melalui para utusan-Nya kepada mereka. 17. Selain menjelaskan tentang sikap orang-orang yang berbuat baik kepada kedua orang tua, Allah juga menjelaskan keadaan sebaliknya yaitu sikap orang-orang yang durhaka kepada kedua orang tua. Dan orang yang berkata kepada kedua orang tuanya, ketika kedua orang tuanya mengajaknya agar beriman kepada Allah, anaknya itu berkata; 'ah. ' ia tidak mau mengikuti nasihat kedua orang tuanya, lalu anak itu berkata, apakah kamu berdua memperingatkan kepadaku bahwa aku akan dibangkitkan dari kubur, padahal beberapa umat sebelumku telah berlalu dan banyak dari mereka tidak mempercayai hari kebangkitan itu'\" kedua orang tuanya tidak putus asa mengajak anaknya beriman kepada Allah. Lalu kedua orang tuanya itu memohon pertolongan kepada Allah seraya berkata, 'celaka kamu, berimanlah kepada Allah! sungguh, janji Allah akan datangnya hari kebangkitan itu benar dan pasti akan terjadi. ' tetapi anak itu tidak percaya, lalu dia berkata kepada kedua orang tuanya, 'ini hanyalah dongeng orang-orang dahulu. '."
  }
]