[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan adapun orang yang berkata kepada bapak ibunya ketika keduanya mengajaknya untuk beriman kepada Allah dan mengakui Hari Kiamat, “Keburukan untuk kalian berdua, apakah kalian mengancamku bahwa aku akan dikeluarkan dari kuburku dalam keadaan hidup, sementara orang-orang dari umat-umat sebelumku telah berlalu, mereka binasa dan tidak seorang pun dari mereka yang dibangkitkan?” sementara bapak ibunya berdoa kepada Allah memohon hidayah baginya dan berkata kepadanya, “Celaka kamu! Berimanlah, benarkanlah dan beramallah dengan amal yang shalih. Sesungguhnya janji Hari Kiamat dari Allah adalah haq, tidak ada kebimbangan padanya,.” Tetapi dia malah menjawab kepada mereka, “Apa yang kalian berdua katakan hanyalah dongeng orang-orang terdahulu, yang dinukil dari buku-buku mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan orang yang berkata kepada kedua orang tuanya, “Celaka kalian berdua, apakah kalian menjanjikan kepadaku bahwa aku akan dikeluarkan dari kuburku dalam keadaan hidup setelah kematianku, padahal telah berlalu berabad-abad dan manusia meninggal dalam abad itu dan tidak ada seorangpun dari mereka yang dibangkitkan dalam keadaan hidup?!” Dan kedua orang tuanya meminta pertolongan kepada Allah agar memberikan petunjuk pada anaknya kepada iman dan keduanya berkata kepada anaknya, “Celaka bagimu apabila engkau tidak beriman kepada hari Kebangkitan, maka berimanlah kepadanya, sesungguhnya janji Allah tentang kebangkitan itu benar adanya, tidak ada keraguan padanya.” Lalu anaknya menjawab mengulangi pengingkarannya terhadap hari kebangkitan, “Apa yang dikatakan tentang kebangkitan tidak lain hanyalah warisan dari kitab-kitab orang-orang terdahulu dan yang mereka tuliskan, tidak berasal dari Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Dan terdapat orang-orang yang mengingkari berbagai kenikmatan dari Allah, yaitu ketika seseorang terganggu dan menolak ketika kedua orangtuanya mengajaknya untuk beriman kepada Allah, ia berkata: “Apakah kalian berdua menjanjikan kepadaku bahwa aku akan dibangkitkan dari kubur dalam keadaan hidup; padahal banyak sekali umat-umat yang telah binasa sebelumku, namun tidak satupun dari mereka yang dibangkitkan?” Maka kedua orangtuanya memohon kepada Allah agar anaknya dapat mendapat hidayah, mereka berdua memperingatkannya: “Berimanlah kepada Allah, sungguh janji Allah untuk membangkitkan seluruh makhluk merupakan janji yang benar dan tidak diragukan lagi.” Namun anak itu menjawab mereka berdua dengan angkuh: “Apa yang kalian katakan itu hanyalah kedustaan yang diceritakan turun temurun dari nenek moyang.” Demikianlah orang-orang yang jauh dari kebenaran, mereka pasti akan mendapat azab bersama para jin dan manusia yang telah binasa sebelum mereka. Sungguh mereka adalah orang-orang yang merugi di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَالَّذِى قَالَ لِوٰلِدَيْهِ أُفٍّ لَّكُمَآ (Dan orang yang berkata kepada dua orang ibu bapaknya: bagi kamu keduanya ) Kata (أف) diucapkan ketika seseorang mengeluhkan sesuatu yang menimpanya. أَتَعِدَانِنِىٓ أَنْ أُخْرَجَ(apakah kamu keduanya memperingatkan kepadaku bahwa aku akan dibangkitkan) Kalian berdua memberitahukanku bahwa aku akan dibangkitkan dari kubur setelah kematianku sebagai janji dari Allah, padahal ini merupakan susuatu yang mustahil dan tidak dapat diterima. Apakah memang ada hari kebangkitan setelah mati? وَقَدْ خَلَتِ الْقُرُونُ مِن قَبْلِى(padahal sungguh telah berlalu beberapa umat sebelumku?) Mereka telah mati namun tidak ada seorangpun yang dibangkitkan. وَهُمَا يَسْتَغِيثَانِ اللهَ(lalu kedua ibu bapaknya itu memohon pertolongan kepada Allah seraya mengatakan) Yakni memohon dan berdoa kepada Allah agar anaknya mendapat taufik untuk beriman. وَيْلَكَ(Celaka kamu) Yakni mereka berdua berkata kepada anaknya: “celakalah kamu” ءَامِنْ(berimanlah!) Berimanlah kepada hari kebangkitan. إِنَّ وَعْدَ اللهِ حَقٌّ(Sesungguhnya janji Allah adalah benar”) Tidak akan diingkari. فَيَقُولُ(Lalu dia berkata) Ketika itu dia berkata karena keingkarannya terhadap apa yang kedua orang tuanya katakan. مَا هٰذَآ إِلَّآ أَسٰطِيرُ الْأَوَّلِينَ(“Ini tidak lain hanyalah dongengan orang-orang dahulu belaka”) Yakni hari kebangkitan yang kalian katakan itu hanyalah dongeng-dongeng orang terdahulu yang mereka tulis dalam kitab. Yang dia maksudkan dengan perkataannya ini bahwa kebangkitan hanyalah hal batil yang tidak dapat diterima oleh akal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Tentang apa yang dibacakan kepada kalian: Kabar tentang cerita ketika orang tua kalian meminta kepada kalian untuk beriman kepada Allah dan hari kiamat. Kalian menjawab dengan perkataan uffin atau “ah/cis” kepada kedua orang tua. Kata itu bermakna ¬aku bosan kepada kalian berdua (orang tua). “Apakah kalian berdua (orang tua) mengira bahwa aku akan dibangkitkan dari kubur setelah aku mati? Banyak para pendahulu kami yang tetap di dalam kubur setelah kematian mereka.” Kedua orang tua mereka meminta kepada Allah agar anak-anaknya diberikan hidayah untuk beriman kepada Allah. Orang tua mereka berkata: “Kamu akan celaka, berimanlah kepada hari kebangkitan dan kepada Allah semata. Sesungguhnya janji Allah tentang hari kebangkitan dan hari perhitungan adalah pasti terjadi, tidak ada keraguan lagi.” Anak-anak mereka lalu menjawab: “Semua perkataan tentang hari kebangkitan ini hanyalah cerita bohong dari orang zaman dahulu dan kesalahan-kesalahan mereka yang mereka tulis dalam kitab? Ayat ini turun untuk hamba yang kafir dan melawan orang tuanya, bukan untuk Abdur Rahman bin Abi Bakar, seperti diterangkan pada dalam sebagian riwayat. Sebab Abdur Rahman masuk Islam setelah itu, dan Islamnya teguh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang yang berkata kepada kedua orang tuanya,“Ah, kalian berdua”} buruknya kalian berdua {Apakah kalian berdua memperingatkanku bahwa aku akan dibangkitkan} Aku akan dibangkitkan dari kubur dalam keadaan hidup {padahal umat-umat sebelumku telah berlalu”} umat-umat terlah berlalu {kedua orang tuanya memohon pertolongan kepada Allah} memohon kepada Allah untuk menunjukkannya kepada keimanan {“Celaka kamu} celakalah kamu {berimanlah. Sesungguhnya janji Allah itu benar” Lalu dia berkata,“Ini tidak lain kecuali dongeng orang-orang dahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Setelah Allah menyebutkan kondisi anak shalih yang berbakti kepada kedua orang tua, selanjutnya Allah menyebutkan kondisi anak durhaka dan itu adalah kondisi terburuk. Allah berfirman, “Dan orang-orang yang berkata kepada dua orang ibu bapaknya,” ketika diajak untuk beriman kepada Allah dan Hari Akhir serta memberi kabar ancaman akan adanya pembalasan dan inilah kebaikan terbesar yang berasal dari orang tua terhadap anak-anaknya yang mengajak anaknya kepada kesenangan dan keberuntungan abadi, hanya saja si anak membalasnya secara tidak bauik seraya berkata, “Cih bagi kamu berdua,” artinya, celakalah kalian berdua dan apa yang kalian berdua bawa itu. Selanjutnya Allah menyebutkan sebab mengapa anak memungkiri serta mengingkari ajakan orang tuanya, Allah berfirman, “Apakah kamu berdua memperingatkan kepadaku bahwa aku akan dibangkitkan,” dari kuburku menuju Hari Kiamat, “padahal sungguh telah berlalu beberapa umat sebelumku?” mereka sebelumnya juga mendustakan dan mengingkari ajakan seperti ini, mereka adalah umat-umat yang dijadikan panutan bagi orang-orang kafir, bodoh, dan pembangkang. “Lalu kedua ibu bapaknya memohon pertolongan kepada Allah,” atas putranya seraya mengatakan pada putranya, “Celaka kamu, berimanlah!” artinya, kedua orangtunya mencurahkan segenap tenaga yang dimiliki dan berusaha keras untuk menunjukkan putranya, dengan begitu gigihnya sampai-sampai kedua orangtuanya memintakan pertolongan kepada Alllah untuk putranya layaknya orang yang hendak tenggelam ke dalam air, kedua orang tuanya meminta dan memohon kepada Allah dengan memelas seraya merasa perih karena anaknya dan menjelaskan kebenaran padanya, keduanya berkata,” SEsungguhnya janji Allah itu adalah benar.” Kemudian keduanya memaparkan dalil-dalil semampunya, namun putranya justru semakin membantah, menjauh, dan menyombongkan diri dari kebenaran seraya menuduh kebenaran yang dibawa kedua orang tuanya, “lalu dia berkata, ‘Ini tidak lain hanyalah dongengan orang-orang yang dahulu belaka’.” Artinya, tidak lain hanyalah dinukil dari kitab-kitab orang terdahulu, bukan berasal dari Allah dan tidak pula berasal dari wahyu yang diberikan kepada RasulNya. Semua orang tahu bahwa Muhammad adalah orang yang tidak bisa mnembaca dan tidak bisa menulis dan tidak pernah belajar dari siapa pun, lantas dari mana dia belajar? Bagaimana manusia bisa membuat seperti al-Quran ini meski mereka saling membantu satu sama lain?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 17: Adapun anak yang durhaka yang mengatakan kepada kedua orang tuanya : cis bagi kalian berdua, atau kalian berdua menyebalkan, apakah kalian berdua mengingatkanku akan kebangkitanku dari kubur ? Telah lalu masa yang panjang yang tidak satupun manusia sebelumku yang mati dibangkitkan.; Maka kedua orang tuanya beristighatsah memohon kepada Allah hidayah atas anak ini, mereka berdua berkata : Celaka kamu, berimanlah wahai anakku akan hari kebangkitan, karena sesungguhnya janjia Allah benar, maka anaknya menepis dengan berkata : Tidaklah ucapan yang kalian ucapkan ini kecuali hanya khurafat (dongeng) orang-orang dahulu dan mereka mengingkari apa yang tertulis dalam kitab-kitab mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang saleh yang berbakti kepada kedua orang tuanya, maka Allah Subhaanahu wa Ta'aala menyebutkan kebalikannya, yaitu menyebutkan keadaan orang yang durhaka, dan bahwa keadaan tersebut adalah keadaan yang paling buruk. Kedua orang tuanya mengajaknya beriman kepada Allah dan hari akhir serta menakut-nakutinya dengan pembalasan. Ini merupakan ihsan yang terbesar yang diberikan orang tua kepada anaknya; mengajak kepada kebahagiaan dan keberuntungan yang kekal. Namun sayang, perbuatan baik ini dibalas dengan balasan yang buruk. dan mereka belum juga dibangkitkan. Kedua orang tuanya berusaha keras untuk menunjuki anaknya sampai berdoa kepada Allah untuk kebaikannya, namun dibalas dengan kata-kata yang sangat menyakitkan sampai akhirnya kedua orang tuanya mencelanya dengan keras dan menerangkan yang hak (benar) kepadanya. Kedua orang tuanya menegakkan hujjah terhadap kebenarannya semampunya, tetapi anaknya tetap saja sombong kepada kebenaran dan menjauhinya serta mencelanya dengan mengatakan, bahwa itu adalah dongengan orang-orang yang terdahulu. Padahal semua orang tahu, bahwa Nabi Muhammad shallallahu 'alaihi wa sallam seorang yang ummiy; tidak mengenal baca-tulis dan tidak belajar kepada seseorang, sehingga dari mana Beliau bisa membawa Al Qur’an yang tidak dapat ditandingi oleh jin dan manusia -meskipun mereka saling bantu-membantu untuk membuat yang semisalnya- kalau bukan berasal dari Allah Subhaanahu wa Ta'aala?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 17",
    "description": "Selain menjelaskan tentang sikap orang-orang yang berbuat baik kepada kedua orang tua, Allah juga menjelaskan keadaan sebaliknya yaitu sikap orang-orang yang durhaka kepada kedua orang tua. Dan orang yang berkata kepada kedua orang tuanya, ketika kedua orang tuanya mengajaknya agar beriman kepada Allah, anaknya itu berkata; 'ah. ' ia tidak mau mengikuti nasihat kedua orang tuanya, lalu anak itu berkata, apakah kamu berdua memperingatkan kepadaku bahwa aku akan dibangkitkan dari kubur, padahal beberapa umat sebelumku telah berlalu dan banyak dari mereka tidak mempercayai hari kebangkitan itu'\" kedua orang tuanya tidak putus asa mengajak anaknya beriman kepada Allah. Lalu kedua orang tuanya itu memohon pertolongan kepada Allah seraya berkata, 'celaka kamu, berimanlah kepada Allah! sungguh, janji Allah akan datangnya hari kebangkitan itu benar dan pasti akan terjadi. ' tetapi anak itu tidak percaya, lalu dia berkata kepada kedua orang tuanya, 'ini hanyalah dongeng orang-orang dahulu. '18. Mereka adalah orang-orang yang celaka seperti dijelaskan dalam firman-Nya ini, mereka itu orang-orang yang tidak percaya kepada hari kebangkitan dan tidak percaya kepada perhitungan amal baik dan buruk manusia kelak di akhirat telah pasti terkena ketetapan yakni ditimpakan azab atas mereka bersama umat-umat dahulu sebelum mereka, dari golongan jin dan manusia yang durhaka kepada tuhan. Mereka adalah orang-orang yang rugi yakni celaka di akhirat disebabkan azab dari tuhan karena kedurhakaannya di dunia."
  }
]