[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang sifat mereka adalah demikian, adalah orang-orang yang wajib mendapatkan azab Allah, hukuman dan murkaNya, sama dengan umat-umat yang telah berlalu dari mereka dari kalangan jin dan manusia yang berjalan di atas kekafiran dan pendustaan. Mereka adalah orang-orang yang merugi dengan menjual petunjuk dengan kesesatan, nikmat dengan azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Mereka adalah orang-orang yang pasti mendapat siksa bersama dengan golongan dari umat-umat sebelum mereka dari kalangan jin dan manusia, sesungguhnya mereka adalah orang-orang yang merugi karena telah merugikan diri mereka dan keluarga mereka dengan masuk ke dalam Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أُو۟لٰٓئِكَ (Mereka itulah) Yakni orang-orang yang mengatakan hal itu. الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ(orang-orang yang telah pasti ketetapan (azab) atas mereka) Yakni yang telah ditetapkan azab bagi mereka. Dan mungkin yang dimaksud adalah firman Allah: لأملأن جهنم منك وممن تبعك منهم أجمعين “Sesungguhnya Aku pasti akan memenuhi neraka Jahannam dengan jenis kamu dan dengan orang-orang yang mengikuti kamu di antara mereka kesemuanya.” (Sad:85) فِىٓ أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ الْجِنِّ وَالْإِنسِ ۖ( bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia) Telah ditetapkan bagi mereka azab, sehingga mereka termasuk umat-umat terdahulu yang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Orang-orang yang mengingkari hari kebangkitan maka wajib bagi mereka mendapatkan azab, dan terjadilah apa yang telah kami ancamkan sebagai konsekuensi perbuatan mereka. Azab yang telah diturunkan kepada kebanyakan umat terdahulu, baik dari golongan jin maupun manusia. Mereka-lah orang-orang yang merugi terhadap diri mereka sendiri di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang pasti tertimpa ketetapan} tertimpa azab {bersama umat-umat} golongan umat-umat kafir {sebelum mereka dari kalangan jin dan manusia. Sesungguhnya mereka adalah orang-orang yang merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Mereka itulah,” dengan kondisi tercela itu “orang-orang yang telah pasti (azab) atas mereka,” yaitu azab pasti akan ditimpakan kepada mereka “bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia.” Yang berada dalam kekufuran dan kedustaan, mereka itu akan masuk bersama para jin dan manusia ke dalam neraka dan “sesungguhnya mereka adalah orang-orang yang merugi.” Rugi adalah lenyapnya modal seseorang, mnaka jika modal saja sudah tidak didapatkan, lantas bagaimana bisa mendapatkan keuntungan? Mereka telah kehilangan keimanan dan tidak mendapatkan kenikmatan sedikit pun hingga mereka pun tidak bisa terhindar dari siksaan Neraka Jahim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 18: Allah menjelaskan mereka yang sombong dan mendustakan hari kebangkitan wajib untuk diadzab, sebagaiman umat-umat yang terdahulu dari bangsa jin dan manusia yang mereka di atas kesombongan dan pengingkaran, dan yang mengikuti jejak mereka. Sungguh mereka adalah pengingkar dan pendusta, yang merugikan diri-diri mereka sendiri dengan kerugian yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang sama-sama kafir dan mendustakan. Rugi artinya kehilangan modal, dan jika sudah kehilangan modal, maka bagaimana akan mendapat untung. Mereka telah kehilangan iman, sehingga di akhirat tidak akan mendapatkan sedikit pun kenikmatan serta tidak akan selamat dari azab neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 18",
    "description": "Mereka adalah orang-orang yang celaka seperti dijelaskan dalam firman-Nya ini, mereka itu orang-orang yang tidak percaya kepada hari kebangkitan dan tidak percaya kepada perhitungan amal baik dan buruk manusia kelak di akhirat telah pasti terkena ketetapan yakni ditimpakan azab atas mereka bersama umat-umat dahulu sebelum mereka, dari golongan jin dan manusia yang durhaka kepada tuhan. Mereka adalah orang-orang yang rugi yakni celaka di akhirat disebabkan azab dari tuhan karena kedurhakaannya di dunia. 19. Setelah dijelaskan tentang dua kelompok manusia pada ayat-ayat di atas kini Allah menjelaskan tentang keadilan Allah dalam memberikan balasan kepada mereka, dan setiap orang dari kedua kelompok manusia sebagaimana yang disebutkan itu memperoleh tingkatan yakni peringkat yang berbeda-beda baik di surga maupun di neraka sesuai dengan apa yang telah mereka kerjakan di dunia dan peringkat itu disempurnakan agar Allah mencukupkan balasan amal perbuatan mereka dan mereka tidak dirugikan dengan mengurangi ganjaran atau menambah siksaan."
  }
]