[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masing-masing kelompok dari pengikut kebaikan dan pengikut keburukan memiliki derajat di sisi Allah pada Hari Kiamat sesuai amal-amal yang mereka kerjakan di dunia, masing-masing sesuai dengan martabatnya. Lalu Allah membalas mereka tanpa dizhalimi dengan ditambah keburukan dan dikurangi dari kebaikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan masing-masing dari kedua kelompok ini -kelompok penghuni Surga dan penghuni Neraka- mempunyai tingkatan-tingkatan sesuai dengan amal perbuatan mereka. Tingkatan-tingkatan para penghuni Surga adalah tingkatan ke atas, dan tingkatan-tingkatan penghuni Neraka adalah tingkatan ke bawah. Dan agar Allah mencukupkan bagi mereka balasan dari amal perbuatan mereka, dan mereka tidak dianiaya pada hari Kiamat dengan dikurangi amal kebaikannya atau ditambah amal keburukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Setiap golongan dari orang-orang beriman dan orang-orang kafir memiliki kedudukan masing-masing di sisi Allah pada hari kiamat, sesuai dengan amalan yang telah mereka kerjakan di dunia. Allah pasti akan memenuhi balasan perbuatan mereka, tidak ada dari mereka yang terzalimi dengan pengurangan pahala atau penambahan siksa. Pada hari kiamat, orang-orang kafir akan dihadapkan ke neraka dan akan dikatakan kepada mereka sebagai olokan dan hinaan: “Kalian telah menghabiskan kenikmatan kalian di dunia, sehingga kalian terlena dengan kenikmatan itu dan merasa puas dengan syahwat yang ada padanya. Dan pada hari ini kalian akan mendapat balasan berupa azab yang menghinakan akibat keangkuhan kalian terhadap orang lain tanpa alasan yang benar dan akibat dosa-dosa yang kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَلِكُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوا۟ ۖ (Dan bagi masing-masing mereka derajat menurut apa yang telah mereka kerjakan) Yakni setiap golongan dari orang-orang kafir dan orang-orang beriman dari golongan jin dan manusia memiliki kedudukan masing-masing di sisi Allah pada hari kiamat. وَلِيُوَفِّيَهُمْ أَعْمٰلَهُمْ (dan agar Allah mencukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka) Yakni sebagai balasan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Setiap kelompok dari dua kelompok itu yaitu kelompok mukmin dan kafir akan mendapatkan balasan pahala atau siksa. Allah sungguh akan menepati janji-Nya untuk membalas segala perbuatan mereka. Mereka tidak terdholimi sama sekali, baiik dari dikurangi pahala, ataupun ditambah azab mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap orang memperoleh tingkatan sesuai dengan apa yang telah mereka kerjakan} setiap orang dari golongan orang-orang mukmin dan orang-orang kafir berurutan menghadap di sisi Allah pada hari kiamat sesuai amal mereka {dan agar Allah menyempurnakan balasan amal mereka dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan bagi masing-masing mereka,” dari orang-orang yang baik dan orang-orang yang jahat, “derajat-derajat menurut apa yang telah mereka kerjakan.” Artinya, masing-masing berdasarkan derajatnya dalam kebaikan dan kejahatan, tempat mereka di akhirat adalah berdasarkan amalan mereka. Karena itulah Allah berfirman, “Dan agar Allah memcukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka sedang mereka tiada dirugikan.” Keburukan mereka tidak ditambah sedikit pun dan kebaikan mereka tidak dikurangi sedikit pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 19: Allah menjelaskan bahwa setiap kelompok baik mukmin maupun kafir tempat kembali mereka kepada Allah pada hari kiamat, yang tergantung dari amalan dari kedua kelompok tersebut. Maka bagi orang-orang yang beriman memiliki derajat untuk mendapatkan nikmat, dan bagi kafir akan merasakan neraka jahannam, Allah akan menyempurnakan balasan bagi mereka, Allah tidak akan mendzalimi mereka dengan mengurangi kebaikan kepada mereka dan tidak juga menambah-nambah keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang baik (mukmin) maupun orang yang buruk (kafir). Semuanya tergantung tingkat kebaikan dan keburukannya, dan tempat mereka di akhirat tergantung amal mereka. Orang-orang mukmin berada di tempat yang tinggi, yaitu surga, sedangkan orang-orang kafir berada di tempat yang rendah, yaitu neraka. Yaitu dengan ditambah keburukannya atau dikurangi kebaikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 19",
    "description": "Setelah dijelaskan tentang dua kelompok manusia pada ayat-ayat di atas kini Allah menjelaskan tentang keadilan Allah dalam memberikan balasan kepada mereka, dan setiap orang dari kedua kelompok manusia sebagaimana yang disebutkan itu memperoleh tingkatan yakni peringkat yang berbeda-beda baik di surga maupun di neraka sesuai dengan apa yang telah mereka kerjakan di dunia dan peringkat itu disempurnakan agar Allah mencukupkan balasan amal perbuatan mereka dan mereka tidak dirugikan dengan mengurangi ganjaran atau menambah siksaan. 20. Selanjutnya kepada setiap manusia diingatkan apa yang akan terjadi di hari kemudian. Dan ingatlah apa yang akan dihadapi pada hari kemudian yaitu pada hari ketika orang-orang kafir dihadapkan ke neraka sehingga mereka menyaksikan kobaran api neraka dan merasakan panasnya, ketika itu dikatakan kepada mereka 'kamu telah menghabiskan rezeki yang baik untuk kehidupan duniamu dan kamu telah bersenang-senang menikmatinya; maka pada hari ini kamu dibalas dengan azab yang menghinakan karena kamu telah berlaku sombong di muka bumi tanpa alasan yang benar, mengindahkan kebenaran, dan karena kamu terus menerus melakukan kefasikan dan berbuat durhaka kepada Allah. '."
  }
]