[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Quran ini turun dari Allah yang Maha perkasa yang tidak dikalahkan, Mahabijaksana dalam pengaturan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Kitab ini diturunkan dari Allah Yang Maha Perkasa, tidak ada seorangpun yang bisa mengalahkan-Nya, dan Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Al-Qur’an ini diturunkan secara berangsur-angsur dari sisi Allah Yang Maha Perkasa dalam kekuasaan dan kerajaan-Nya, dan Maha Bijaksana dalam perbuataan dan firman-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Al-quran ini diturunkan kepadamu wahai Rasul Allah, Tuhan Yang Maha Perkasa di seluruh kerajaan dan kekuasaan-Nya. Allah Maha Bijaksanan dalam segala tindakan-Nya. Allah selalu meletakkan sesuatu sesuai pada tempatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diturunkannya kitab ini (dari Allah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Ini adalah pujian dan pengagungan Allah terhadap KitabNya yang mulia. Dan hal tersebut mencakup ajaran agar manusia menjadikan cahaya kitab suci ini sebagai petunjuk, merenungkan ayat-ayatnya dan menguak kandungan-kandungan yang tersimpan di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 2: Surat ini diawali dengan kabar bahwa Al Qur’an Al Adzim membawa petunjuk dan cahaya, dan seluruh apa yang dinamakan dengan kebaikan dan kebenaran; Diturunkan dari sisi Allah yang tidak ada sesuatupun menguasai-Nya, yang berkuasa atas seluruh makhluk, yang memiliki hikmah kekuasaan dalam setiap urusan makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan pujian dari Allah Subhaanahu wa Ta'aala terhadap kitab-Nya yang agung dan pengagungan untuknya. Di dalamnya terdapat bimbingan kepada hamba agar mengambil petunjuknya, mentadabburi ayat-ayat-Nya dan menggali simpanannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 2",
    "description": "Selanjutnya Allah menyatakan bahwa kitab Al-Qur'an ini diturunkan secara berangsur-angsur dari Allah yang mahaperkasa kerajaan dan kekuasaannya lagi mahabijaksana perbuatan dan ketetapan-Nya. 3. Salah satu tujuan utama diturunkannya Al-Qur'an adalah untuk menyatakan keniscayaan hari akhir dan bahwa kehidupan dunia hanya-lah bersifat sementara. Allah menyatakan kami tidak menciptakan langit dan bumi dan apa, yakni segala makhluk yang ada di antara keduanya melainkan dengan cara dan tujuan yang benar yang mengandung hikmah dan dalam batas waktu yang ditentukan. Selanjutnya akan tiba masanya semua ciptaan binasa dan manusia dibangkitkan untuk menerima balasan dari amal perbuatannya. Namun orang-orang yang kafir berpaling dari peringatan yang diberikan kepada mereka. Mereka tidak percaya datangnya hari kiamat dan pembalasan di akhirat nanti atas perbuatan yang mereka lakukan di dunia."
  }
]