[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari dimana orang-orang kafir digiring ke neraka untuk menerima siksa, dikatakan kepada mereka sebagai celaan, “sungguh kalian telah menyia-nyiakan kebaikan-kebaikan kalian dalam kehidupan dunia kalian dan kalian menikmatinya. Maka hari ini (wahai orang-orang kafir) kalian dibalas dengan siksa yang merendahkan dan menghinakan di dalam neraka, karena dulu kalian menyombongkan diri di muka bumi tanpa hak dan kerena kalian keluar dari ketaatan kepada Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan pada hari orang-orang yang kafir kepada Allah dan mendustakan para rasul-Nya dihadapkan ke Neraka untuk mendapatkan siksa di dalamnya, dan dikatakan kepada mereka sebagai bentuk penghinaan dan ancaman pada mereka, “Kalian telah menghabiskan rezeki kalian yang baik di kehidupan dunia kalian dan kalian telah menikmati segala kenikmatan yang ada padanya. Adapun hari ini kalian mendapat balasan siksa yang menghinakan dan merendahkan kalian karena kesombongan kalian di dunia dengan tidak benar dan karena tidak taatnya kalian kepada Allah dengan melakukan kekufuran dan kemaksiatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا۟ عَلَى النَّارِ (Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka) Yakni hari tersingkapnya penutup sehingga mereka dapat melihat neraka dan mendekatinya. Pendapat lain mengatakan, yakni neraka akan ditunjukkan kepada mereka. أَذْهَبْتُمْ طَيِّبٰتِكُمْ فِى حَيَاتِكُمُ الدُّنْيَا((kepada mereka dikatakan): “Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniawimu) Yakni mereka menuruti syahwat dan kenikmatan dalam bermaksiat kepada Allah tanpa peduli dengan dosa-dosa, ini mereka lakukan karena keingkaran mereka terhadap apa yang dibawa oleh para rasul berupa ancaman datangnya hari perhitungan, siksaan, dan pahala. فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ(maka pada hari ini kamu dibalasi dengan azab yang menghinakan) Yakni azab yang dapat menghinakan dan merendahkan kalian. بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِى الْأَرْضِ بِغَيْرِ الْحَقِّ(karena kamu telah menyombongkan diri di muka bumi tanpa hak) Yakni akibat kesombongan mereka terhadap beribadah kepada Allah dan mengimani dan mengesakan-Nya. وَبِمَا كُنتُمْ تَفْسُقُونَ(dan karena kamu telah fasik”) Yakni tidak melakukan ketaatan kepada Allah, dan mengerjakan banyak kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai Nabi, ingatlah akan datangnyaa hari ketika orang-orang yang mengingkari Allah dan rasul-Nya dilemparkan ke dalam neraka. Mereka akan diazab dan dibuka perbuatan mereka. Kemudian dikatakan kepada mereka: Kalian telah menghabiskan rizki baik kalian untuk kehidupan dunia, kalian telah menggunakannya untuk bermaksiat. Kalian ikuti hawa nafsu dan kenikmatan fana dalam maksiat kalian. Kalian tidak menyisakan apapun. Maka pada hari inilah kalian akan dibalas dengan azab yang pedih, menghinakan, pedih dan menyakitkan. Itu semua sebab dari kesombongan kalian ketika di dinia. Kalian enggan untuk beriman kepada Allah dan mengesakan-Nya dengan dholim dan melawan kebenaran. Juga sebab dari ketidaktaatan dan maksiat yang kalian lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) orang-orang yang kafir dihadapkan pada neraka,“Kalian telah menghabiskan hal-hal yang baik dalam kehidupan dunia kalian dan bersenang-senang dengannya. Pada hari ini kalian dibalas dengan azab yang menghinakan} azab yang hina dan rendah {karena kalian sombong di bumi tanpa alasan yang benar, dan karena kalian selalu durhaka”} kalian tidak mau taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Allah menyebutkan kondisi orang-orang kafir ketika akan digiring ke neraka pada saat mereka dicaci maki, dikatakan kepada mereka, “Kamu telah menghabiskan rizkimu yang baik dalam kehidupan duniawimu (saja),” karena kalian merasa tentram terhadap dunia, kalian tertipu dengan kesenangan-kesenangan dunia, kalian puas dengan segala hawa nafsunya, rizki dan kebaikanKu tidak kalian gunakan untuk kehidupan akhirat dan kalian bersenang-senang layaknya binatang dan inilah bagian kalian di akhirat. “Maka pada hari ini kamu dibalasi dengan azab yang menghinakan,” artinya, siksaan pedih yang menghinakan kalian dan menguak kejelekan kalian, karena kalian mengatakan atas nama Allah yang tidak benar. Kalian menempuh jalan kesesatan namun kalian katakana bahwa jalan itu berasal dari sisi Allah dan sesuai hukum Allah, kalian adalah para pendusta dalam hal itu, “Dan karena kamu telah fasik.” Artinya, kalian menyombongkan diri tidak mau taat pada Allah. Mereka mencampuradukkan perkataan batil dan perbuatan batil serta berdusta atas Nama Allah karena dinisbatkan pada keridhaanNya serta menuduh dan menyombongkan diri dari kebenaran sehingga mereka pun disiksa secara pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 20: Ingatlah wahai manusia hari yang ditampakkan kepada mereka yang kufur, ditampakkan neraka jahannam untuk mereka tinggal di dalamnya. Dikatakan kepada mereka dengan penghinaan dan perendahan : Pergilah kalian kepada yang kalian inginkan dari kebaikan, kenikmatan dan kelezatan yang kalian pada kehidupan di dunia yang fana, sehingga kalian hanyut dalam kelezatan dunia, dan kalian ridha terhadap syahwat-syahwat kalian, sungguh telah datang hari perhitungan yang kalian dustakan dan ingkari; Dan hari pembalasan dengan adzab yang menghinakan kalian karena sebab kesombongan kalian akan urusan ketauhidan kepada Tuhan kalian dan ketaatan pada-Nya, karena juga sebab kalian keras kepala, melanggar atuan-aturan Allah di muka bumi dengan tanpa kebenaran, dan dengan kefasikan kalian yang keluar dari ketaatan kepada Tuhan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan keadaan orang-orang kafir ketika dihadapkan ke neraka saat mereka dicela dan digertak. Yakni kamu merasa tenteram dengan dunia, tertipu oleh kesenangannya, ridha dengan syahwatnya, rezeki yang baik telah membuatmu lalai dari menggunakannya untuk akhirat, dan kamu bersenang-senang seperti bersenang-senangnya hewan ternak. Yakni karena kamu berkata-kata terhadap Allah dengan tidak benar, kamu nisbatkan jalan sesat yang kamu pegang selama ini kepada Allah dan kepada hukum-Nya, dan kamu dusta dalam semua itu. Yakni sombong dari menaati-Nya. Dengan demikian, mereka menggabung berkata yang batil, beramal yang batil, berdusta terhadap Allah, mencacatkan yang benar dan sombong terhadap kebenaran, sehingga mereka dihukum dengan hukuman yang sangat pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 20",
    "description": "Selanjutnya kepada setiap manusia diingatkan apa yang akan terjadi di hari kemudian. Dan ingatlah apa yang akan dihadapi pada hari kemudian yaitu pada hari ketika orang-orang kafir dihadapkan ke neraka sehingga mereka menyaksikan kobaran api neraka dan merasakan panasnya, ketika itu dikatakan kepada mereka 'kamu telah menghabiskan rezeki yang baik untuk kehidupan duniamu dan kamu telah bersenang-senang menikmatinya; maka pada hari ini kamu dibalas dengan azab yang menghinakan karena kamu telah berlaku sombong di muka bumi tanpa alasan yang benar, mengindahkan kebenaran, dan karena kamu terus menerus melakukan kefasikan dan berbuat durhaka kepada Allah. '21. Pada ayat yang lalu Allah menyebutkan ancaman yang ditujukan kepada orang-orang yang durhaka. Selanjutnya Allah menjelaskan kisah nabi hud dan kaumnya yang membuktikan kebenaran ancaman Allah itu. Kisah tersebut merupakan peringatan bahwa ancaman Allah itu benar-benar terjadi. Dan ingatlah, wahai nabi Muhammad, dan berilah peringatan kepada kaummu agar mengambil pelajaran pada kisah nabi hud yaitu saudara sesuku kaum 'ad, yaitu ketika dia mengingatkan kaumnya yang bertempat tinggal di bukit-bukit pasir yang terletak di negeri yaman, dan ketahuilah sesungguhnya telah berlalu beberapa orang pemberi peringatan sebelumnya seperti nabi nuh, nabi syis dan lainnya dan setelahnya datang pula pemberi peringatan seperti nabi musa, nabi isa dan nabi Muhammad. Mereka menyeru kaumnya, 'janganlah kamu menyembah selain Allah. Aku sungguh khawatir jika kamu menyembah selain Allah nanti kamu ditimpa azab yang sangat pedih pada hari yang besar yang menggentarkan setiap manusia, yaitu hari kiamat. '"
  }
]