[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai rasul) Nabi Allah Hud, saudara ‘Ad dalam nasab, bukan dalam agama, saat dia memperingatkan kaumnya dari siksa Allah yang bisa menimpa mereka dan mereka tinggal di negeri mereka yang terkenal, yaitu Al-Ahqaf, tanah berpasir di selatan Jazirah Arabia. Para rasul telah datang kepada mereka, sebelum dan sesudah Hud, yang memperingatkan mereka dengan berkata kepada mereka, “Jangan menyekutukan Allah dengan selainNYa dalam ibadah kalian, sesungguhnya aku takut kalian akan mendapatkan azab Allah di suatu hari yang kengeriannya besar, yaitu Hari Kiamat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan ingatlah -wahai Rasul- tentang Hūd saudara kaum 'Ād secara nasab ketika ia mengingatkan kaumnya tentang turunnya siksa Allah atas mereka, dan mereka berada di tempat tinggal mereka di Al-Ahqāf, sebelah selatan dari Jazirah Arab. Dan telah berlalu para rasul yang mengingatkan kaum mereka sebelum Hūd dan sesudahnya, mereka berkata kepada kaumnya, “Janganlah kalian menyembah kecuali Allah semata dan janganlah kalian menyembah selain-Nya bersama-Nya, sesungguhnya aku khawatir atas kalian -wahai kaumku- diturunkannya siksa pada hari yang agung, yaitu hari Kiamat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai Rasulullah, sebutkanlah kepada kaummu tentang kisah Nabi Hud, saudara kandung dari orang-orang kaum ‘Ad, ketika dia memberi peringatan kepada kaumnya yang ada di kota al-Ahqaf, Hadramaut -Dan telah berlalu para rasul yang memberi peringatan kaum mereka sebelum Nabi Hud-, dan memperingatkan mereka: “Janganlah kalian menyembah selain Allah, sungguh aku takut jika kalian menyembah selain Allah maka kalian akan mendapat azab pada hari yang sangat sulit.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَاذْكُرْ ( Dan ingatlah) Yakni sampaikanlah hai Muhammad kepada kaummu, agar mereka dapat mengambil pelajaran dan merasa takut. Atau yang dimaksud adalah: ingatlah dalam dirimu kisah Nabi Hud dan kesabarannya, agar kamu dapat meneladaninya sehingga pendustaan kaummu terhadapmu dapat terasa ringan bagimu. أَخَا عَادٍ(saudara kaum ‘Aad) Yakni Nabi Hud, dia adalah saudara mereka secara nasab keturunan, namun bukan saudara seagama. إِذْ أَنذَرَ قَوْمَهُۥ بِالْأَحْقَافِ(ketika dia memberi peringatan kepada kaumnya di Al Ahqaaf) Al-Ahqaf yakni pemukiman kaum ‘Aad, yaitu padang pasir yang terletak di kota a-Shihr di negeri Yaman, tepatnya di Hadramaut. وَقَدْ خَلَتِ النُّذُرُ مِنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦٓ( dan sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebelumnya dan sesudahnya) Nabi Hud memberitahu mereka bahwa para rasul yang diutus sebelum dan setelahnya telah memberi peringatan sebagaimana peringatannya. إِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ ((dengan mengatakan): “Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan ditimpa azab hari yang besar”)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ingatkanlah kaummu wahai Nabi, untuk mengambil pelajaran dan nasehat dari saudara kaum Ad dalam hal keturunan bukan dalam agama, yaitu nabi Hud ‘alaihis salam. Ingatlah ketika dia memperingatkan umatnya dengan Al ahqaf yaitu sebuah wadi di Yaman. Tempat tinggal kaum ‘Ad yang terletak di antara Oman dan Mahrah. Yaitu sebuah pandang pasir di negeri Syihr di Yaman Hadhromaut. Telah banyak rasul yang memberi peringatan umat mereka atas azab Allah. Maksudnya adalah telah banyak umat terdahulu yang mendapatkan azab Allah. Para rasul dulu berkata: “Janganlah kalian menyembah selain Allah, aku takut terhadap azab pada hari yang sangat mengerikan yaitu hari kiamat, jika kalian tetap menyembah selain Allah. Baina yadaihi bermakna sebelum pengutusannya, adapun min khalfihi bermakna setelah kerasulannya pada zamannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ingatlah saudara kaum ‘Ad} Hud saudara kaum ‘Ad dalam hal nasab {ketika dia mengingatkan kaumnya di lembah Ahqaf} di rumah-rumah kaum ‘Ad di selatan Semenanjung Arab {Sungguh telah berlalu para pemberi peringatan} telah berlalu para rasul {sebelumnya} sebelum Hud {dan setelahnya} dan setelahnya {“Janganlah menyembah selain Allah. Sesungguhnya aku khawatir kalian ditimpa azab pada hari yang besar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Maksudnya, “dan ingatlah,” dengan pujian indah, “sudaramu kaum ‘Ad,” yakni Nabi Hud yang termasuk diantara rasul-rasul mulia, di mana mereka diberi karunia Allah subhanahu wata’ala dengan berdakwah dan menyeru kepada AgamaNya dan menunjukan manusia kepadaNya, “Ketika dia memberi peringatan kepada kaumnya,” yakni, kaum ‘Ad “di al-Ahqaf,” yaitu di tempat kediaman mereka yang di kenal dengan al-Ahqaf yang berupa tanah pasir yang berada di bumi Yaman. “Sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebalumnya dan sesudahnya.” Hud bukanlah satu-satunya rasul yang di utus dan tidak pula ajaranya berbeda dengan ajaran mereka seraya berkata, “Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan di timpa Azab hari yang besar,” Nabi Hud memerintahkan mereka untuk menyembah Allah secara keseluruhan denga berkata benar dan berbuat yanga terpuji serta melarang mereka untuk menyekutukan Allah dan menjadikan tandingan bagi Allah. Nabi Hud memberi peringantan siksaan yang pedih pada mereka jika tidak menuruti ajakannya, tetapi seruan ini tidak ada gunanya bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 21: Sebutkan wahai Nabi Allah kepada kaummu untuk bersabar dan sabar atas penderitaan sebagaiamana Nabi Allah Hud yang dia adalah saudara laki-laki dari Ad dalam nasab agama; Yang semoga mereka mengambil pelajaran dan nasihat; Dimana Hud memperingatkan kaumnya agar tidak mendatangkan adzab Allah sedangkan mereka di dalam rumah mereka yang bertempat di Al Ahqaf, karena sebab kesyirikan dan kekafiran mereka serta kesombongan mereka. Kemudian Allah memerintahkan mengabarkan kepada kaum Hud bahwa semua Nabi yang datang sebeum Hud dan setelahnya telah mengingatkan kaum mereka agar tidak menyekutukan Allah dengan apapun dalam peribadatan mereka; Sungguh aku (kata Hud) memperingatkan kalian sebagaimana diperingatkan pula umat-umat para Nabi terdahulu agar kalian tidak terjatuh ke dalam kesyirikan; Karena sungguh aku paling takut kalian terkena adzab yang besar. Al Ahqaf terletak di Ar Ribhi AL Khali yang terletak di jazirah arab yaitu antara Najran dan negara arab yang terletak di pesisir pantai (laut); Sebelah kanannya adalah Yaman, Aman, Uni Emirat. Dan Al Ahqaf adalah ungkapan dari “pasir yang bertumpuk” dimana Allah perintahkan angin untuk mengumpulkan angin menghembuskan pasir agar bertumpuk seperti gunung, dan kaum Hud adalah mereka yang Allah firmankan : ٱلَّتِى لَمْ يُخْلَقْ مِثْلُهَا فِى ٱلْبِلَـٰدِ, yang artinya : yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain. {Al Fajr : 8}. Yaitu mereka adalah suatu kaum yang memiliki peradaban yang tiada bandingnya, dimana negeri mereka tidak didapati di salah satu negeri pun dari umat-umat terdahulu, kemudian mereka sombong karena derajat mereka yang tinggi dan tertipu sampai mereka berkata : مَنْ أَشَدُّ مِنَّا قُوَّةً , \"Siapakah yang lebih besar kekuatannya dari kami?\". {Al Fushsilat : 15}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Nabi Hud ‘alaihis salam salah seorang rasul yang mulia; yang Allah lebihkan dia dengan dakwahnya kepada agama-Nya dan membimbing manusia kepada-Nya. Yang berada di Yaman. Sehingga Beliau bukanlah rasul yang baru. Jika kamu menyembah selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 21",
    "description": "Pada ayat yang lalu Allah menyebutkan ancaman yang ditujukan kepada orang-orang yang durhaka. Selanjutnya Allah menjelaskan kisah nabi hud dan kaumnya yang membuktikan kebenaran ancaman Allah itu. Kisah tersebut merupakan peringatan bahwa ancaman Allah itu benar-benar terjadi. Dan ingatlah, wahai nabi Muhammad, dan berilah peringatan kepada kaummu agar mengambil pelajaran pada kisah nabi hud yaitu saudara sesuku kaum 'ad, yaitu ketika dia mengingatkan kaumnya yang bertempat tinggal di bukit-bukit pasir yang terletak di negeri yaman, dan ketahuilah sesungguhnya telah berlalu beberapa orang pemberi peringatan sebelumnya seperti nabi nuh, nabi syis dan lainnya dan setelahnya datang pula pemberi peringatan seperti nabi musa, nabi isa dan nabi Muhammad. Mereka menyeru kaumnya, 'janganlah kamu menyembah selain Allah. Aku sungguh khawatir jika kamu menyembah selain Allah nanti kamu ditimpa azab yang sangat pedih pada hari yang besar yang menggentarkan setiap manusia, yaitu hari kiamat. ' 22. Mendengar ucapan nabi hud, mereka kaumnya itu, menjawab, 'apakah engkau datang kepada kami untuk memalingkan kami dari per-buatan menyembah tuhan-tuhan kami dan menyuruh kami agar menyembah tuhanmu' sungguh, kami tidak akan mengikuti perin-tahmu. \" kemudian untuk menegaskan penolakannya menyembah kepada Allah, mereka berkata, maka datangkanlah kepada kami azab yang telah engkau ancamkan kepada kami karena kami tetap menyembah tuhan-tuhan kami jika engkau termasuk orang yang benar dalam perkataanmu. '"
  }
]