[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, “Apakah kamu datang membawa dakwahmu untuk memalingkan kami dari penyembahan kepada tuhan-tuhan kami? Silakan kamu mendatangkan azab yang kamu ancamkan kepada kami, bila kamu termasuk orang-orang yang benar dalam ucapan dan janjimu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kaumnya berkata kepadanya, “Apakah engkau datang untuk memalingkan kami dari menyembah tuhan-tuhan kami? Sekali-kali tidak mungkin hal itu terjadi padamu. Maka datangkanlah siksa yang engkau janjikan jika engkau adalah orang yang benar seperti yang engkau nyatakan (klaim).”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Namun kaumnya membalas seruannya dengan angkuh: “Hai Hud, apakah kamu mendakwahi kami agar kamu dapat memalingkan kami dari penyembahan tuhan-tuhan kami? Datangkan saja azab yang kamu peringatkan kepada kami jika peringatanmu itu benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. قَالُوٓا۟ أَجِئْتَنَا لِتَأْفِكَنَا عَنْ ءَالِهَتِنَا (Mereka menjawab: “Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) tuhan-tuhan kami?) Yakni agar kamu dapat mengalihkan peribadatan kami. فَأْتِنَا بِمَا تَعِدُنَآ(Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami) Berupa azab yang besar itu. إِن كُنتَ مِنَ الصّٰدِقِينَ(jika kamu termasuk orang-orang yang benar) Benar dalam janjimu kepada kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Mereka berkata: “Wahai Hud, apakah engkau mendatangi kami ini untuk memisahkan kami dari sesembahan kami? Maka datangkanlah azab yang telah engkau janjikan jika engkau dan ancamanmu itu memang benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Apakah kamu datang kepada kami untuk memalingkan kami} untuk memalingkan kami {dari tuhan-tuhan kami. Maka datangkanlah azab yang telah kamu janjikan kepada kami jika kamu termasuk orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Mereka menjawab, ‘Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) sesembahan-sesembahan kami?’” Artinya, engkau tidak memiliki maksud dan tidak membawa kebenaran apa pun selain hanya ingin mencela sesembahan-sesembahan kami dan engkau hendak memalingkan kami darinya. “Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar.” Ini adalah puncak kebohongan dan penentangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 22: Maka mereka dari kaum Hud (setelah diperintah oleh Nabi mereka) berkata : Apakah engkau datang kepada kami untuk memalingkan kami dari tuhan-tuhan kami ?! Datangkan kepada kami atas apa yang engkau janjikan dari adzab yang besar jika memang engkau adalah orang yang benar atas apa yang engkau janjikan dan peringatkan darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Namun ternyata dakwah Beliau tidak bermanfaat apa-apa bagi mereka. Yakni kamu tidak punya niat selain dengki kepada sesembahan kami, sehingga kamu ingin memalingkan kami darinya. Ini merupakan kebodohan yang dalam dan sikap keras kepala mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 22",
    "description": "Mendengar ucapan nabi hud, mereka kaumnya itu, menjawab, 'apakah engkau datang kepada kami untuk memalingkan kami dari per-buatan menyembah tuhan-tuhan kami dan menyuruh kami agar menyembah tuhanmu' sungguh, kami tidak akan mengikuti perin-tahmu. \" kemudian untuk menegaskan penolakannya menyembah kepada Allah, mereka berkata, maka datangkanlah kepada kami azab yang telah engkau ancamkan kepada kami karena kami tetap menyembah tuhan-tuhan kami jika engkau termasuk orang yang benar dalam perkataanmu. ' 23. Mereka tidak mau menyembah Allah, bahkan meminta kepada nabi agar Allah menjatuhkan siksa kepada mereka. Kemudian dia, nabi hud, berkata, 'sesungguhnya ilmu tentang turunnya azab itu hanya pada Allah, hanya Allah yang mengetahui kapan datangnya siksaan itu dan aku hanya menyampaikan kepadamu apa yang diwahyukan kepadaku. Aku tidak diutus untuk menyampaikan kapan azab itu dijatuhkan kepadamu, tetapi aku melihat kamu adalah kaum yang berlaku bodoh, dengan meminta kepadaku sesuatu yang bukan urusanku yaitu menjatuhkan azab kepadamu. '."
  }
]