[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hud berkata, “sesungguhnya Ilmu tentang kapan azab akan datang kepada kalian hanya di sisi Allah. sementara aku hanya seorang utusan Allah kepada kalian, aku menyampaikan apa yang Allah perintahkan untuk aku sampaikan. Akan tetapi aku melihat kalian adalah orang-orang bodoh karena meminta disegerakannya azab dan kelancangan kalian terhadap Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dia menjawab, “Sesungguhnya waktu datangnya siksa hanya ada di sisi Allah dan aku tidak mengetahui tentang hal itu. Dan sesungguhnya aku hanyalah seorang utusan yang menyampaikan kepada kalian apa yang dengannya aku diutus kepada kalian, akan tetapi aku melihat kalian adalah kaum yang tidak mengetahui apa yang bermanfaat bagi kalian sehingga kalian meninggalkannya dan tidak mengetahui apa yang bahaya bagi kalian sehingga kalian mendatanginya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Nabi Hud memperingatkan mereka dari kebodohan mereka itu: “Ilmu tentang waktu turunnya azab bagi kalian hanya Allah yang mengetahuinya, dan aku hanya menyampaikan risalah kepada kalian. Dan aku melihat kalian adalah orang-orang yang tidak mengetahui kekuasaan Allah dalam menurunkan azab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. قَالَ إِنَّمَا الْعِلْمُ عِندَ اللهِ (Ia berkata: “Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah) Yakni ilmu tentang kedatangan azab itu hanya milik Allah, karena Dialah yang menetapkannya, dan bukan diriku, dan Dia belum memberitahukanku kapan azab itu akan datang. وَأُبَلِّغُكُم مَّآ أُرْسِلْتُ بِهِۦ(dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya) Berupa peringatan dan hujjah. Adapun pengetahuan tentang datangnya hari kiamat, tidak diwahyukan kepadaku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Hud berkata kepada mereka: “Tidak ada seorang pun yang tahu kapan azab itu akan datang kepada kalian, hanya Allah Yang Maha Tahu. Aku hanya menyampaikan apa yang diperintahkan Allah kepadaku untuk kalian. Tetapi aku melihat kalian adalah kaum yang tidak tahu tugas para rasul, mereka hanyalah sebagai penyampai risalah. Kalian juga tidak tahu apa yang akan diterima oleh orang-orang dholim, dengan desakan permintaan kalian untuk menurunkan azab. Sementara kalian terus menerus dalam kekafiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Hud berkata {“Sesungguhnya ilmu hanya ada pada Allah. Aku menyampaikan kepada kalian apa yang diwahyukan kepadaku, tetapi aku melihat kalian adalah kaum yang berlaku bodoh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Ia berkata, ‘Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah’.” Di TanganNya-lah kendali semua urusan dan Dia-lah yang akan mendatangkan siksaan kepda kalian jika Dia berkehendak. “Dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya.” Artinya, tugasku hanyalah lain menyampaikan, “tetapi aku lihat kamu adalah kaum yang bodoh.” Karena itulah kalian mengatakan seperti yang dikatakan oleh orang-orang yang sangat lancang ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 23: Hud berkata kepada mereka : Sesungguhnya pengetahuan akan waktu datangnya adzab hanya Allah yang tahu, adapun aku, aku hanyalah menyampaikan apa yang aku diutus olehnya, dengan mendakwahkan kepada kalian kepada tauhid, dan melarang kalian dari kesyirikan dan menyekutukan Allah, akan tetapi aku melihat kalian mendustakanku, dan tergesa-gesa meminta adzab, kalian adalah kaum yang bodoh yang tidak mengetahui apa yang bermanfaat untuk kalian di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Allah Subhaanahu wa Ta'aala yang mengetahui kapan datangnya azab itu kepada kamu. Karena meminta disegerakan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 23",
    "description": "Mereka tidak mau menyembah Allah, bahkan meminta kepada nabi agar Allah menjatuhkan siksa kepada mereka. Kemudian dia, nabi hud, berkata, 'sesungguhnya ilmu tentang turunnya azab itu hanya pada Allah, hanya Allah yang mengetahui kapan datangnya siksaan itu dan aku hanya menyampaikan kepadamu apa yang diwahyukan kepadaku. Aku tidak diutus untuk menyampaikan kapan azab itu dijatuhkan kepadamu, tetapi aku melihat kamu adalah kaum yang berlaku bodoh, dengan meminta kepadaku sesuatu yang bukan urusanku yaitu menjatuhkan azab kepadamu. '24-25. Azab Allah yang dijanjikan kepada mereka itu benar terjadi. Maka ketika mereka melihat tanda-tanda azab itu datang kepada mereka yaitu berupa awan yang berjalan menuju ke lembah-lembah tempat tinggal mereka, lalu mereka berkata, 'inilah awan yang akan menurunkan hujan kepada kita. \"mereka mengira awan itu menandakan turunnya hujan yang sangat mereka harapkan. Nabi hud menjawab ucapan mereka, \" bukan! awan itu bukan tanda akan turun hujan, tetapi itulah azab yang kamu minta agar disegerakan datangnya, itulah angin yang sangat panas yang mengandung azab yang pedih, yang menghancurkan segala sesuatu dengan perintah tuhannya. Angin itu melanda seluruh negeri dan membinasakan segala sesuatu yang dilewatinya, baik jiwa maupun harta. Maka kaum 'ad, hancur lebur terbakar oleh angin panas dan mereka menjadi tidak tampak lagi di muka bumi kecuali hanya bekas-bekas tempat tinggal mereka. Demikianlah kami memberi balasan kepada kaum yang berdosa, baik dahulu, sekarang maupun yang akan datang. Sebagaimana kami memberi balasan berupa azab kepada kaum 'ad, demikian pula kami memberi memberi balasan serupa kepada mereka yang durhaka. '."
  }
]