[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika mereka menyaksikan azab yang mereka minta agar disegerakan berupa awan yang berjalan ke lembah-lembah mereka, mereka berkata, “Ini adalah awan hujan bagi kami.” Hud berkata, “Bukan, ia bukan hujan rahmat seperti yang kalian sangka, sebaliknya ia adalah awan azab yang kalian minta sendiri. Ia adalah angin yang membawa azab yang pedih.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Ketika datang kepada mereka siksa yang mereka minta untuk dipercepat datangnya, maka mereka melihat awan yang datang dari arah langit menuju lembah mereka, mereka berkata, “Inikah awan yang akan menurunkan hujan kepada kami?” Maka Hūd berkata kepada mereka, “Perkaranya bukan seperti yang kalian duga bahwa itu adalah awan yang akan menurunkan hujan atas kalian, akan tetapi itu adalah siksa yang kalian minta untuk disegerakan, yaitu angin yang di dalamnya terdapat siksa yang menyakitkan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Ketika mereka melihat angin yang berhembus membawa awan azab menuju lembah mereka, mereka berkata: “Awan yang datang ini akan mendatangkan hujan bagi kita.” Namun Nabi Hud berkata kepada mereka: “Itu adalah azab yang kalian inginkan agar datang dengan segera, itu adalah angin yang membawa azab yang pedih yang menghancurkan segala yang ia lewati atas izin Tuhannya.” -Dapat juga ditafsirkan bahwa ini bukanlah perkataan Nabi Hud, namun firman Allah-. Maka kaum ‘Ad menjadi binasa tanpa bekas dan hanya menyisakan rumah-rumah yang kosong. Sebagaimana Kami membinasakan mereka, maka demikianlah Kami akan membinasakan orang-orang kafir. Dari ‘Aisyah, istri Nabi, ia berkata: “Aku tidak pernah melihat Rasulullah tertawa hingga terlihat anak lidahnya (uvula), namun kebiasaan beliau hanya tersenyum. Dan jika beliau melihat awan atau angin maka akan terlihat di wajahnya kekhawatiran.” ‘Aisyah bertanya: “Wahai Rasulullah, orang-orang jika melihat awan akan merasa senang karena berharap awan itu akan membawa hujan. Akan tetapi mengapa aku melihat engkau jika melihat awan akan tampak di wajahmu ketidaksukaan?” Beliau menjawab: “Wahai ‘Aisyah, siapa yang dapat menjaminku kalau-kalau awan itu mengandung azab? Suatu kaum telah diazab dengan angin; dan kaum lainnya ketika melihat azab, mereka berkata: “Awan yang datang ini akan mendatangkan hujan bagi kita”. (Shahih al-Bukhari 8/441 no. 4829, kitab tafsir, surat al-Ahqaf, bab (ayat ini). Dan anak lidah adalah daging kecil yang menggantung di langit-langit mulut. (an-Nihayah 4/284)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَلَمَّا رَأَوْهُ عَارِضًا (Maka tatkala mereka melihat azab itu berupa awan) Yakni ketika mereka melihat awan yang nampak di ufuk. مُّسْتَقْبِلَ أَوْدِيَتِهِمْ(yang menuju ke lembah-lembah mereka) Yakni yang bergerak ke arah lembah-lembah mereka. Para ahli tafsir mengatakan bahwa kaum ‘Aad telah lama tidak dituruni hujan, kemudian Allah menggiring awan hitam kepada mereka, ketika mereka melihat awan itu bergerak ke arah mereka, maka mereka merasa sangat gembira. قَالُوا۟ هٰذَا عَارِضٌ مُّمْطِرُنَا ۚ( berkatalah mereka: “Inilah awan yang akan menurunkan hujan kepada kami”) Yakni awan yang mengandung hujan. Setelah mereka mengatakan ini, mereka dijawab: بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِۦ ۖ( (Bukan!) bahkan itulah azab yang kamu minta supaya datang dengan segera) Yakni azab yang disegerakan. Karena mereka telah mengatakan “datangkanlah kepada kami apa yang kamu ancamkan kepada kami.” رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ ((yaitu) angin yang mengandung azab yang pedih) Yakni angin yang terbentuk dari awan yang mereka lihat itu. Imam Bukhari, Muslim, dan lainnya meriwayatkan dari ‘Aisyah, ia berkata: “jika Rasulullah melihat awan atau angin, maka akan terlihat perubahan pada wajahnya.” Aku bertanya kepada beliau: “Hai Rasulullah, orang-orang jika melihat awan maka mereka akan merasa senang karena berharap akan turun hujan, namun aku melihatmu jika melihat awan, terlihat pada wajahmu ketidaksukaan?” beliau menjawab: “Hai ‘Aisyah, apa yang dapat menjaminku, jika awan itu membawa azab? Ada suatu kaum telah diazab dengan angin, dan ada suatu kaum yang melihat azab, namun mengatakan: “awan yang datang ini akan membawa hujan bagi kita”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Ketika mereka melihat tanda-tanda azab itu datang berupa awan mendung di atas langit, yang mengarah dan menuju kepada lembah-lembah mereka, mereka berkata: “Ini awan mendung yang akan menurunkan hujan dan kebaikan bukan?” Maka Hud menjawab: “Bukan, inilah azab yang kalian minta terus menerus. Ini lah, apa yang Allah janjikan terlaksana. Awan itu adalah udara yang menyimpan azab yang pedih.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika melihatnya} Maka ketika mereka melihat azab yang telah dijanjikan kepada mereka ketika tidak beriman {berupa awan} awan yang datang dari arah langit {yang menuju ke lembah-lembah mereka{ke seluruh arah lembah mereka {mereka berkata,“Inilah awan yang akan menurunkan hujan kepada kita” namun itu adalah azab yang kalian minta agar disegerakan, (yaitu) angin yang mengandung azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Kemudian Allah mengirim siksaan besar kepada mereka berupa angina kencang yang menghancurkan dan membinasakan mereka, karena itulah Allah berfirman, “Maka tatkala mereka melihat azab itu,” yakni, ketika mereka melihat hukuman itu, “menuju ke lembah-lembah mereka,” yakni, datang seperti awan yang mengarah ke lembah-lembah mereka namun mereka mengira bahwa azab yang seperti awan itu akan mengaliri sungai mereka, menyiram bibit yang mereka tanam serta akan mengisi sumur-sumur dan kolam mereka sehingga mereka bisa meminumnya, “berkatalah mereka,” seraya bergembira, “Inilah awan yang akan menurunkan hujan kepada kami.” Artinya, awan ini akan menurunkan hujan untuk kami. Allah berfirman, “(Bukan)! Bahkan itulah azab yang kamu minta supaya datang dengan segera.” Inilah perbuatan dosa yang kalian lakukan terhadap diri kalian sendiri, karena kalian mengatakan, “Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 24: Allah mengabarkan untuk yang terakhir kalinya setelah mereka tergesa-gesa meminta adzab; Dimana Allah mengirim kepada mereka awan hitam, ketika mereka melihatnya mereka berkata : Ini adalah penampakan awan yang membawa hujan yang bermanfaat yang menuju kepada lembah-lembah kami; Kemudian Hud berkata kepada mereka : Ini bukanlah awan yang membawa hujan rintik maupun lebat sebagaimana kalian kira; Bahkan ini adalah adzab yang kalian meminta untuk disegerakan, yaitu angin yang akan datang dengan membawa adzab yang pedih dan mengerikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka Allah Subhaanahu wa Ta'aala mengirimkan kepada mereka azab yang besar, yaitu angin yang akan membinasakan mereka. Angin tersebut seperti awan yang menuju lembah-lembah mereka untuk memberikan siraman hujan. Allah Subhaanahu wa Ta'aala berfirman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 24",
    "description": "24-25. Azab Allah yang dijanjikan kepada mereka itu benar terjadi. Maka ketika mereka melihat tanda-tanda azab itu datang kepada mereka yaitu berupa awan yang berjalan menuju ke lembah-lembah tempat tinggal mereka, lalu mereka berkata, 'inilah awan yang akan menurunkan hujan kepada kita. \"mereka mengira awan itu menandakan turunnya hujan yang sangat mereka harapkan. Nabi hud menjawab ucapan mereka, \" bukan! awan itu bukan tanda akan turun hujan, tetapi itulah azab yang kamu minta agar disegerakan datangnya, itulah angin yang sangat panas yang mengandung azab yang pedih, yang menghancurkan segala sesuatu dengan perintah tuhannya. Angin itu melanda seluruh negeri dan membinasakan segala sesuatu yang dilewatinya, baik jiwa maupun harta. Maka kaum 'ad, hancur lebur terbakar oleh angin panas dan mereka menjadi tidak tampak lagi di muka bumi kecuali hanya bekas-bekas tempat tinggal mereka. Demikianlah kami memberi balasan kepada kaum yang berdosa, baik dahulu, sekarang maupun yang akan datang. Sebagaimana kami memberi balasan berupa azab kepada kaum 'ad, demikian pula kami memberi memberi balasan serupa kepada mereka yang durhaka. '24-25"
  }
]