[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Angin itu menghancurkan segala yang dilewatinya atas perintah dan kehendak Tuhannya. Akhirnya, di negeri mereka tidak ada yang terlihat kecuali tempat tinggal mereka. Dengan balasan seperti ini Kami membalas kaum pendosa akibat dari dosa-dosa dan kejahatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Menghancurkan segala sesuatu yang dilewatinya yang diperintahkan Allah untuk dihancurkan maka jadilah mereka hancur lebur, tidak terlihat kecuali rumah-rumah yang sebelumnya mereka tempati sebagai bukti bahwa mereka ada sebelum peristiwa ini. Dengan balasan menyakitkan yang seperti inilah Kami membalas orang-orang berdosa yang tetap kukuh dalam kekufuran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. تُدَمِّرُ كُلَّ شَىْءٍۭ (yang menghancurkan segala sesuatu) Yakni membinasakan segala sesuatu yang dilewatinya, yaitu kaum ‘Aad dan harta benda mereka. بِأَمْرِ رَبِّهَا(dengan perintah Tuhannya) Yakni dengan ketetapan dan takdir-Nya. فَأَصْبَحُوا۟ لَا يُرَىٰٓ إِلَّا مَسٰكِنُهُمْ ۚ( maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka) Yakni maka mereka didatangi oleh angin yang membinasakan mereka, sehingga badan dan harta mereka tidak terlihat, namun yang terlihat hanya rumah-rumah mereka yang hancur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Yang membinasakan segala sesuatu, jiwa maupun harta benda dengan perintah dan kehendak Tuhannya. Sehingga binasalah kaum ‘Ad tidak tersisa apapun kecuali tempat tinggal mereka. Begitulah Kami juga akan membalas orang-orang kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Azab itu) menghancurkan} meruntuhkan dan membinasakan {segala sesuatu dengan perintah Tuhannya sehingga mereka menjadi tidak terlihat lagi, kecuali hanya tempat tinggal mereka. Demikianlah Kami memberi balasan kepada kaum yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “(Yaitu) angin yang mengandung azab yang pedih, yang menghancurkan segala sesuatu” yang dilintasinya karena sangat kencang. Allah berfirman, “yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum ‘Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk).” -Al Haqqah:7- “Dengan perintah Rabbnya,” yakni dengan izin dan kehendakNya, “maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka.” Binatang ternak, harta, serta diri mereka binasa semua oleh angina kencang itu. “Demikianlah Kami memberi balasan kepada kaum yang berdosa,” karena kejahatan serta kezhaliman yang mereka lakukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 25: Allah menjelaskan bahwa angin ini menghancurkan sesuatu yang datang kepadanya dengan penghancuran atas perintah Allah. Hal ini juga sebagai tanda akan berlangsungnya angin ini selama tujuh malam delapan hari yang membawa petaka. Maka jadilah mereka di pagi hari setelah itu tidak melihat apa-apa kecuali hanya rumah-rumah mereka yang mereka tinggali, itulah akibat tuntutan mereka (untuk didatangkan adzab); Bahkan hancur lebur rata dengan tanah peradaban mereka. Ketahuilah wahai manusia bahwa permisalan adzab ini adalah sebagai balasan bagi para pendosa karena sebab kejahatan mereka dan melanggar aturan Allah, dan untuk adzab akhirat lebih pedih seandainya mereka mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menimpakan angin itu dengan izin dan kehendak-Nya selama 7 malam dan 8 hari terus menerus sehingga mereka mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Jiwa, harta dan hewan ternak mereka binasa oleh azab itu. Disebabkan dosa dan kezaliman mereka, padahal Allah Subhaanahu wa Ta'aala telah melimpahkan nikmat yang banyak, namun mereka tidak mensyukurinya dan tidak mengingat-Nya sebagaimana yang Allah terangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 25",
    "description": "24-25. Azab Allah yang dijanjikan kepada mereka itu benar terjadi. Maka ketika mereka melihat tanda-tanda azab itu datang kepada mereka yaitu berupa awan yang berjalan menuju ke lembah-lembah tempat tinggal mereka, lalu mereka berkata, 'inilah awan yang akan menurunkan hujan kepada kita. \"mereka mengira awan itu menandakan turunnya hujan yang sangat mereka harapkan. Nabi hud menjawab ucapan mereka, \" bukan! awan itu bukan tanda akan turun hujan, tetapi itulah azab yang kamu minta agar disegerakan datangnya, itulah angin yang sangat panas yang mengandung azab yang pedih, yang menghancurkan segala sesuatu dengan perintah tuhannya. Angin itu melanda seluruh negeri dan membinasakan segala sesuatu yang dilewatinya, baik jiwa maupun harta. Maka kaum 'ad, hancur lebur terbakar oleh angin panas dan mereka menjadi tidak tampak lagi di muka bumi kecuali hanya bekas-bekas tempat tinggal mereka. Demikianlah kami memberi balasan kepada kaum yang berdosa, baik dahulu, sekarang maupun yang akan datang. Sebagaimana kami memberi balasan berupa azab kepada kaum 'ad, demikian pula kami memberi memberi balasan serupa kepada mereka yang durhaka. '26. Selanjutnya Allah menjelaskan alasan mengapa dia menjatuhkan azab setelah dihancurkannya kaum 'ad dengan segala kekuatannya. Dan sungguh, kami telah meneguhkan kedudukan mereka dengan berlimpahnya harta dan menganugerahkan kepada mereka kekuatan fisik yang belum pernah kami berikan kepada kamu wahai penduduk mekah dan kami telah memberikan kepada mereka pendengaran, penglihatan, dan hati agar mereka mendengar, melihat dan mengambil pelajaran dari ayat-ayat Allah; tetapi pendengaran, penglihatan, dan hati mereka itu tidak berguna sedikit pun bagi mereka, karena mereka tidak menggunakannya untuk memikirkan ayat-ayat Allah. Sebaliknya mereka selalu mengingkari ayat-ayat Allah dan oleh karena itu azab yang dahulu mereka perolok-olokkan dan mereka minta agar segera datang telah mengepung mereka sehingga mereka hancur binasa. Ayat ini memberikan peringatan kepada pen-duduk mekah agar mereka takut kepada azab tuhan. Kaum 'ad lebih kuat dari mereka dan lebih banyak jumlahnya, namun mereka tidak kuasa menolak azab tuhan yang dijatuhkan kepadanya."
  }
]