[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memudahkan bagi kaum ‘Ad sebab-sebab kemajuan dalam bentuk yang belum Kami berikan kepada kalian, wahai orang-orang kafir Quraisy. Kami memberi mereka pendengaran yang dengannya mereka mendengar, penglihatan yang dengannya mereka melihat, hati yang dengannya mereka memahami, tetapi mereka menggunakannya dalam apa yang mengundang murka Allah atas mereka, sehingga semua itu tidak berguna bagi mereka sedikit pun manakala mereka mendustakan hujjah-hujjah Allah. azab yang mereka remehkan dan mereka meminta disegerakan pun turun menimpa mereka. Ini merupakan ancaman dan peringatan dari Allah kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan telah Kami berikan kepada kaum Hūd hal-hal yang meneguhkan kedudukan mereka yang tidak Kami berikan kepada kalian dan telah kami berikan kepada mereka pendengaran yang dengannya mereka bisa mendengar, mata yang dengannya mereka bisa melihat, hati yang dengannya mereka bisa memikirkan, akan tetapi pendengaran, penglihatan dan hati mereka sama sekali tidak bermanfaat bagi mereka dan tidak bisa menghalangi mereka dari siksa Allah tatkala telah datang kepada mereka, karena mereka telah kafir dengan ayat-ayat Allah dan turunlah apa yang tadinya mereka olok-olokkan berupa siksa yang sebelumnya nabi mereka Hūd -'alaihissalām- telah menakuti mereka dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Sungguh Kami telah berikan kekuatan bagi kaum ‘Ad yang tidak Kami berikan kepada kalian hai para penduduk kota Makkah; dan Kami telah menciptakan bagi mereka pendengaran, penglihatan, dan hati agar mereka dapat memahami dan memakainya untuk mentaati Allah dan mencari kebahagiaan dunia dan akhirat, akan tetapi mereka menggunakannya untuk sesuatu yang mengundang kemurkaan Allah sehingga itu semua tidak membawa manfaat bagi mereka sedikitpun, sebab mereka telah mendustakan ayat-ayat Allah yang dapat mereka dengar dan saksikan. Dan mereka tertimpa azab yang dahulu mereka hina. Hai para penduduk Makkah, sungguh Kami telah membinasakan kaum-kaum yang tinggal di sekitar kalian, seperti kaum ‘Ad, Tsamud, kaum Nabi Luth, dan lainnya. Dan Kami telah menjelaskan kepada mereka berbagai dalil dan bukti, agar mereka berhenti dari kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَلَقَدْ مَكَّنّٰهُمْ فِيمَآ إِن مَّكَّنّٰكُمْ فِيهِ (Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukanmu dalam hal itu) Yakni Allah mengokohkan mereka dengan harta, umur panjang, dan badan yang kuat dengan batas yang tidak Kami berikan kepada kalian. Mereka lebih kuat dari kalian hai para penduduk Makkah, dan lebih berkuasa dan kaya. وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصٰرًا وَأَفْـِٔدَةً (dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati) Yakni mereka enggan untuk menerima hujjah dan peringatan, padahal Allah telah memberi mereka panca indra yang dapat digunakan untuk memahami bukti-bukti. فَمَآ أَغْنَىٰ عَنْهُمْ سَمْعُهُمْ وَلَآ أَبْصٰرُهُمْ وَلَآ أَفْـِٔدَتُهُم مِّن شَىْءٍ(tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit juapun bagi mereka) Apa yang telah diberikan Allah kepada mereka itu tidak bermanfaat bagi mereka, sebab mereka tidak menggunakannya untuk mengesakan Allah dan membenarkan janji dan ancaman-Nya. إِذْ كَانُوا۟ يَجْحَدُونَ بِـَٔايٰتِ اللهِ(karena mereka selalu mengingkari ayat-ayat Allah) Yakni disebabkan mereka mengingkarinya. وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ(dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokkannya) Yakni mereka terkepung oleh azab yang dahulu mereka ingin disegerakan sebagai bentuk olokan, dengan mangatakan “datangkanlah kepada kami apa yang kamu ancamkan kepada kami.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sungguh, Kami telah meneguhkan kedudukan mereka dalam hal harta dan kesehatan/kekuatan, dan panjang umur. Kalian belum pernah Kami anugerahkan semisal itu wahai penduduk Makkah, dengan derajat/ukuran yang belum pernah kalian capai. Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati untuk memahami bukti-bukti kebenaran. Namun itu semua tidak berguna apa-apa bagi mereka. Sehingga mereka tidak akan pernah sampai kepada pentauhidan terhadap Allah dan tidak bisa membebaskan mereka dari azab. Itu semua karena mereka telah mengingkari dan mendustakan ayat Allah. Azab telah turun pada mereka atas ayat dan azab yang telah mereka olok-olok dan mereka minta terus menerus. In makkannakum terdapat huruf nafi, fama aghna bermakna tidak berguna sama sekali. Min setekah huruf nafi berfungsi menguniversalkan kata setelahnya. Idz kaanuu terdapat huruf ta’lil yang bermakna karena sebelumnya mereka adalah..."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah meneguhkan kedudukan mereka yang tidak Kami berikan kepada kalian} kedudukan yang tidak Kami teguhkan kepada kalian {Kami telah memberi mereka pendengaran, penglihatan, dan hati, tetapi tidak berguna} tidak berguna {bagi mereka pendengaran, penglihatan, dan hati mereka itu sedikit pun karena mereka selalu mengingkari} mengingkari {ayat-ayat Allah dan mereka telah dikepung} diliputi {oleh apa yang selalu mereka perolok-olok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Meskipun Allah telah memberikan berbagai nikmat besar, namun mereka tetap saja tidak mau mensyukurinya dan tidak mau menyebut-nyebutnya, karena itu Allah berfirman, “Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukan dalam hal itu.” Yakni, Kami telah menempatkan mereka di dunia dan mereka pun mendapatkan kebaikan-kebaikannya dan bersenang-senang berdasarkan hawa nafsu mereka, Kami memberi mereka usia yang bisa diingat oleh mereka yang ingat dan bisa dijadikan pelajaran oleh orang yang mendapatkan petunjuk. Artinya, Kami telah meneguhkan kedudukan ‘Ad sebagaimana Kami meneguhkan kedudukan kalian wahai kalian yang mendengarkan. Jangan pernah mengira bahwa kedudukan yang Kami berikan kepada kalian itu hanya khusus untuk kalian, kedudukan itu sama sekali tidak akan bisa menolak siksaan Allah yang akan ditimpakan kepadamu, justru umat lain selain kalian lebih kuat kedudukannya daripada kalian, namun harta, anak, dan bala tentara mereka sama sekali tidak berguna bagi mereka untuk menolak keputusan Allah. “Dan Kami telah memberikan kepada mereka pendengaran, penglihatan, dan hati,” artinya, tidak ada yang kurang dalam pendengaran, pemglihatan, serta hati mereka sehingga dikatakan kepada mereka, “Sesungguhnya mereka itu meninggalkan kebenaran karena kebodohan mereka serta karena mereka tidak memiliki ilmu tentang hal itu, padahal tidak ada kekurangan sedikit pun pada akal mereka, tapi pertolongan dan hidayah itu berada di Tangan Allah. “Tetapi pendengaran, penglihatan, dan hati mereka tidak berguna sedikit juapun bagi mereka,” tidak sedikit dan tidak juga banyak. Hal itu dikarenakan mereka menentang ayat-ayat Allah yang menunjukkan atas keesaanNya serta hanya Allah yang berhak untuk disembah. “dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokannya.” Artinya, siksaan yang mereka dustakan kejadiannya itu menimpa mereka dan juga karena mereka menghina para rasul yang telah memberi peringatan pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 26: Allah mengabarkan tentang peradaban pada masa Ad yang mirip dengan peradaban barat Amerika pada zaman sekarang. Kemudian Alla mengabarkan bahwa Allah menjadikan bagi manusia pendengaran, penglihatan untuk melihat peradaban tersebut, dan juga hati untuk merasakan sesuatu, yaitu Allah jadikan mereka mampu secara sempurna, paham dan petunjuk, akan tetapi mereka terpedaya dan Allah berikan hasil pangan serta kemajuan akan peradaban, dan akal-akal mereka tidak tersibukkan untuk memahami tanda-tanda kebesaran telah Allah berikan kepada mereka agar supaya mereka bertauhid dan mengenal tujuan Allah menciptakan mereka. Allah menjelaskan bahwa siapa saja yang tertimpa bencana adalah karena sebab pengingkaran mereka dari ayat-ayat Allah baik yang ada pada Al Qur’an dan alam, oleh sebab itu Allah turunkan kepada mereka adzab yang mereka mengolok-olok adzab tersebut dan ceroboh dengan memintanya agar segera didatangkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni oleh karena itu, jangan kamu mengira bahwa peneguhan Kami kepada kamu hanya diberikan kepadamu saja, dan bahwa hal itu akan menghindarkan kamu dari azab Allah, bahkan selain kamu juga diberikan peneguhan, namun harta, anak-anak dan tentara mereka tidak berguna bagi mereka sedikit pun dari azab Allah. Pendengaran, penglihatan dan hati mereka normal, sehingga tidak dapat dikatakan bahwa mereka meninggalkan kebenaran karena kebodohannya dan tidak dapat mengetahui atau karena kurangnya akal mereka, akan tetapi taufiq di Tangan Allah. Yang menunjukkan keesaan-Nya dan keberhakan-Nya untuk diibadahi saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 26",
    "description": "Selanjutnya Allah menjelaskan alasan mengapa dia menjatuhkan azab setelah dihancurkannya kaum 'ad dengan segala kekuatannya. Dan sungguh, kami telah meneguhkan kedudukan mereka dengan berlimpahnya harta dan menganugerahkan kepada mereka kekuatan fisik yang belum pernah kami berikan kepada kamu wahai penduduk mekah dan kami telah memberikan kepada mereka pendengaran, penglihatan, dan hati agar mereka mendengar, melihat dan mengambil pelajaran dari ayat-ayat Allah; tetapi pendengaran, penglihatan, dan hati mereka itu tidak berguna sedikit pun bagi mereka, karena mereka tidak menggunakannya untuk memikirkan ayat-ayat Allah. Sebaliknya mereka selalu mengingkari ayat-ayat Allah dan oleh karena itu azab yang dahulu mereka perolok-olokkan dan mereka minta agar segera datang telah mengepung mereka sehingga mereka hancur binasa. Ayat ini memberikan peringatan kepada pen-duduk mekah agar mereka takut kepada azab tuhan. Kaum 'ad lebih kuat dari mereka dan lebih banyak jumlahnya, namun mereka tidak kuasa menolak azab tuhan yang dijatuhkan kepadanya. 27. Azab Allah tidak hanya menimpa kaum 'ad tetapi juga menimpa siapa pun yang durhaka kepada tuhan. Kepada penduduk mekah, Allah memperingatkan, dan sungguh, wahai penduduk mekah telah kami binasakan penduduk negeri-negeri di sekitarmu seperti kaum 'ad yang tinggal di ahqaf, kaum Samud yang tinggal di antara mekah dan syam, kaum saba' di yaman, dan kaum madyan yang dilewati oleh penduduk mekah dalam perjalanan mereka di musim panas dan dingin, dan juga telah kami jelaskan berulang-ulang dan dengan bermacam-macam cara tanda-tanda kebesaran kami, agar mereka kembali, yakni bertobat dari kedurhakaan mereka. Akan tetapi mereka tidak menghiraukan peringatan kami, maka kami hukum mereka dengan azab yang pedih."
  }
]