[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah membinasakan negeri-negeri di sekitar kalian, wahai penduduk Makkah, seperti Ad dan Tsamud. Kami menjadikan negeri-negeri mereka terjungkir balik. Kami menjelaskan kepada mereka hujjah-hujjah dan bukti-bukti, dengan harapan mereka berkenan meninggalkan apa yang mereka lakukan berupa kekafiran kepada Allah dan ayat-ayatNya. ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan sungguh Kami telah menghancurkan negeri-negeri di sekitar kalian -wahai penduduk Makkah- dan telah Kami hancurkan kaum 'Ād, Ṡamūd, kaum Lūṭ, penduduk Madyan dan Kami telah memberikan bermacam-macam hujah dan petunjuk kepada mereka dengan harapan agar mereka bertobat dari kekufuran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُم مِّنَ الْقُرَىٰ (Dan sesungguhnya Kami telah membinasakan negeri-negeri di sekitarmu) Yakni negeri kaum Tsamud, negeri kaum Luth, dan lain sebagainya yang berada di sekitar negeri hijaz; dan kisah-kisah tentang kebinasaan mereka sangat terkenal di antara mereka. وَصَرَّفْنَا الْاٰيٰتِ لَعَلَّهُمْ يَرْجِعُونَ(dan Kami telah mendatangkan tanda-tanda kebesaran Kami berulang-ulang supaya mereka kembali (bertaubat)) Yakni Kami telah jelaskan hujjah-hujjah dan Kami berikan dengan bentuk yang bermacam-macam agar mereka berhenti dari kekafiran mereka, namun mereka tidak juga berhenti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kami telah menghancurkan negeri-negeri di sekitarmu wahai penduduk Makkah. Diantaranya adalah kaum Tsamud, ‘Ad, Luth dan sebagainya. Kami telah menunjukkan berbagai dalil dan juga berbagai bukti agar mereka berhenti dari kekufuran. Namun mereka tetap pada kelakuannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar telah Kami binasakan negeri-negeri di sekitar kalian dan Kami telah menjelaskan tanda-tanda} Kami telah menjelaskan beragam dalil dan petunjuk kepada mereka {agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28. Allah memperingatkan kaum musyrikin Arab dan lainnya karena Allah telah membinasakan umat-umat pendusta yang berada di sekitar wilayah mereka bahkan kebanyakan umat-umat yang dibinasakan itu berada di Jazirah Arab seperti kaum ‘Ad, Tsamud dan lainnya. Allah telah mendatangkan “tanda-tanda kebesaran,” kepada mereka dengan berbagai ragamnya, “supaya mereka kembali (bertaubat)” dari kekufuran dan pendustaan yang mereka lakukan. Namun karena mereka tidak mau beriman, Allah pun menyiksa mereka dengan siksaan dari Allah Yang Mahaperkasa lagi Berkuasa. Sesembahan-sesembahan yang mereka sembah selain Allah tidak membawa manfaat sedikit pun, karena itulah dalam ayat ini Allah berfirman, “Maka mengapa yang mereka sembah selain Allah sebagai ilah untuk mendekatkan diri mereka kepada sesembahan-sesembahan selain Allah dan mengagungkannya demi mengharap agar dapat menolong mereka. “Bahkan sesembahan-sesembahan itu telah lenyap dari mereka,” sesembahan-sesembahan itu pun tidak dapat mengabulkan permintaan mereka serta tidak dapat menolong mereka. “Itulah akibat kebohongan mereka dan apa yang dahulu mereka ada-adakan,” dengan berdusta yang disematkan pada diri mereka, karena mereka mengira bahwa mereka berada di atas kebenaran dan perbuatan mereka akan menolong mereka, hingga mereka pun tersesat dan amalan mereka gugur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 27: Allah mengarahkan perkataan-Nya kepada ahli Mekkah yang mereka takut, Allah berkata : Sungguh Kami telah binasakan disekitaran negeri kalian dari negeri-negeri seperti Ad, Tsamud, dan selain mereka. Ketika mereka mendustakan utusan-utusan yang diutus kepada mereka, Kami telah berikan macam-macam tanda kepada mereka secara jelas yang menunjukkan atas ke-Maha Tunggalan Allah dan kesempurnaan kuasa-Nya; Agar mereka kembali dari kekufuran mereka menuju kepada iman kepada Allah dan tauhid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memperingatkan kaum musyrik bangsa Arab dan selain mereka dengan pembinasaan-Nya terhadap umat-umat yang mendustakan yang tinggal di sekitar mereka, bahkan kebanyakan mereka tinggal di jazirah Arab seperti kaum ‘Aad, Tsamud, dsb. dan bahwa Allah Subhaanahu wa Ta'aala telah mengulang-ulang ayat-ayat-Nya dan menampilkan secara bermacam-macam kepada mereka agar mereka kembali kepada Allah, meninggalkan kekafiran dan mendustakan. Namun mereka tetap tidak beriman, sehingga Allah menghukum mereka dengan hukuman dari Tuhan yang Mahaperkasa lagi Mahakuasa, dan sesembahan yang mereka sembah selain Allah itu tidak bermanfaat apa-apa bagi mereka. Yang dimaksud dengan negeri-negeri di sekitarmu ialah negeri-negeri yang berada di sekitar kota Mekah, seperti negeri Al Hijr, Sadum, Ma'rib dan lain-lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 27",
    "description": "Azab Allah tidak hanya menimpa kaum 'ad tetapi juga menimpa siapa pun yang durhaka kepada tuhan. Kepada penduduk mekah, Allah memperingatkan, dan sungguh, wahai penduduk mekah telah kami binasakan penduduk negeri-negeri di sekitarmu seperti kaum 'ad yang tinggal di ahqaf, kaum Samud yang tinggal di antara mekah dan syam, kaum saba' di yaman, dan kaum madyan yang dilewati oleh penduduk mekah dalam perjalanan mereka di musim panas dan dingin, dan juga telah kami jelaskan berulang-ulang dan dengan bermacam-macam cara tanda-tanda kebesaran kami, agar mereka kembali, yakni bertobat dari kedurhakaan mereka. Akan tetapi mereka tidak menghiraukan peringatan kami, maka kami hukum mereka dengan azab yang pedih. 28. Maka mengapa berhala-berhala dan tuhan-tuhan yang mereka sembah selain Allah untuk mendekatkan diri kepada-Nya tidak dapat menolong mereka' bahkan tuhan-tuhan itu telah lenyap dari mereka ketika siksaan dijatuhkan kepada mereka' itulah bukti bahwa berhala-berhala yang mereka sembah itu tidak dapat menyelamatkan mereka dari azab Allah. Dan itulah akibat kebohongan mereka yang menganggap bahwa berhala-berhala adalah sekutu bagi Allah dan merupakan buah dari apa yang dahulu mereka ada-adakan yakni pendustaan terhadap Allah dan rasulnya. Ayat ini merupakan kecaman terhadap penduduk mekah yang menyembah berhala-berhala sebagai sekutu Allah. Sekiranya berhala-berhala yang mereka sembah itu berguna bagi mereka, niscaya berguna pula bagi umat sebelum mereka yang telah dibinasakan. Tetapi berhala-berhala itu tidak berguna sedikit pun, bahkan mereka lenyap ketika azab tuhan dijatuhkan."
  }
]