[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka mengapa orang-orang yang Kami binasakan dari kalangan umat-umat yang telah berlalu itu tidak ditolong oleh tuhan-tuhan yang mereka sembah dalam rangka mendekatkan diri kepada Tuhan mereka agar tuhan-tuhan tersebut memberi mereka syafa’at di sisiNya? Sebaliknya tuhan-tuhan mereka hilang, tidak memenuhi seruan mereka dan tidak membela mereka. Itu adalah kebohongan mereka dalam menjadikan selain Allah sebagai sesembahan-sesembahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Maka kenapa berhala-berhala yang mereka jadikan sebagai sesembahan selain Allah, dimana mereka mendekatkan diri kepadanya dengan ibadah dan sembelihan, tidak bisa menolong mereka? Berhala-berhala itu sama sekali tidak bisa menolong mereka, justru menghilang pada saat sedang sangat dibutuhkan. Itulah kedustaan mereka yang dengannya mereka berangan-angan pada diri mereka bahwa berhala-berhala itu bermanfaat bagi mereka dan bisa memberi syafaat di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Mengapa mereka tidak ditolong tuhan-tuhan yang mereka sembah selain Allah, dan mereka jadikan wasilah untuk mendekatkan diri kepada Allah? Tuhan-tuhan itu tidak menolong mereka, bahkan menghilang dari mereka. Kesesatan yang jauh itu merupakan akibat kedustaan mereka terhadap Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا۟ مِن دُونِ اللهِ قُرْبَانًا ءَالِهَةًۢ ۖ (Maka mengapa yang mereka sembah selain Allah sebagai Tuhan untuk mendekatkan diri (kepada Allah) tidak dapat menolong mereka) Yakni mengapa tuhan-tuhan yang mereka anggap dapat memberi mereka syafaat itu tidak menolong mereka, serta menyelamatkan mereka dari kebinasaan yang menimpa mereka. بَلْ ضَلُّوا۟ عَنْهُمْ ۚ( Bahkan tuhan-tuhan itu telah lenyap dari mereka?) Yakni tidak menolong mereka, dan tidak datang ketika mereka membutuhkannya. وَذٰلِكَ(Itulah) Yakni lenyap dan hilangnya tuhan-tuhan itu sebabnya adalah إِفْكُهُمْ(akibat kebohongan mereka) Yaitu dengan menjadikan mereka tuhan-tuhan, dan akibat anggapan dusta mereka bahwa tuhan-tuhan itu dapat mendekatkan mereka kepada Allah, serta dapat memberi syafaat. وَمَا كَانُوا۟ يَفْتَرُونَ (dan apa yang dahulu mereka ada-adakan) Yakni mereka bedusta dengan mengatakan bahwa itu adalah tuhan-tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Lalu mengapa sesembahan mereka selain dari Allah itu tidak dapat menolong mereka atau juga membebaskan mereka dari azab? Maksud dari kalimat ini adalah sesembahan mereka justru menghilang/lenyap ketika mereka sedang ditimpa azab. Dari itu berarti sesembahan yang mereka katakan dapat mendekatkan diri mereka kepada Allah tidak bisa memberi manfaat-apa-apa. Sehingga menjadikan mereka dari yang dianggap kebenaran berubah menjadi kebathilan. Itu semua juga disebabkan angan-angan mereka bahwa Allah itu mempunyai sekutu. Qurbanan sebagai maf’ul li ajlih yang bermakna untuk mendekatkan diri kepada Allah. Bal bermakana untuk menyanggah kalimat sebelumnya, dan menetapkan kalimat sesudahnya. Yaftaruna bermakna mendustakan/mengada-ada"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka mengapa tidak} mengapa tidak {menolong mereka sesembahan yang mereka jadikan sebagai tuhan selain Allah untuk mendekatkan diri} sesembahan yang mereka jadikan tuhan selain Allah yang mereka gunakan untuk mendekatkan diri kepadaNya sesuai anggapan mereka agar tuhan-tuhan itu bisa menyelamatkan mereka di sisiNya {Bahkan tuhan-tuhan itu telah lenyap dari mereka} tidak menolong mereka dan mengabaikan mereka {Itulah kebohongan mereka} kebohongan mereka {dan apa yang selalu mereka ada-adakan} mereka dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28. Allah memperingatkan kaum musyrikin Arab dan lainnya karena Allah telah membinasakan umat-umat pendusta yang berada di sekitar wilayah mereka bahkan kebanyakan umat-umat yang dibinasakan itu berada di Jazirah Arab seperti kaum ‘Ad, Tsamud dan lainnya. Allah telah mendatangkan “tanda-tanda kebesaran,” kepada mereka dengan berbagai ragamnya, “supaya mereka kembali (bertaubat)” dari kekufuran dan pendustaan yang mereka lakukan. Namun karena mereka tidak mau beriman, Allah pun menyiksa mereka dengan siksaan dari Allah Yang Mahaperkasa lagi Berkuasa. Sesembahan-sesembahan yang mereka sembah selain Allah tidak membawa manfaat sedikit pun, karena itulah dalam ayat ini Allah berfirman, “Maka mengapa yang mereka sembah selain Allah sebagai ilah untuk mendekatkan diri mereka kepada sesembahan-sesembahan selain Allah dan mengagungkannya demi mengharap agar dapat menolong mereka. “Bahkan sesembahan-sesembahan itu telah lenyap dari mereka,” sesembahan-sesembahan itu pun tidak dapat mengabulkan permintaan mereka serta tidak dapat menolong mereka. “Itulah akibat kebohongan mereka dan apa yang dahulu mereka ada-adakan,” dengan berdusta yang disematkan pada diri mereka, karena mereka mengira bahwa mereka berada di atas kebenaran dan perbuatan mereka akan menolong mereka, hingga mereka pun tersesat dan amalan mereka gugur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 28: Maka ketika datang kepada mereka adzab, dan ditimpakan kebinasaan kepada mereka, maka apakah berguna sesembahan-sesembahan mereka yang diibadahi oleh mereka selain Allah dan mereka mendekatkan diri kepada sesembahan tersebut ?!; Bahkan secara hakikat tuhan-tuhan atau sesembaan-sesembahan mereka tidak berperan dan tidak juga mampu menjauhkan atau menjaga mereka, itula sebab kebinasaan, musibah atas sesembahan-sesembahan ini, yang mereka tidak membawa bahaya dan manfaat, yaitu sesembahan selain Allah. Inilah adzab sebagai akir dari kedustaan, pengingkaran dan kesombongan mereka yang menyembah kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika azab turun. Bisa juga diartikan, bahwa itulah kebohongan mereka, yaitu mengambil berhala dan patung sebagai sesembahan selain Allah dengan anggapan bahwa hal itu dapat mendekatkan diri mereka kepada-Nya serta dapat memberi manfaat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 28",
    "description": "Maka mengapa berhala-berhala dan tuhan-tuhan yang mereka sembah selain Allah untuk mendekatkan diri kepada-Nya tidak dapat menolong mereka' bahkan tuhan-tuhan itu telah lenyap dari mereka ketika siksaan dijatuhkan kepada mereka' itulah bukti bahwa berhala-berhala yang mereka sembah itu tidak dapat menyelamatkan mereka dari azab Allah. Dan itulah akibat kebohongan mereka yang menganggap bahwa berhala-berhala adalah sekutu bagi Allah dan merupakan buah dari apa yang dahulu mereka ada-adakan yakni pendustaan terhadap Allah dan rasulnya. Ayat ini merupakan kecaman terhadap penduduk mekah yang menyembah berhala-berhala sebagai sekutu Allah. Sekiranya berhala-berhala yang mereka sembah itu berguna bagi mereka, niscaya berguna pula bagi umat sebelum mereka yang telah dibinasakan. Tetapi berhala-berhala itu tidak berguna sedikit pun, bahkan mereka lenyap ketika azab tuhan dijatuhkan. 29. Kelompok ayat yang lalu menjelaskan seruan nabi Muhammad yang ditujukan kepada umat manusia, khususnya kepada penduduk negeri mekah, dan menjelaskan bahwa di antara mereka ada yang beriman dan ada pula yang kafir. Ayat ini menjelaskan bahwa nabi Muhammad tidak hanya diutus kepada umat manusia saja, tetapi juga diutus kepada golongan jin. Di antara golongan jin itu ada yang beriman dan dengan tekun mendengarkan perkataan nabi, dan ingatlah ketika kami hadapkan kepadamu, wahai nabi Muhammad, serombongan jin, yang berjumlah tujuh atau sembilan, yang mendengarkan dengan tekun bacaan Al-Qur'an, maka ketika mereka menghadiri pembacaannya mereka berkata, satu sama lain, 'diamlah kamu untuk mendengarkannya!' maka ketika telah selesai mendengar pembacaan itu dan memahami pesan-pesan yang terkandung di dalamnya mereka kembali kepada kaumnya untuk memberi peringatan."
  }
]