[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai rasul) ketika Kami mengirimkan kepadamu sekelompok jin yang mendengar al-Quran darimu. Maka ketika mereka telah hadir dan Rasulullah membaca al-Quran, mereka berkata kepada sebagian yang lain, “Diamlah, supaya kita mendengar al-Qur’an.” Maka ketika Rasulullah selesai membaca, di mana mereka telah memahaminya dan ia berpengaruh kepada mereka, jin-jin tersebut pulang kepada kaum mereka untuk memperingatkan mereka dari azab Allah bila mereka tidak beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan ingatlah -wahai Rasul- saat Kami mengirimkan sekelompok jin yang mendengarkan Al-Qur`ān yang diturunkan kepadamu. Ketika mereka hadir untuk mendengarnya, sebagian dari mereka berkata kepada sebagian yang lain, “Diamlah sehingga kita bisa menyimaknya dengan baik.” Ketika Rasul telah selesai membacanya, mereka kembali kepada kaumnya untuk memberi peringatan kepada kaumnya dari siksa Allah jika mereka tidak beriman kepada Al-Qur`ān."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Jika orang-orang kafir Quraisy telah mendustakan Nabi Muhammad, maka sungguh Allah telah menguatkannya dengan mukjizat besar ketika sekelompok jin beriman kepadanya. Oleh sebab itu Allah memuji jin-jin yang beriman dan mendengarkan al-Qur’an dari Nabi -sebagaimana disebutkan dalam empat ayat ini-, ketika Allah mendatangkan sekelompok jin untuk mendengarkan al-Qur’an dari Nabi. Ketika mereka telah datang untuk mendengarkan bacaan itu, mereka saling berkata: “Diamlah agar kita dapat mendengar al-Qur’an dengan baik.” Setelah selesai dibacakan, mereka kembali kepada kaum mereka untuk memberi mereka peringatan dari azab jika mereka tidak beriman kepada Allah. ‘Alqamah berkata, aku bertanya kepada Ibnu Mas’ud, “Apakah salah satu dari kalian bersama dengan Nabi Muhammad pada malam kedatangan para jin itu?” Ibnu mas’ud menjawab, “Tidak ada yang bersama beliau ketika itu, akan tetapi suatu malam kami kehilangan beliau, padahal beliau ada di Makkah; sehingga dari kami ada yang mengatakan, ‘beliau diculik atau apa yang terjadi dengannya?’ Sehingga kami melewati malam yang paling buruk. Hingga ketika pagi datang atau penjelang pagi, tiba-tiba beliau datang dari arah gua Hira’. Maka orang-orang menceritakan kepadanya apa yang terjadi dengan mereka. Maka beliau bersabda, ‘Seorang jin datang mengundangku, maka aku mendatangi mereka dan membacakan -al-Qur’an- kepada mereka’. Kemudian beliau pergi untuk menunjukkan jejak para jin itu dan bekas api mereka.” (Diriwayatkan oleh at-Tirmidzi, dan ia berkata: Hadits ini hasan shahih. As-Sunan 5/382-383 no. 3258, kitab at-tafsir. Dan dishahihkan al-Albani dalam Shahih Sunan at-Tirmidzi. Dan diriwayatkan oleh Imam Muslim dari jalur Ali bin Hajar dengan lafadz serupa. As-Shahih 2/24, kitab shalat, bab mengeraskan bacaan pada shalat subuh dan bacaan kepada para jin)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَإِذْ صَرَفْنَآ إِلَيْكَ نَفَرًا مِّنَ الْجِنِّ (Dan (ingatlah) ketika Kami hadapkan serombongan jin kepadamu yang mendengarkan Al Quran) Yakni hai Muhammad, Kami datangkan kepadamu sekumpulan jin ketika Kami hendak memberi hidayah kepada mereka. فَلَمَّا حَضَرُوهُ (maka tatkala mereka menghadiri pembacaan(nya)) Yakni ketika mereka ikut mendengarkan al-Qur’an dibacakan. قَالُوٓا۟ أَنصِتُوا۟ ۖ( lalu mereka berkata: “Diamlah kamu (untuk mendengarkannya)”) Mereka saling menyuruh diam agar dapat mendengar bacaan al-Qur’an. فَلَمَّا قُضِىَ(Ketika pembacaan telah selesai) Yakni setelah Rasulullah selesai membacanya. وَلَّوْا۟ إِلَىٰ قَوْمِهِم مُّنذِرِينَ(mereka kembali kepada kaumnya (untuk) memberi peringatan) Yakni mereka pergi menuju kaum mereka untuk memperingatkan agar tidak menyelisihi al-Qur’an. Ayat ini merupakan penjelas bahwa Rasulullah diutus kepada golongan jin dan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Ingatlah ketika Kami hadapkan kepadamu sekelompok jin wahai Nabi. Nafrun bermakna kelompok yang berjumlah paling banyak 40 personil dan paling sedikit 3 personil. Sekelompok jin itu menghadapmu untuk menyimak bacaan Alquran. Ketika Alquran itu dibaca, mereka mengingatkan teman-temannya untuk diam dan menyimak bacaan Alquran. Ketika bacaannya telah selesai mereka bersegera kembali ke tempat asal mereka untuk memberi peringatan kepada kaum mereka tentang azab yang akan diterima jika mereka tidak beriman. Inilah bukti yang jelas bahwa rasulullah SAW adalah utusan untuk jin dan manusia. Ayat ini turun untuk 9 jin yang menghadap Nabi ketika Nabi sedang membacaca Alquran di bawah pohon kurma. Ketika mereka mendengar bacaan Alquran mereka mengingatkan temannya untuk diam dan menyimak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika Kami menghadapkan} Kami mengutus dan menghadapkan {kepadamu sekelompok} satu kelompok {jin yang mendengarkan Al-Qur’an. Ketika menghadirinya, mereka berkata,“Diamlah” Ketika selesai} selesai bacaannya {mereka kembali} mereka kembali {kepada kaumnya sebagai pemberi peringatan} pemberi peringatan tentang azab Allah jika mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Allah mengutus RasulNya Muhammad, untuk semua makhluk, baik manusia maupun jin, untuk itu Muhammad harus menyampaikan seruan kenabian dan risalah kepada seluruhnya. Rasulullah secara leluasa bisa menyeru dan memberi peringatan kepada manusia, sedangkan jin, dihadapkan oleh Allah berdasarkan kekuasaanNya dan Allah mengutus kepada Muhammad “serombongan jin yang mendengarkan al-Quran, maka tatkala mereka menghadiri pembacaan (nya), mereka berkata, ‘Diamlah kamu (untuk mendengarkannya)’.” Artinya satu sama lain memerintahkan seperti itu. “Ketika pembacaan telah selesai,” dan mereka telah memahaminya dan bacaan itu berpengaruh pada mereka, “mereka kembali kepada kaumnya (untuk) memberi peringatan.” Yakni, mereka memberi nasihat kepada kaumnya dan menegakkan hujjah Allah kepada mereka. Dan itu adalah pertolongan Allah untuk RasulNya dalam menyebarkan dakwah pada golongan jin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 29: Sebutkanlah wahai Nabi Allah, hari kiamat kepada mereka satu kaum dari golongan jin yang mereka mendengar Al Qur’an, ketika engkau sedang shalat dan ketika engkau kembali ke Mekkah. Maka ketika mereka hadir dan engkau pada saat itu shalat kemudian membaca Al Qur’an, mereka para jin berkata kepada sebagian yang lain : Dengarkanlah (bacaan Al Qur’an) agar kita memahami bacaan yang menakjubkan ini. Maka ketika engkau telah selesai dari shalatmu, maka mereka terkesan atas apa yang mereka dengar dari Al Qur’an, mereka kemudian berpaling menuju ke gerombolan mereka saling memberikan kabar dan peringatan dari adzab Allah jika tidak beriman kepada Allah. Ayat ini menunjukkan bahwa Nabi adalah utusan bagi manusia dan jin, dan bahwasanya jin semisal dengan manusia yang memiliki ganjaran, adzab dan beban syariat, sebagaimana Allah berfirman : وَلِكُلٍّۢ دَرَجَـٰتٌۭ مِّمَّا عَمِلُوا۟ , yang artinya : Dan bagi masing-masing memperoleh derajat-derajat (seimbang) dengan apa yang dikerjakannya. {Al An’am : 132}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengutus Rasul-Nya Muhammad shallallahu 'alaihi wa sallam kepada makhluk baik manusia maupun jin. Kepada manusia, maka Beliau bisa mendakwahkan mereka dan memberi peringatan, adapun kepada jin, maka Allah Subhaanahu wa Ta'aala hadapkan jin dengan kekuasaan-Nya kepada Beliau. Dan mereka telah hapal atau mengerti. Untuk menegakkan hujjah kepada kaumnya. Allah Subhaanahu wa Ta'aala menaqdirkan jin beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam untuk membantu Beliau menyebarkan dakwah Islam di kalangan jin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 29",
    "description": "Kelompok ayat yang lalu menjelaskan seruan nabi Muhammad yang ditujukan kepada umat manusia, khususnya kepada penduduk negeri mekah, dan menjelaskan bahwa di antara mereka ada yang beriman dan ada pula yang kafir. Ayat ini menjelaskan bahwa nabi Muhammad tidak hanya diutus kepada umat manusia saja, tetapi juga diutus kepada golongan jin. Di antara golongan jin itu ada yang beriman dan dengan tekun mendengarkan perkataan nabi, dan ingatlah ketika kami hadapkan kepadamu, wahai nabi Muhammad, serombongan jin, yang berjumlah tujuh atau sembilan, yang mendengarkan dengan tekun bacaan Al-Qur'an, maka ketika mereka menghadiri pembacaannya mereka berkata, satu sama lain, 'diamlah kamu untuk mendengarkannya!' maka ketika telah selesai mendengar pembacaan itu dan memahami pesan-pesan yang terkandung di dalamnya mereka kembali kepada kaumnya untuk memberi peringatan. 30. Kemudian Allah menerangkan lebih lanjut apa yang dikatakan oleh kelompok jin kepada kaumnya dalam memberi peringatan kepada mereka. Mereka berkata, 'wahai kaum kami! sungguh, kami telah mende-ngarkan pembacaan kitab yang agung yaitu Al-Qur'an yang diturunkan oleh Allah setelah kitab nabi musa, yang membenarkan kitab-kitab yang datang sebelumnya, yang membimbing siapa yang mengikuti tuntunannya kepada kebenaran dan menunjukkan mereka kepada jalan yang lurus."
  }
]