[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami tidak menciptakan langit dan bumi serta apa yang diantara keduanya kecuali dengan kebenaran, tidak main-main dan sia-sia, sebaliknya agar para hamba mengetahui keagungan Pencipta keduanya lalu mereka menyembahNya semata, agar mereka mengetahui bahwa Dia Mahakuasa untuk membangkitkan para hamba sesudah kematian mereka, agar mereka menegakkan keadilan dan kebenaran diantara mereka dan hingga masa yang ditetapkan olehNya. Dan orang-orang yang mengingkari bahwa Allah adalah Tuhan yang haq, mereka itu berpaling dari peringatan yang disampaikan oleh al-Quran, mereka tidak merenungkan dan tidak mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Tidaklah Kami menciptakan langit dan tidaklah Kami menciptakan bumi dan tidak pulalah Kami menciptakan apa yang ada di antara keduanya dengan sia-sia. Akan tetapi Kami menciptakan semua itu dengan tujuan yang benar, untuk hikmah yang tinggi, di antaranya agar para hamba memahaminya sehingga mereka menyembah Allah semata dan tidak menyekutukan-Nya dengan sesuatu apapun dan agar mereka melaksanakan kewajiban mereka sebagai khalifah di bumi sampai batas yang telah ditentukan yang hanya diketahui oleh Allah semata. Adapun orang-orang kafir kepada Allah, mereka berpaling dari apa yang diperingatkan kepada mereka di dalam kitab Allah, mereka tidak memperhatikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Tidaklah Kami menciptakan tujuh langit dan bumi dan makhluk-makhluk yang ada di antara keduanya melainkan dengan benar, dan sampai waktu yang telah ditetapkan yang hanya Allah yang mengetahuinya. Orang-orang kafir berpaling dan lalai dari peristiwa-peristiwa yang al-Qur’an peringatkan. Hai Rasulullah, katakanlah kepada mereka: “Katakan kepadaku tentang berhala-berhala yang kalian sembah selain Allah, apa yang telah mereka ciptakan di bumi? Atau mereka ikut bersama Allah menciptakan tujuh langit? Datangkanlah kepadaku kitab dari Allah sebelum al-Qur’an ini atau ilmu peninggalan orang-orang terdahulu yang dapat dipercaya, jika kalian benar dalam berkata.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. مَا خَلَقْنَا السَّمٰوٰتِ وَالْأَرْضَ وَمَا بَيْنَهُمَآ (Kami tiada menciptakan langit dan bumi dan apa yang ada antara keduanya) Yakni seluruh makhluk yang ada. إِلَّا بِالْحَقِّ (melainkan dengan (tujuan) yang benar) Yakni sesuai dengan kehendak Allah, Dia tidak menciptakannya dengan sia-sia. وَأَجَلٍ مُّسَمًّى ۚ(dan dalam waktu yang ditentukan) Yakni sampai hari kiamat, karena pada hari itu langit dan bumi serta segala makhluk yang ada di dalamnya akan hancur; kemudian akan diganti dengan langit dan bumi yang lain. وَالَّذِينَ كَفَرُوا۟ عَمَّآ أُنذِرُوا۟(Dan orang-orang yang kafir dari apa yang diperingatkan kepada mereka) Yakni terhadap apa yang mereka diperingatkan dalam al-Qur’an seperti hari kebangkitan, perhitungan, dan pembalasan. مُعْرِضُونَ (berpaling) Yakni mereka menghindar dan enggan untuk menerimanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Kami tidak menjadikan makhluk di langit, bumi dan semua yang ada di antaranya kecuali dengan wujud yang penuh dengan kebenaran dan keadilan/keseimbangan. Juga diciptakan dengan berbagai hikmah yang sesuai dengan keadaan masing-masing makhluk. Itu semua untuk menunjukkan kekuasaan dan kemahaesaan Allah. Tidak ada kebatilan dalam penciptaannya dan bukan main-main belaka. Dengan penentuan ajal tertentu maka akan berakhir segala sesuatu, yaitu pada hari kiamat. Orang-orang kafir yang tidak mengindahkan peringatan atau ancaman tentang datangnya hari kebangkitan, perhitungan, dan pembalasan tidak ada satu pun dari mereka yang mempunyai bekal untuk menghadapi hari itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menciptakan langit, bumi, dan apa yang ada di antara keduanya, kecuali dengan benar dan dalam waktu yang ditentukan} selama waktu tertentu berakhir {Dan orang-orang kafir berpaling dari peringatan yang diberikan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Ketika Allah menjelaskan penurunan KitabNya yang mencakup perintah dan larangan, Allah menyebutkan penciptaan langit dan bumi, sehingga ayat ini merangkum antara penciptaan dan perintah. “Ingatlah, menciptakan dan memerintah hanyalah hak Allah” QS. Al-A’rof :54 “Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi. Perintah Allah berlaku padanya, agar kamu mengetahui bahwasanya Allah Maha Kuasa atas segala sesuatu, dan sesungguhnya Allah ilmu-Nya benar-benar meliputi segala sesuatu”. QS. At-Talaq : 12 “Dia menurunkan para malaikat dengan (membawa) wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, yaitu: “Peringatkanlah olehmu sekalian, bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka hendaklah kamu bertakwa kepada-Ku. Dia menciptakan langit dan bumi dengan hak. Maha Tinggi Allah daripada apa yang mereka persekutukan.” QS. An-Nahl : 2-3 Allah-lah yang menciptakan manusia yang dibebani menjalankan syariat, Dia juga yang menciptakan tempat tinggal mereka dan menundukkan yang ada di langit dan di bumi untuk kepentingan manusia. Selanjutnya Allah mengirimkan para rasul untuk mereka, kitab pun diturunkan untuk mereka, mereka diberi perintah dan larangan. Mereka juga diberitahu bahwa dunia ini adalah tempat bekerja dan sebagai tempat berlalunya para pekerja. Balasan semua amal perbuatan yang mereka perbuat di dalam kehidupan dunia ini akan mereka temukan di akhirat secara sempurna. Allah juga memberikan bukti dan dalil atas kehidupan akhirat dan memberikan sebagian balasan dan siksaan di dunia ini sebagai contoh kecil dari kehidupan akhirat agar mendorong mereka untuk lebih mencari yang disukai dan meninggalkan yang ditakuti. Karena itulah, dalam ayat ini Allah berfirman, “Dan tidaklah Kami menciptakan langit dan bumi kecuali dengan haq,” artinya tidak sia-sia, tapi agar manusia mengetahui keagungan Pencipta langit dan bumi dan sebagai bukti atas kesempurnaanNya. Agar manusia mengetahui bahwa Rabb yang telah menciptakan langit dan bumi dengan keagungan kedua makhluk ini Mahakuasa untuk mengembalikan manusia setelah meninggal dunia untuk menerima balasan amal perbuatan. Penciptaan dan keberadaan langit dan bumi telah ditentukan dalam waktu yang dibatasi. Ketika Allah Yang paling benar UcapanNya memberiatahukan hal itu serta menyebutkan dalil dan menerangi jalan, Allah juga memberitahukan, bahwa meski demikian tetap saja ada segolongan manusia yang berpaling dari kebenaran dan menentang dakwah para rasul seraya berfirman, “Dan orang-orang yang kafir berpaling dari apa yang diperingatkan kepada mereka.” Sedangkan orang-orang yang beriman tatkala mengetahui hakikat hal itu, mereka pun menerima wasiat-wasiat Rabb mereka secara tunduk dan memahaagungkan, sehingga mereka pun mendapatkan segala kebaikan dan terhindar dari segala keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 3: Ketahuilah wahai manusia bahwa Allah tidaklah menciptakan langit dan bumi serta apa yang di antara keduanya kecuali dengan kebenaran yang terkandung di dalamnya kuasa dan keinginan-Nya. Dan benar akan waktu yang telah ditetapkan yaitu hari kiamat, hari dimana bumi dan langit digantikan. Akan tetapi yang mereka menolak ayat-ayat Allah, ingkar dengan nasihat-nasihat Al Qur’an dan petunjuknya, dan tidak berpikir akan hari akhirat, tidak juga berpikir untuk apa dia diciptakan yaitu untuk beribadah kepada Allah saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan tentang penurunan kitab-Nya yang mengandung perintah dan larangan, maka Dia menyebutkan tentang penciptaan langit dan bumi, sehingga Dia menggabung antara menciptakan dan memerintahkan sebagaimana dalam firman-Nya di ayat lain, “Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi. perintah Allah berlaku padanya, agar kamu mengetahui bahwa Allah Maha Kuasa atas segala sesuatu, dan sesungguhnya Allah, ilmu-Nya benar-benar meliputi segala sesuatu.” (Terj. Ath Thalaaq: 12) Oleh karena itu, Allah Subhaanahu wa Ta'aala yang menciptakan manusia, menciptakan tempat tinggal mereka dan menundukkan langit dan bumi untuk mereka lalu Dia mengutus para rasul-Nya dan menurunkan kitab-Nya, Dia memerintahkan dan melarang serta memberitahukan bahwa dunia yang mereka tempati ini adalah tempat beramal dan tempat sementara, bukan tempat tujuan dan tempat persinggahan terakhir, dan bahwa mereka akan pindah ke tempat yang kekal, di mana pada tempat yang kekal itu mereka akan mendapatkan balasan secara sempurna. Allah Subhaanahu wa Ta'aala juga menegakkan dalil yang menerangkan tentang tempat ini (dunia) dan merasakan kepada hamba contoh pahala dan hukuman di dunia agar mendorong mereka untuk mengejar sesuatu yang dicintai dan menjauhkan diri dari yang ditakuti. Yakni bukan untuk main-main atau percuma begitu saja, bahkan untuk mengenalkan kepada hamba keagungan, kekuasaan dan keesaan Penciptanya, dan agar mereka dapat mengetahui kesempurnaan-Nya dan agar mereka mengetahui bahwa yang berkuasa menciptakan keduanya yang demikian besar dan luas, mampu pula mengembalikan hamba setelah matinya untuk diberi balasan, dan bahwa dunia yang mereka tempati ada batas akhirnya. Yaitu sampai hari Kiamat. Setelah Allah Subhaanahu wa Ta'aala memberitahukan hal itu, menegakkan dalil dan menyinari jalan, maka Dia memberitahukan, bahwa sebagian makhluk malah tidak menghendaki melainkan berpaling dari yang hak; berpaling dari dakwah para rasul. Berbeda dengan orang-orang yang beriman, ketika mereka mengetahui hakikat yang sebenarnya, maka mereka menerima wasiat Tuhan mereka dan tunduk kepadanya serta memuliakannya, sehingga mereka memperoleh semua kebaikan dan terhindar dari semua keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 3",
    "description": "Salah satu tujuan utama diturunkannya Al-Qur'an adalah untuk menyatakan keniscayaan hari akhir dan bahwa kehidupan dunia hanya-lah bersifat sementara. Allah menyatakan kami tidak menciptakan langit dan bumi dan apa, yakni segala makhluk yang ada di antara keduanya melainkan dengan cara dan tujuan yang benar yang mengandung hikmah dan dalam batas waktu yang ditentukan. Selanjutnya akan tiba masanya semua ciptaan binasa dan manusia dibangkitkan untuk menerima balasan dari amal perbuatannya. Namun orang-orang yang kafir berpaling dari peringatan yang diberikan kepada mereka. Mereka tidak percaya datangnya hari kiamat dan pembalasan di akhirat nanti atas perbuatan yang mereka lakukan di dunia. 4. Lalu Allah membantah orang-orang yang menyekutukan Allah de-ngan menyatakan bahwa mereka sesungguhnya tidak mempunyai dalil apa pun yang membenarkan keyakinannya. Katakanlah, wahai nabi Muhammad, 'terangkanlah kepadaku wahai orang-orang musy-rik, tentang berhala-berhala atau apa saja yang kamu sembah selain Allah; perlihatkan kepadaku apa yang telah mereka ciptakan dari apa yang ada bumi ini atau adakah peran serta mereka dalam penciptaan langit dan benda-benda angkasa dengan sistemnya yang sangat teratur itu' bawalah kepadaku kitab yang diturunkan sebelum Al-Qur'an ini atau apa pun tulisan-tulisan yang merupakan peninggalan dari pengetahuan orang-orang dahulu yang mendukung perbuatan dan sesembahan kamu, jika kamu orang yang benar. ' sungguh kamu sekalian wahai orang-orang musyrikin, tidak mempunyai alasan sedikit pun tentang apa yang kamu perbuat itu."
  }
]