[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, “ Wahai kaum kami, sesungguhnya kami telah mendengar sebuah kitab yang turun sesudah Musa, ia membenarkan kitab-kitab Allah sebelumnya yang Dia turunkan kepada para RasulNya, ia membimbing kepada kebenaran dan hidayah ke jalan lurus lagi benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Mereka berkata kepada kaumnya, “Wahai kaum kami! Sesungguhnya kami telah mendengar kitab yang diturunkan Allah setelah Musa, membenarkan kitab-kitab yang diturunkan sebelumnya dari sisi Allah. Kitab yang kami dengar ini menuntun kepada kebenaran dan menunjukkan kepada jalan yang lurus, yaitu jalan Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-32. Para jin itu menyeru kaum mereka dengan seruan kekerabatan agar mereka tertarik. Mereka menyampaikan kabar gembira telah mendengar bacaan yang luar biasa yang diturunkan setelah Nabi Musa, yang membenarkan kitab-kitab sebelumnya dan memberi petunjuk kepada agama dan jalan yang benar. Hai kaum kami, terimalah seruan Rasulullah Muhammad yang mengajak untuk beriman kepada Allah, dan berimanlah kepada risalahnya, niscaya Allah akan mengampuni dosa-dosa kalian dan menyelamatkan kalian dari azab yang pedih. Dan barangsiapa yang tidak menerima seruan Rasulullah menuju agama Islam maka dapat bersembunyi dan lari dari Allah, dan tidak akan ada yang dapat menolongnya dari azab Allah. Orang-orang yang jauh dari kebenaran itu berada dalam kesesatan yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قَالُوا۟ يٰقَوْمَنَآ إِنَّا سَمِعْنَا كِتٰبًا أُنزِلَ مِنۢ بَعْدِ مُوسَىٰ (Mereka berkata: “Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al Quran) yang telah diturunkan sesudah Musa) Yakni maka mereka sampai kepada kaum mereka, lalu mengabarkan tentang kitab mulia yang diturunkan untuk penduduk bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Para jin itu berkata: “Wahai kaumku, sungguh kami telah mendengar bacaan yang menakjubkan yang diturunkan setelah kitab Musa.” Mereka berkata seperti itu karena sebelumnya mereka adalah Yahudi, sebagaimana keterangan dari imam Atha’.. Jin tadi menambahkan bahwa Alquran itu sebagai pembenaran kepada kitab-kitab yang lebih dulu diturunkan, seperti Taurat. Alquran memberi petunjuk kepada agama yang benar. Menuju jalan yang lurus yang menuntun kepada surga dan keridhoan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Wahai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al-Qur’an) yang diturunkan setelah Musa sebagai pembenar apa yang datang sebelumnya} kitab-kitab yang diturunkan sebelumnya {yang menunjukkan pada kebenaran dan jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Mereka berkata, ‘Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (al-Quran) yang telah diturunkan sesudah Musa’.” Karena kitab Musa adalah asal kitab Injil serta pedoman Bani Israil dalam hukum-hukum syariat, hanya saja Injil melengkapi serta merubah beberapa hukum yang terdapat dalam Taurat, “yang membenarkan kitab-kitab yang sebelumnya lagi memimpin,” kitab ini yang kita dengar, “kepada kebenaran,” yaitu kebenaran dalam setiap tuntutan dan kebaikan, “dan kepada jalan yang lurus.” Yang menghubungkan kepada Allah dan kepada surgaNya yang berisi ilmu tentang Allah, hukum-hukum dunia dan hukum-hukum balasanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 30: Mereka para jin yang mendengar Al Qur’an dari Nabi ﷺ, masuk islam, beriman dan membenarkan Nabi ﷺ. Kemudian mereka pergi menuju kepada kaum mereka berdakwah mengajak kepada islam dan iman, mereka berkata : Wahai kaumku sunggu kami telah mendengar kitab yang diturunkan setelah Musa, dan kitab ini membenarkan kitab-kitab yang sebelumnya yang Allah telah turunkan kepada para utusan-Nya, kemudian kitab ini sungguh memberikan petunjuk kepada agama yang benar dan menuju jalan yang lurus. Dan firman-Nya : مِنۢ بَعْدِ مُوسَىٰ, berkata Atha’ : Yaitu mereka (para jin) adalah yahudi, atau mereka yang lari dari seruan para jin adalah yahudi. Oleh karena itu tidak disebutkan oleh para jin tentang Isa, padahal Isa adalah Nabi sebelum diutusnya Muhammad ﷺ, karena Musa diutus kepada yahudi, oleh sebab itu mereka tidak mengenal Isa sebagaimana mengenal yahudi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu karena kitab Musa adalah kitab asal (pokok) bagi Injil dan pegangan bagi Bani Israil dalam hukum-hukum syara’, sedangkan Injil hanyalah sebagai pelengkap dan penyempurna serta merubah sedikit sebagian hukum. Yakni menyampaikan kepada Allah dan kepada surga-Nya. Di dalamnya terdapat mengenal Allah, hukum-hukum agama-Nya dan hukum-hukum jaza’i(balasan)-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 30",
    "description": "Kemudian Allah menerangkan lebih lanjut apa yang dikatakan oleh kelompok jin kepada kaumnya dalam memberi peringatan kepada mereka. Mereka berkata, 'wahai kaum kami! sungguh, kami telah mende-ngarkan pembacaan kitab yang agung yaitu Al-Qur'an yang diturunkan oleh Allah setelah kitab nabi musa, yang membenarkan kitab-kitab yang datang sebelumnya, yang membimbing siapa yang mengikuti tuntunannya kepada kebenaran dan menunjukkan mereka kepada jalan yang lurus. 31. Di antara kelompok jin yang mendengar perkataan nabi itu menyeru kaumnya agar beriman kepada Allah, \"wahai kaum kami! terimalah (seruan) orang yang menyeru kepada Allah, yaitu nabi Muhammad, dan berimanlah kepada-Nya, karena seruannya mengajak kamu kepa-da jalan yang benar, dan jika kamu beriman kepadanya dengan mengikuti tuntunannya niscaya dia, yakni Allah yang mengutusnya untuk memberi petunjuk kepada golongan jin dan manusia, akan mengampuni dosa-dosamu dan melepaskan kamu dari azab yang pedih. \" ayat ini memberikan pengertian bahwa pada golongan jin juga berlaku pembalasan Allah berupa ampunan dan selamat dari siksaan pahala bagi siapa yang melaksanakan perintah dan meninggalkan larangan."
  }
]