[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaum kami, penuhilah seruan Rasulullah, Muhammad kepada apa yang dia serukan kepada kalian, benarkanlah dia dan amalkanlah apa yang dia bawa kepada kalian, niscaya Allah mengampuni dosa-dosa kalian dan menyelamatkan kalian dari azab yang pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Wahai kaum kami! Terimalah seruan Muhammad menuju kebenaran yang diserukannya kepada kalian dan berimanlah bahwa dia adalah utusan dari Rabbnya, niscaya Allah akan mengampuni dosa-dosa kalian dan menyelamatkan kalian dari siksa menyakitkan yang menunggu kalian jika kalian tidak menerima seruannya menuju kebenaran yang diserukannya dan tidak beriman bahwa ia adalah utusan dari Rabbnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. يٰقَوْمَنَآ أَجِيبُوا۟ دَاعِىَ اللهِ وَءَامِنُوا۟ بِهِۦ (Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah dan berimanlah kepada-Nya) Yakni berimanlah kepada Muhammad, atau berimanlah kepada al-Qur’an. يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ(niscaya Allah akan mengampuni dosa-dosa kamu) Yakni sebagian dosa-dosa itu. وَيُجِرْكُم مِّنْ عَذَابٍ أَلِيمٍ(dan melepaskan kamu dari azab yang pedih) Yakni azab neraka. Sedangkan orang yang beriman kepadanya akan masuk surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai kaumku, penuhilah seruan utusan Allah, yaitu Muhammad SAW yang menyeru untuk beriman kepada Allah, membenarkannya dan membenarkan ajarannya. Allah akan memberi ampunan atas sebagian dosa kalian yang berkaitan dengan hak-hak Allah. Namun jika ada hak adami (sesama manusia) maka tidak bisa dilebur hanya dengan iman. Hanya bisa lebur dengan keridhoan sesama manusia yang haknya dirampas. Allah akan membebaskan kalian dari azab yang pedih yaitu azab neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaum kami, penuhilah orang yang mengajak kepada Allah} rasulullah Muhammad SAW {dan berimanlah kepadaNya, niscaya Dia akan mengampuni sebagian dosa-dosa kalian dan menyelamatkan kalian} melindungi kalian {dari azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Tatkala para golongan jin itu memuji al-Quran serta menjelaskan kedudukan dan tingkatannya, mereka menyeru kaumnya untuk beriman kepada al-Quran seraya berkata, “Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah,” yaitu yang tidak menyeru kepada selain Allah, tidak menyeru kalian kepada keinginan-keinginan dirinya dan hawa nafsu, ia hanya menyeru kalian kepada Rabb kalian, agar kalian mendapatkan pahala dan menghindarkan kalian dari segala keburukan dan musibah. Karena itulah mereka berkata, “Niscaya Allah akan mengampuni dosa-dosa kamu dan melepaskan kamu dari azab yang pedih.” Jika Allah melindungi mereka dari siksaan pedih, maka tidak ada lagi setelahnya selain kenikmatan, dan inilah balasan orang yang mau menerima seruan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 31: Kemudian mereka terus berdakwah tauhid kepada kaumnya, mereka berkata : Wahai kaumku, terimalah oleh kalian utusan Allah, dan benarkan atas apa yang datang kepada kalian; Karena itu semua adalah sebab ampunan dari dosa-dosa kalian, dan keselamatan kalian dari adzab yang pedih yang mengerikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka telah memuji Al Qur’an dan menerangkan kedudukannya, maka mereka mengajak kaumnya untuk beriman. Dia mengajak kepada Allah, bukan untuk kepentingan diri dan hawa nafsunya. Dia mengajak kamu kepada Allah agar Dia memberimu pahala dan menghindarkan semua perkara buruk dan dibenci. Oleh karena itu, mereka (jin-jin yang masuk Islam) itu berkata, “niscaya Dia akan mengampuni dosa-dosamu dan melepaskan kamu dari azab yang pedih.” Apabila Dia melindungi mereka dari azab yang pedih, maka di sana tidak ada lagi selain kenikmatan. Ini merupakan balasan bagi orang yang memenuhi seruan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 31",
    "description": "Di antara kelompok jin yang mendengar perkataan nabi itu menyeru kaumnya agar beriman kepada Allah, \"wahai kaum kami! terimalah (seruan) orang yang menyeru kepada Allah, yaitu nabi Muhammad, dan berimanlah kepada-Nya, karena seruannya mengajak kamu kepa-da jalan yang benar, dan jika kamu beriman kepadanya dengan mengikuti tuntunannya niscaya dia, yakni Allah yang mengutusnya untuk memberi petunjuk kepada golongan jin dan manusia, akan mengampuni dosa-dosamu dan melepaskan kamu dari azab yang pedih. \" ayat ini memberikan pengertian bahwa pada golongan jin juga berlaku pembalasan Allah berupa ampunan dan selamat dari siksaan pahala bagi siapa yang melaksanakan perintah dan meninggalkan larangan. 32. Selanjutnya sekelompok jin itu memberi peringatan kepada kaumnya yang tidak mau beriman kepada nabi Muhammad. \" dan barang siapa tidak menerima seruan orang yang menyeru kepada Allah yaitu nabi Muhammad maka dia tidak akan dapat melepaskan diri dari siksa Allah di muka bumi, jika Allah berkehendak untuk menimpakan siksa padahal tidak ada pelindung baginya yang dapat melindungi mereka dari siksaan itu selain Allah. Mereka yang tidak mengikuti seruan itu sungguh berada dalam kesesatan yang nyata. ' jalan yang benar telah dijelaskan, dan telah diberikan pula tuntunan bagaimana menempuh jalan itu. Siapa yang menempuh jalan itu akan selamat, dan siapa yang menyeleweng akan mendapat hukuman. Demikian ketetapan Allah yang berlaku bagi golongan jin dan manusia."
  }
]