[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka lupa dan tidak tahu bahwa Allah yang menciptakan langit dan bumi tanpa contoh sebelumnya dan Allah kuasa menciptakannya, kuasa menghidupkan orang-orang mati yang Dia ciptakan sebelumnya? Benar, itu adalah suatu yang mudah bagi Allah yang tidak ada sesuatu pun yang dapat melemahkanNya, karena sesungguhnya Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Tidakkah orang-orang musyrik yang mendustakan hari kebangkitan itu melihat bahwa Allah yang telah menciptakan langit dan menciptakan bumi serta tidak payah dalam menciptakan keduanya dengan segala kebesarannya dan keluasannya, juga kuasa untuk membangkitkan orang yang sudah mati untuk perhitungan amal dan pembalasan? Ya, Dia benar-benar Mahakuasa untuk menghidupkan mereka, dan sesungguhnya Dia -Subḥānahu- Mahakuasa atas segala sesuatu, tidak sulit bagi-Nya untuk menghidupkan orang-orang yang sudah mati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Allah membantah orang-orang yang mengingkari hari kebangkitan: “Tidakkah orang-orang kafir itu mengetahui bahwa Allah Yang Menciptakan tujuh langit dan bumi dan tidak merasa kesulitan dalam menciptakannya itu, Maha Kuasa untuk membangkitkan mereka dari kubur dalam keadaan hidup? Sungguh Allah Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلَمْ يَعْىَ بِخَلْقِهِنَّ (dan Dia tidak merasa payah karena menciptakannya) yakni tidak merasa kesusahan atau kelelahan untuk melakukan itu. بَلَىٰٓ (Ya) Ya, Dia mampu melakukan itu semua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Apakah orang-orang yang mengingkari hari kebangkitan itu tidak tahu bahwa Allah-lah Yang menciptakan langit dan bumi? Allah tidak pernahpayah, tidak pernah merasa lemah atas apa yang telah Allah ciptakan. Dia berkuasa untuk menghidupkan segala yang telah mati. Apa kalian sangka Dia tidak kuasa membangkitkan mereka kembali? Iya, Allah berkuasa untuk melakukan itu, Allah perkasa untuk melakukan segala sesuatu yang Dia kehendaki. Balaa berfungsi untuk membatalkan kalimat negatif. Dan menetapkan kalimat sesudahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi serta tidak merasa lelah dalam menciptakannya} dan tidak lelah karena menciptakannya {Dia berkuasa untuk menghidupkan yang mati. Tentu demikian. Sesungguhnya Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Ini adalah hujjah Allah yang membuktikan bahwa Dia Kuasa mengembalikan manusia setelah kematian, yaitu dengan yang lebih mengena, yaitu “dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi,” dengan kebesaran dan keluasan keduanya dan kesempurnaan penciptaan keduanya tanpa merasa lelah dengan hal itu dan tidak merasa payah menciptakannya, lantas bagaimana tidak mampu untuk mengembalikan kalian, setelah kematian kalian, dan Dia “Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 33: Allah mencela orang-orang kafir atas pengingkaran mereka tentang hari kebangkitan, Allah berkata : Bukankah mereka orang-orang kafir tahu bahwa Allah yang menciptakan langit dan bumi tanpa permisalan sebelumnya, dan Allah tidak lemah dan payah atas penciptaan-Nya. Bukankah mereka tahu bahwa Allah kuasa untuk menghidupkan yang mati sebagaimana awal dia diciptakan ? Maka jawaban atas perkataan Allah adalah benar, bahwa Dialah yang kuasa atas segala sesuatunya, tidak ada yang melemahkan-Nya sesuatupun di bumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mengingkari kebangkitan. Ayat ini merupakan istidlal (pengambilan dalil) dari Allah Subhaanahu wa Ta'aala untuk menunjukkan bahwa Dia mampu menghidupkan orang-orang yang telah mati, yaitu dengan menerangkan bahwa Dia yang telah menciptakan langit dan bumi dengan keadaannya yang besar, luas dan rapih. Dia tidak merasa payah menciptakan semua itu. Oleh karena itu, bagaimana mungkin Dia sulit menciptakan manusia yang telah mati, sedangkan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 33",
    "description": "Selanjutnya ayat-ayat pada bagian akhir dari surah ini menyatakan kecaman terhadap siapa yang tidak menyambut seruan Allah. Kecaman terhadap mereka itu dinyatakan dalam bentuk pertanyaan. Dan tidakkah mereka memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan segala sesuatu yang ada di dalamnya dan dia tidak merasa payah karena menciptakannya dan mengaturnya sepanjang waktu, dan dia kuasa menghidupkan makhluk yang mati' begitulah; sungguh, yang demikian itu adalah mudah bagi Allah, sebab dia mahakuasa atas segala sesuatu. 34. Kemudian dijelaskan bagaimana kedahsyatan yang terjadi pada hari kebangkitan. Dan ingatlah pada hari ketika orang-orang yang kafir dihadapkan kepada neraka sebelum dimasukkan ke dalamnya. Mereka akan ditanya oleh para malaikat, 'bukankah azab ini yang dahulu ketika di dunia diperingatkan oleh para rasul itu benar'' mereka menjawab, 'ya benar, demi tuhan kami, azab itu benar terjadi. ' Allah berfirman, 'maka rasakanlah azab ini karena dahulu ketika di dunia kamu mengingkarinya, yakni tidak percaya kepada Allah dan kepada siksaan-Nya di hari kiamat kepada orang-orang yang tidak menaati-Nya. '."
  }
]