[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersabarlah (wahai rasul) atas apa yang menimpamu berupa gangguan dari kaummu yang mendustakanmu sebagaimana para rasul ulul azmi sebelummu bersabar. Mereka (menurut pendapat yang masyhur) adalah Nuh, Ibrahim, Musa, Isa, dan kamu salah satu dari mereka. Jangan minta disegerakannya azab untuk kaummu, maka ketika azab itu terjadi dan mereka melihat azab itu, mereka akan merasa bahwa mereka tidak tinggal di dunia kecuali sesaat saja. Ini adalah pemberitahuan bagi mereka dan selain mereka. Tidak ada yang dibinasakan oleh azab Allah kecuali orang-orang yang keluar dari perintah Allah dan ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Maka bersabarlah -wahai Rasul- atas pendustaan kaummu kepadamu sebagaimana kesabaran para Rasul yang mempunyai keteguhan hati. Mereka -selain Rasul kita -'alaihiṣ ṣalātu was salām- adalah Nuh, Ibrahim, Musa dan Isa -'alaihissalām-. Dan janganlah engkau minta disegerakan siksa untuk mereka. Pada hari di mana para pendusta dari kaummu melihat siksa yang dijanjikan kepada mereka di Akhirat, seakan-akan mereka tidak tinggal di dunia melainkan hanya sesaat dari siang hari dikarenakan panjangnya masa siksaan mereka. Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini merupakan pelajaran untuk seluruh manusia dan jin. Dan sesungguhnya tidaklah dibinasakan dengan siksa melainkan kaum yang keluar dari ketaatan kepada Allah dengan melakukan kekufuran dan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Hai Rasulullah, bersabarlah atas gangguan dari kaummu, sebagaimana para rasul ulul azmi itu bersabar -mereka adalah Nabi Nuh, Ibrahim, Musa, Isa, dan Muhammad itu sendiri-, dan janganlah kamu terburu-buru berdoa agar orang-orang kafir itu mendapat keburukan, karena keburukan itu pasti akan menimpa mereka cepat atau lambat, dan menimpa mereka pada hari ketika mereka melihat azab dan seakan-akan mereka tidak hidup di dunia melainkan beberapa saat di siang hari saja. Peringatan ini merupakan peringatan bagi mereka dan orang-orang setelah mereka. Dan Allah tidak akan membinasakan melainkan orang-orang yang menyelisihi perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. فَاصْبِرْ كَمَا صَبَرَ أُو۟لُوا۟ الْعَزْمِ مِنَ الرُّسُلِ (Maka bersabarlah kamu seperti orang-orang yang mempunyai keteguhan hati dari rasul-rasul telah bersabar) Ulul ‘Azmi adalah para rasul yang memiliki keteguhan yang kokoh. Dan para rasul yang termasuk dalam ulul ‘azmi ada lima, yaitu: Nuh, Ibrahim, Musa, Isa, dan Muhammad; mereka adalah rasul-rasul yang membawa syari’at-syari’at tersendiri, dan tidak termasuk dari mereka Nabi Yunus dan Adam. وَلَا تَسْتَعْجِل لَّهُمْ ۚ( dan janganlah kamu meminta disegerakan (azab) bagi mereka) Hai muhammad, janganlah kamu mengharap azab yang disegerakan bagi orang-orang kafir. كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ(Pada hari mereka melihat azab yang diancamkan kepada mereka) Yakni azab yang dijanjikan kepada mereka. لَمْ يَلْبَثُوٓا۟ إِلَّا سَاعَةً مِّن نَّهَارٍۭ ۚ (seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari) Karena kengerian yang luar biasa dan musibah yang besar yang mereka saksikan saat itu. بَلٰغٌ ۚ( (Inilah) suatu pelajaran yang cukup) Yakni pelajaran yang kami sampaikan kepada mereka ini adalah hujjah yang tidak mungkin dibantah oleh orang-orang kafir. فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفٰسِقُونَ(maka tidak dibinasakan melainkan kaum yang fasik) Yakni tidak ada yang dibinasakan dengan azab Allah kecuali orang-orang yang enggan mentaati Allah dan yang senantiasa melakukan kemaksiatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Maka bersabarlah wahai Nabi, atas perlakuan umatmu. Bersabarlah seperti keteguhan dan kesabaran para rasul sebelummu. Para rasul itu ada 5 orang, antara lain Nuh, Ibrahim, Musa, Isa dan Muhammad SAW. Mereka adalah pengemban syariat yang agung. Mereka senantiasa bersabar untuk menyampaikan dan mengemban segala kesulitan dan kepayahan dalam berdakwah. Maka janganlah kamu meminta agar azab bagi mereka disegerakan wahai Muhammad. Azab bagi mereka pasti akan mereka terima. Pada hari dimana mereka akan menerima azab mereka merasa bahwa kehidupan mereka di dunia hanya sesaat saja, disebabkan hiruk pikuk dan kepayahan yang sangat dahsyat. Inilah pelajaran yang cukup dari Allah untuk menyanggah hujjah orang-orang kafir. Hal adalah kata tanya yang bisa bermakna negatif yaitu tidak akan binasa kecuali orang-orang kafir yang membangkang dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bersabarlah sebagaimana ulul azmi dari kalangan para rasul} orang-orang yang memiliki keteguhan dan kesabaran di antara para rasul, yaitu Nuh AS, Ibrahim AS, Musa AS, Isa AS, dan Muhammad SAW {telah bersabar dan janganlah meminta agar azab disegerakan untuk mereka} dan janganlah meminta agar disegerakan azab bagi mereka, sesungguhnya itu pasti menimpa mereka bukan mustahil {Pada hari ketika melihat azab yang dijanjikan, seolah-olah mereka tidak tinggal} tidak tinggal di dunia {kecuali hanya sesaat saja pada siang hari. Inilah suatu peringatan} Al-Qur’an ini adalah peringatan yang disampaikan dari Allah kepada mereka {Maka tidak ada yang dibinasakan kecuali kaum yang fasik} yang tidak mau taat kepada Allah."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Kemudian Allah memerintahkan RasulNya untuk bersabar atas gangguan orang-orang yang mendustakan dan menentangnya. Allah memerintahkan RasulNya untuk tetap menyeru mereka kepada Allah serta meneladani kesabaran para rasul yang memiliki keteguhan hati dan para pemimpin manusia, mereka adalah pemilik keteguhan hati serta tekad yang tinggi, kesabaran mereka begitu besar dan keyakina mereka sempurna. Mereka adalah sosok manusia yang perlu diteladani dan cahaya mereka harus dijadikan petunjuk. Rasulullah melaksanakan perintah Rabbnya kemudian bersabar dengan kesabaran yang belum pernah dilakukan oleh para nabi sebelumnya, hingga para penentang saling bahu membahu menyerang bersama. Mereka semua berusaha menghalangi Rasulullah agar tidak bisa berdakwah. Orang-orang musyrik melakukan berbagai tindakan permusuhan dan memerangi beliau sebisa mungkin. Namun Rasulullah tetap tegar melaksanakan perintah Allah, tetap berdiri untuk berjihad melawan musuh-musuh Allah, bersabar atas gangguan yang beliau terima hingga Allah meneguhkan kedudukan beliau di muka bumi dan memenagkan agamaNya di atas seluruh agama serta memenangkan umatnya atas seluruh umat yang ada. Semoga kesejahteraan dan keselamatan tetap terlimpah untuk beliau. Firman Allah, “Maka janganlah kamu meminta disegerakan (azab) bagi mereka.” Artinya, untuk mereka yang mendustakan dan meminta disegerakan siksanya, hal ini diucapkan karena kebodohan dan ketololan mereka. Jangan sampai kebodohan mereka membuatmu berkecil hati dan jangan sampai permintaan mereka agar disegerakan siksanya yang kau lihat itu membuatmu mendoakan keburukan bagi mereka, karena semua yang akan datang itu dekat masanya. “Seolah-olah mereka,” pada saat “melihat apa yang dijanjikan kepada mereka, mereka (merasa) seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari.” Janganlah kesenangan sesaat mereka itu membuatmu bersedih karena mereka akan menuju azab yang berakibat buruk. “Suatu pelajaran yang cukup,” yakni, dunia ini dengan berbagai kesenangan dan kenikmatannya adalah sebagai penyampai dan pendorong waktu yang akan datang sesaat lagi, atau al-Quran ini yang kami jelaskan kepada kalian terdapat padanya penjelasan yang nyata dan sebagian pelajaran bagi kalian serta sebagai bekal untuk kehidupan akhirat. Al-Quran adalah bekal dan pelajaran terbaik, bekal yang akan menuntun ke surga yang penuh kenikmatan dan menjaga mereka dari siksa yang pedih. Al-Quran adalah bekal terbaik yang dijadikan bekal oleh manusia dan nikmat terbesar yang diberikan Allah kepada mereka. “Maka tidak dibinasakan,” dengan hukuman-hukuman “melainkan kaum yang fasik,” yaitu orang-orang yang tidak memiliki kebaikan, mereka telah keluar dari jalur ketaatan terhadap Rabb mereka, tidak mau menerima kebenaran yang dibawa para rasul kepada mereka. Allah telah menyampaikan udzur dan memberikan peringatan kepada mereka setelah itu, namun karena mereka tetap mendustakan dan kufur, maka mereka mendapatkan siksaan yang pedih. Semoga Allah berkenan memberikan kita penjagaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 35: Allah mengakhiri surat ini dengan nasihat kepad Nabi ﷺ untuk bersabar atas apa yang telah menimpanya dari celaan dan penghinaan dari orang-orang sombong dan dzalim; Dimana Allah memerintahkan bersabar sebagaimana sabarnya Ulul Azmi dan kokohnya para Rasul yang mereka adalah : Nuh, Ibrahim, Musa, Isa dan Muhammad. Allah juga memerintahkan agar tidak tergesa-gesa memintakan adzab bagi kaumnya, karena adzab itu pasti datang tanpa ragu. Ketahuilah bahwa Al Qur’an ini yang kalian diperingatkan dengan diutusnya Muhammad ﷺ telah disampaikan secara sempurna dalam nasihat dan peringatan kepada kalian. Kemudian Allah menyebutkan bahwa kebinasaan dan kerugiaan bagi mereka yang keluar dari ketaatan kepada Allah dan perintah-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam untuk bersabar menghadapi gangguan orang-orang yang mendustakan dan menentangnya, dan agar Beliau senantiasa mengajak manusia kepada Allah serta mengikuti kesabaran para rasul ulul ‘azmi (yang mempunyai keteguhan hati dan cita-cita yang tinggi), dimana mereka adalah para pemimpin manusia yang kuat kesabarannya, sempurna keyakinannya dan mereka adalah manusia yang paling berhak diteladani dan diikuti jejaknya. Maka Nabi Muhammad shallallahu 'alaihi wa sallam melaksanakan perintah Tuhannya, Beliau pun bersabar dengan kesabaran yang tidak pernah dilakukan oleh nabi sebelumnya, sampai musuh-musuhnya berkumpul bersama menentang dakwah Beliau, tetapi Beliau tegar mendakwahi manusia kepada Allah, bahkan sampai melakukan jihad melawan musuh-musuh Allah, bersabar terhadap gangguan yang menimpa Beliau sampai Allah memberikan kekuasaan kepada Beliau, memenangkan agama-Nya di atas semua agama serta melebihkan umatnya di atas semua umat, maka semoga shalawat dan salam Allah dilimpahkan kepada Beliau. Yang meminta untuk disegerakan azab. Mereka meminta disegerakan azab adalah karena kebodohan mereka, oleh karena itu jangan terpengaruh olehnya sehingga membuatmu mendoakan keburukan atas mereka.. Oleh karena itu, janganlah kamu dibuat sedih karena mereka bersenang-senang. Hal itu, karena mereka hanya sebentar saja bersenang-senang dan akan kembali kepada azab yang pedih. Kata-kata “balaagh” bisa tertuju kepada kehidupan dan kesenangan dunia yang keadaannya memadai namun kurang. Atau bisa juga maksudnya, bahwa di dalam Al Qur’an ini Allah telah jelaskan dengan penjelasan yang sempurna, cukup dan menyampaikan ke kampung akhirat. Ia adalah sebaik-baik bekal yang dapat menyampaikan ke surga dan memelihara seseorang dari neraka, ia merupakan bekal paling utama yang harus dipegang oleh seseorang agar sampai ke sana, dan merupakan nikmat yang paling besar yang Allah anugerahkan kepada mereka. Dengan berbagai siksaan. Mereka adalah orang-orang yang sudah tidak ada lagi kebaikannya, telah keluar dari ketaatan kepada Tuhan mereka dan tidak menerima kebenaran yang dibawa para rasul. Allah Subhaanahu wa Ta'aala telah memperingatkan mereka, namun mereka tetap saja berada di atas pendustaan dan kekafiran. Kita berlindung kepada Allah dari hal tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 35",
    "description": "Akhir dari surah ini memberikan nasihat kepada nabi Muhammad agar bersabar dalam berdakwah kepada kaumnya dan jangan meminta agar disegerakan azab kepada oran-orang yang tidak menyambut seru-annya. Maka bersabarlah engkau, wahai nabi Muhammad, sebagaimana kesabaran rasul-rasul yang memiliki keteguhan hati dalam menghadapi setiap kesulitan dalam menyampaikan tuntunan Allah kepada umatnya. Dan janganlah engkau meminta kepada Allah dengan berdoa agar azab disegerakan untuk mereka sebab azab itu pasti datang pada waktu yang ditentukan-Nya. Pada hari mereka melihat azab yang dijanjikan, sesaat sebelum kematian mereka atau kelak pada hari kiamat mereka merasa disebabkan oleh dahsyatnya azab itu seolah-olah tinggal di dunia hanya sesaat saja pada siang hari. Tugasmu hanya menyampaikan apa yang diwahyukan Allah kepada mereka, bukan untuk menjadikannya ber-iman ataupun menimpakan azab atasnya. Azab adalah urusan Allah yang dijatuhkan dengan seadil-adilnya. Maka tidak ada yang dibinasakan, kecuali kaum yang fasik yakni orang-orang yang tidak taat kepada Allah. 1. Ayat yang terakhir dari surah al-ahq'f menyebutkan ancaman kepada orang-orang fasik bahwa mereka akan dibinasakan oleh Allah. Ayat pertama dari surah ini menjelaskan ciri-ciri dari orang-orang fasik tersebut. Allah menjelaskan bahwasanya mereka ialah orang-orang yang kafir kepada Allah dan rasul-Nya dan menghalang-halangi manusia dari jalan Allah, yakni menghalang-halangi mereka memeluk islam atau menghalang-halangi mereka beribadah di masjidil haram. Allah menghapus segala amal mereka, maka tidak ada pahala bagi amalnya itu dan tidak menyelamatkan dari api neraka disebabkan kekafirannya."
  }
]