[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang kafir, “apakah kalian melihat tuhan-tuhan dan berhala-berhala yang kalian sembah selain Allah, tunjukkanlah kepadaku apa yang telah mereka ciptakan di bumi, atau mereka punya bagian kewenangan bersama Allah dalam menciptakan langit? Hadirkanlah kepadaku sebuah kitab dari sisi Allah sebelum al-Quran ini atau sisa ilmu, bila kalian memang benar dalam apa yang kalian klaim.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Katakanlah -wahai Rasul- kepada orang-orang kafir yang berpaling dari kebenaran, “Katakan kepadaku tentang berhala-berhala yang kalian sembah selain Allah, apa yang telah mereka ciptakan dari bagian-bagian bumi ini? Adakah mereka menciptakan gunung? Adakah mereka menciptakan sungai? Ataukah mereka mempunyai peran dan bagian bersama Allah dalam menciptakan langit? Datangkan kepadaku satu kitab yang diturunkan dari sisi Allah sebelum Al-Qur`ān atau sisa dari pengetahuan yang ditinggalkan oleh orang-orang terdahulu jika kalian jujur dalam pengakuan kalian bahwa berhala-berhala kalian berhak untuk disembah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قُلْ أَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ اللهِ (Katakanlah: “Terangkanlah kepadaku tentang apa yang kamu sembah selain Allah) Berupa berhala-berhala, penghuni kuburan, dan thagut. أَرُونِى مَاذَا خَلَقُوا۟ مِنَ الْأَرْضِ (perlihatkan kepada-Ku apakah yang telah mereka ciptakan dari bumi ini) Yakni sesuatu yang mereka ciptakan dari bumi. أَمْ لَهُمْ شِرْكٌ فِى السَّمٰوٰتِ ۖ (atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit?) Apakah mereka memiliki sebagian langit. ائْتُونِى بِكِتٰبٍ مِّن قَبْلِ هٰذَآ (Bawalah kepada-Ku Kitab yang sebelum (Al Quran) ini) Karena al-Qur’an telah menjelaskan kebatilan perbuatan syirik dan Allah adalah esa yang tidak memiliki sekutu serta hari kiamat pasti akan datang dan tidak ada keraguan tentang itu; maka apakah orang-orang musyrik memiliki kitab samawi yang menyelisihi al-Qur’an. أَوْ أَثٰرَةٍ مِّنْ عِلْمٍ(atau peninggalan dari pengetahuan (orang-orang dahulu)) Yakni peninggalan sebuah ilmu, atau suatu peninggalan dari nabi sebelum Muhammad. Ibnu ‘Abbas berkata makna (الأثارة) yakni tulisan, yaitu suatu peninggalan yang berupa tulisan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Katakanlah kepada kaum musyrik wahai Nabi: “Beritahu aku, tentang keadaan berhala dan patung yang kalian sembah. Tunjukkan kepadaku sesuatu yang telah mampu tuhan kalian ciptakan di bumi ini, atau adakah peran serta mereka dalam penciptaan langit? Tunjukkan kepadaku kitab yang diturunkan sebelum Alquran. Atau juga jika memang kalian benar, tunjukkan ilmu yang diriwayatkan dari para pendahulu yang menunjukkan kebenaran kalian dalam penyembahan berhala ini, apakah benar ini dapat mendekatkan diri kepada Allah? Maksud dari sini adalah kalian semua tidak memiliki dasar apapun atas apa yang kalian serukan. Am adalah hamzah untuk bertanya yang bermaksud menyanggah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Bagaimana pendapat kalian tentang apa yang kalian sembah selain Allah. Perlihatkanlah kepadaku apakah yang telah mereka ciptakan dari bumi atau mereka ikut serta dalam (penciptaan) langit} mereka memiliki andil dan bagian bersama Allah dalam menciptakan langit Datangkanlah kepadaku kitab yang sebelum ini atau peninggalan dari pengetahuan} sisa-sia keilmuan yang ditinggalkan oleh orang-orang terdahulu {jika kalian adalah orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Artinya, “katakanlah,” kepada mereka yang menyekutukan Allah dengan patung dan sekutu yang tidak memiliki manfaat dan juga memiliki kehidupan, kematian dan kebangkitan. Katakanlah kepada mereka seraya menjelaskan lemahnya berhala-berhala mereka dan berhala-berhala tersebut sama sekali tidak berhak disembah, “Perlihatkanlah kepadaKu apakah yang telah mereka ciptakan dari bumi ini atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit.” Artinya, apakah sesembahan-sesembahan selain Allah itu mampu menciptakan bintang di langit atau menciptakan sesuatu di bumi, apakah mereka mampu menciptakan gunung, apakah mereka yang mengalirkan sungai, apakah mereka mengembangbiakkan hewan, apakah mereka menumbuhkan pohon, apakah di antara sesembahan-sesembahan selain Allah itu membantu Allah dalam menciptakan salah satu dari makhluk? Tentu tidak, berdasarkan pengakuan mereka sendiri, lebih-lebih pengakuan yang lain. Ini merupakan dalil aqli yang jelas dan tegas yang menunjukkan bahwa penyembahan selain Allah adalah batil. Selanjutnya Allah menyebutkan dalil naqli “Bawalah kepadaKu kitab yang sebelum (al-Quran) ini,” yaitu sebuah kitab yang menyerukan untuk berbuat syirik, “atau peninggalan dari pengetahuan,” yang diwariskan oleh para rasul yang memerintahkan hal itu. Dapat diketahui, orang-orang musyrik tidak mampu menunjukkan dalil yang menunjukkan adanya seorang rasul pun yang memerintahkan untuk berbuat syirik. Kita semua yakin bahwa semua rasul memerintahkan untuk mengesakan Allah dan melarang untuk berbuat syirik, dan inilah ilmu terbesar yang mereka wariskan. Allah berfirman, “Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan): “Sembahlah Allah (saja), dan jauhilah Thaghut itu”-AnNahl:36- Dan setiap Rasul berkata kepada kaumnya, “sembahlah Allah, sekali-kali tak ada Tuhan bagimu selain-Nya” -Al A’raf:59- Maka dapat diketahui bahwa penolakan orang-orang musyrik tentang perbuatan syirik yang mereka lakukan sama sekali tidak berdasar pada bukti maupun dalil. Mereka hanya berlandaskan pada dugaan dusta, pendapat runtuh, serta akal yang rusak. Hal itu menunjukkan kepada kita semua akan runtuhnya dugaan, pandangan, serta akal sehat mereka melalui penelusuran terhadap kondisi mereka, ilmu dana mal, serta dengan meneliti orang-orang yang menghabiskan usia mereka dalam menyembah berhala dan sesembahan selain Allah, apakah hal itu berguna bagi mereka di dunia dan di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 4: Katakan wahai Nabi Allah ﷺ kepada orang-orang musyrik dengan hinaan dan celaan : Bukankah tuhan-tuhan ini, patung-patung ini dan sesembahan lainnya dari para makhluk yang kalian ibadah selain Allah, (katakanlah kepadaku) apakah mereka ini dapat menciptakan makhluk yang lain ? Atau mereka adalah sekutu-sekutu Allah dalam penciptaan langit ? Maka jika tidak dapat menciptakan sesuatupun, dan bukan sekutu dalam sesuatu, lalu bagaimana bisa kalian beribadah kepada selain Allah, apa yang tidak membawa keburukan dan manfaat ? Bukankah ini adalah kesesatan dan kerusakan yang nyata ?, kemudian berikanlah oleh kalian wahai orang-orang musyrik satu kitab yang datang dari sisi Allah yang turun sebelum Al Qur’an ini atau kabarkan yang menguatkan amalan kalian dan menjadi bukti atas benarnya apa yang kalian kerjakan dari syirik dan kesesatan, jika kalian orang-orang yang benar sebagaimana klaim kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang menyekutukan Allah dengan patung dan berhala yang tidak dapat memberi manfaat dan tidak dapat menghindarkan bahaya, tidak dapat menghidupkan dan tidak dapat mematikan, yakni katakan kepada mereka untuk menerangkan lemahnya sesembahan mereka dan bahwa sesembahan itu tidak berhak disembah. Yakni apakah mereka menciptakan benda-benda langit atau bumi? Apakah mereka menciptakan gunung atau mengalirkan sungai? Apakah mereka yang menyebarkan hewan-hewan dan menumbuhkan tumbuh-tumbuhan atau apakah mereka ikut serta dan membantu dalam hal semua itu? Jelas sekali, mereka tidak menciptakan dan tidak pula memiliki peran serta dalam hal itu. Ini merupakan dalil ‘aqli (akal) yang menunjukkan bahwa selain Allah semuanya tidak berhak disembah. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan alasan kedua secara riwayat (dalil naqli), yakni apakah ada kitab yang menyuruh berbuat syrik atau ilmu yang diwariskan dari para rasul yang menyuruh demikian, bahkan semua kitab dan semua rasul mengajak mentauhidkan Allah Subhaanahu wa Ta'aala dan melarang berbuat syirk. Dengan demikian, perdebatan orang-orang musyrik untuk menguatkan kemusyrikan mereka sama sekali tidak bersandar kepada dalil maupun bukti, bahkan hanya bersandar kepada sangkaan-sangkaan yang dusta, pandangan-pandangan yang tidak laku dan tidak dipandang, serta akal yang rusak. Hal ini dapat diketahui jika menelusuri keadaan mereka, pengetahuan dan amal mereka serta melihat keadaan orang yang menghabiskan umurnya untuk menyembah patung dan berhala itu, apakah memberi manfaat bagi mereka meskipun sedikit di dunia dan akhirat sebagaimana diterangkan dalam ayat selanjutnya, “Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doa) nya sampai hari kiamat dan mereka lalai dari (memperhatikan) doa mereka?” (Terj. Al Ahqaaf: 5) Yang membenarkan dakwaanmu menyembah patung dan berhala, dan bahwa mereka dapat mendekatkan kamu kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 4",
    "description": "Lalu Allah membantah orang-orang yang menyekutukan Allah de-ngan menyatakan bahwa mereka sesungguhnya tidak mempunyai dalil apa pun yang membenarkan keyakinannya. Katakanlah, wahai nabi Muhammad, 'terangkanlah kepadaku wahai orang-orang musy-rik, tentang berhala-berhala atau apa saja yang kamu sembah selain Allah; perlihatkan kepadaku apa yang telah mereka ciptakan dari apa yang ada bumi ini atau adakah peran serta mereka dalam penciptaan langit dan benda-benda angkasa dengan sistemnya yang sangat teratur itu' bawalah kepadaku kitab yang diturunkan sebelum Al-Qur'an ini atau apa pun tulisan-tulisan yang merupakan peninggalan dari pengetahuan orang-orang dahulu yang mendukung perbuatan dan sesembahan kamu, jika kamu orang yang benar. ' sungguh kamu sekalian wahai orang-orang musyrikin, tidak mempunyai alasan sedikit pun tentang apa yang kamu perbuat itu. 5. Orang-orang yang menyekutukan Allah adalah orang-orang yang menempuh jalan sesat yang tidak dapat diterima oleh akal sehat. Allah menyatakan pada ayat ini 'dan siapakah yang lebih sesat daripada orang-orang yang menyembah selain Allah, ' yakni tidak ada yang lebih sesat daripada orang-orang yang menyembah selain Allah yang sesembahan itu tidak dapat memperkenan'kan doanya dan mengabulkan permintaannya sampai hari kiamat dan mereka lalai dari memperhati'kan doa mereka' berhala-berhala atau apa yang mereka sembah itu lalai dari dari memperhatikan doanya sebab mereka adalah benda-benda mati yang tidak dapat mengerti ataupun mendengar permintaannya."
  }
]