[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada yang lebih sesat dan lebih bodoh daripada orang yang berdoa kepada tuhan-tuhan selain Allah yang tidak menjawab doanya selamanya, karena semua itu hanyalah orang-orang mati, pohon-pohon, batu-batu dan yang sepertinya, ia tidak mengetahui doa orang yang menyembahnya, tidak kuasa memberikan manfaat atau mudarat baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Tidak ada seorangpun yang lebih sesat daripada orang yang menyembah berhala di samping menyembah Allah, yang tidak mampu menjawab doa mereka hingga hari Kiamat, dan berhala-berhala yang mereka sembah selain Allah ini lalai dari doa orang-orang yang menyembahnya, karena ia adalah benda mati, tidak bisa mendengar, tidak bisa melihat dan tidak berakal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Tidak ada yang lebih sesat daripada orang musyrik yang menyembah tuhan-tuhan selain Allah, yang tidak mampu mengabulkan doa meski sampai dunia ini hancur, mereka tetap tidak mampu mengabulkan doanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَمَنْ أَضَلُّ مِمَّن يَدْعُوا۟ مِن دُونِ اللهِ مَن لَّا يَسْتَجِيبُ لَهُۥٓ (Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doa)nya) Yakni tidak ada yang lebih sesat dan lebih jahil darinya, sebab dia memohon kepada sesuatu yang tidak dapat mendengar. Bagaimana ia dapat mengabulkan permohonan mereka, terlebih lagi memberi manfaat atau menolak mudharat, meskipun dia berdoa kepadanya sampai hari kiamat. إِلَىٰ يَوْمِ الْقِيٰمَةِ وَهُمْ عَن دُعَآئِهِمْ غٰفِلُونَ (sampai hari kiamat dan mereka lalai dari (memperhatikan) doa mereka?) Yakni berhala-berhala yang mereka berdoa kepadanya tidak dapat mendengar atau memahami doa mereka, sebab ia hanya benda mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Tidak ada yang lebih sesat daripada orang musyrik yang menyembah sesuatu yang tidak berhak sama sekali untuk disembah. Sesuatu yang tidak bisa memenuhi permintaan mereka selamanya sampai hari kiamat. Sesembahan itu adalah berhala dan patung-patung, yang tidak bisa menerima doa dan ibadah mereka, karena sesembahan mereka semua adalah benda mati, tidak berakal dan tidak mendengar. Kalimat terakhir bertujuan sebagai pembenaran kalimat sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih sesat} tidak ada yang lebih sesat {daripada orang yang menyembah selain Allah kepada sesembahan yang tidak dapat mengabulkannya sampai hari kiamat dan mereka lalai dari doa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Karena itulah Allah berfirman, “Dan siapakah yang lebih sesat daripada orang yang menyembah sesembahan-sesembahan selain Allah yang tiada dapat memperkenankan (doanya) sampai Hari KIamat?” yakni, selama waktu ketika mereka berada di dunia, sesembahan-sesembahan selain Allah itu sama sekali tidak membawa manfaat sekecil atom sekalipun, “dan mereka lalai dari (memperhatikan) doa mereka.” Para sesembahan selain Allah itu tidak bisa mendengar satu pun permintaan mereka dan tidak mampu pula mengabulkannya. Ini adalah kondisi mereka di dunia. Sedangkan pada Hari KIamat, para sesembahan itu akan mengingkari kesyirikan yang mereka lakukan. Ketika semua manusia dikumpulkan, semua sesembahan selain Allah menjadi musuh orang-orang musyrik. Mereka saling melaknat satu sama lain. Semua sesembahan selain Allah mengingkari sesembahan yang dilakukan oleh orang-orang musyrik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 5: Ketahuilah wahai manusia bahwa sungguh tidak ada satupun kesesatan yang benar-benar sesat dan bodoh kecuali dari orang-orang musyrik yang mereka beribadah kepada selain Allah dengan menyembah patung-patung dan benda-benda mati yang tidak dapat menjawab doa-doa mereka, tidak pula mendengar ucapan mereka dan tidak pula memikirkan akan permohonan mereka meskipun mereka duduk berbicara dengan sesembahan-sesembahan tersebut sampai hari kiamat. Karena patung-patung dan benda-benda ini lali akan mereka yang menyembah; Bahkan tidak mengerti sesuatupun, tidak juga merasakan keadaan mereka yang menyembah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang lebih sesat. Maksudnya selama hidupnya di dunia, ia tidak dapat mengambil manfaat apa-apa dari sesembahannya. Bisa juga maksudnya, bahwa sesembahan itu tidak dapat mendengar doa mereka dan tidak dapat menjawab seruan. Inilah keadaan mereka ketika di dunia, adapun pada hari Kiamat, maka sesembahan itu akan mengingkari kesyirkkan mereka sebagaimana diterangkan dalam ayat selanjutnya, dan bahwa sebagian mereka akan saling laknat-melaknat dan akan saling berlepas diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 5",
    "description": "Orang-orang yang menyekutukan Allah adalah orang-orang yang menempuh jalan sesat yang tidak dapat diterima oleh akal sehat. Allah menyatakan pada ayat ini 'dan siapakah yang lebih sesat daripada orang-orang yang menyembah selain Allah, ' yakni tidak ada yang lebih sesat daripada orang-orang yang menyembah selain Allah yang sesembahan itu tidak dapat memperkenan'kan doanya dan mengabulkan permintaannya sampai hari kiamat dan mereka lalai dari memperhati'kan doa mereka' berhala-berhala atau apa yang mereka sembah itu lalai dari dari memperhatikan doanya sebab mereka adalah benda-benda mati yang tidak dapat mengerti ataupun mendengar permintaannya. 6. Setelah Allah menerangkan bahwa sesembahan mereka tidak dapat memberi manfaat di dunia dan tidak dapat mengabulkan permintaan mereka, lalu Allah menerangkan ihwal sesembahan itu kelak di akhirat. Dan apabila manusia dikumpulkan kelak pada hari kiamat, sesembah-an yang disembah oleh orang-orang musyrik itu menjadi musuh mereka para penyembah itu. Mereka berlepas diri dari perbuatan mereka dan mengingkari pemujaan-pemujaan yang mereka lakukan kepadanya."
  }
]