[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila manusia dibangkitkan di Hari Kiamat untuk menghadapi hisab dan pembalasan, tuhan-tuhan yang mereka sembah ketika di dunia akan menjadi musuh bagi mereka, tuhan-tuhan tersebut melaknat mereka dan berlepasdiri dari mereka, serta mengingkari apa yang mereka lakukan terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Meski berhala-berhala itu tidak memberi manfaat kepada mereka saat di dunia, pada saat mereka dikumpulkan pada hari Kiamat berhala-berhala itu menjadi musuh bagi orang-orang yang pernah menyembahnya sebelumnya, berlepas diri dari mereka dan berhala-berhala itu mengingkari bahwa ia mengetahui telah disembah oleh mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Jika para hamba Allah dikumpulkan pada hari kiamat, maka tuhan-tuhan yang dahulu mereka sembah di dunia akan menjadi musuh mereka, dan tuhan-tuhan itu akan berlepas diri dari mereka dan mengaku tidak mengetahui orang-orang itu telah menyembah mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَإِذَا حُشِرَ النَّاسُ كَانُوا۟ لَهُمْ أَعْدَآءً (Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka) Yakni jika orang-orang yang menyembah berhala-berhala dibangkitkan dan dikumpulkan maka berhala-berhala itu hanya akan menjadi musuh-musuh mereka yang berlepas diri dan melaknat mereka. Dikatakan bahwa Allah ketika itu akan menghidupkan berhala-berhala itu kemudian ia akan mendustakan mereka. Sedangkan para malaikat, ‘Uzair, dan setan, maka mereka akan berlepas diri pada hari kiamat dari orang-orang yang menyembah mereka. وَكَانُوا۟ بِعِبَادَتِهِمْ كٰفِرِينَ (dan mengingkari pemujaan-pemujaan mereka) Yakni makhluk-makhluk yang disembah oleh orang-orang musyrik itu akan mengingkari dan mendustai mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Apabila para penyembah berhala itu dikumpulkan di hari kiamat, maka berhala-berhala itu akan menjadi musuh mereka. Berhala-berhala itu akan mengingkari pemujaan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila manusia dikumpulkan, mereka itu menjadi musuh-musuh mereka dan mereka mengingkari peribadatan yang mereka kepadanya} mereka ingkar terhadap peribadatan hamba-hamba mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Karena itulah Allah berfirman, “Dan siapakah yang lebih sesat daripada orang yang menyembah sesembahan-sesembahan selain Allah yang tiada dapat memperkenankan (doanya) sampai Hari KIamat?” yakni, selama waktu ketika mereka berada di dunia, sesembahan-sesembahan selain Allah itu sama sekali tidak membawa manfaat sekecil atom sekalipun, “dan mereka lalai dari (memperhatikan) doa mereka.” Para sesembahan selain Allah itu tidak bisa mendengar satu pun permintaan mereka dan tidak mampu pula mengabulkannya. Ini adalah kondisi mereka di dunia. Sedangkan pada Hari KIamat, para sesembahan itu akan mengingkari kesyirikan yang mereka lakukan. Ketika semua manusia dikumpulkan, semua sesembahan selain Allah menjadi musuh orang-orang musyrik. Mereka saling melaknat satu sama lain. Semua sesembahan selain Allah mengingkari sesembahan yang dilakukan oleh orang-orang musyrik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 6: Allah menjelaskan bahwa Allah akan berbicara kepada hamba-Nya yang menyembah-Nya pada hari kiamat; Allah mengabarkan bahwa manusia jika dibangkitkan pada hari kiamat untuk dihisab; Maka pada hari itu orang-orang yang mereka sayangi, patung-patung dan sesembahan-sesembahan akan menjadi musuh bagi para penyembahnya; Dimana mereka (yang disembah) berlepas diri kepada yang menyembah, mereka saling melaknat satu sama lain, dan berlepas diri satu sama lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 6",
    "description": "Setelah Allah menerangkan bahwa sesembahan mereka tidak dapat memberi manfaat di dunia dan tidak dapat mengabulkan permintaan mereka, lalu Allah menerangkan ihwal sesembahan itu kelak di akhirat. Dan apabila manusia dikumpulkan kelak pada hari kiamat, sesembah-an yang disembah oleh orang-orang musyrik itu menjadi musuh mereka para penyembah itu. Mereka berlepas diri dari perbuatan mereka dan mengingkari pemujaan-pemujaan yang mereka lakukan kepadanya. 7. Pada ayat yang lalu Allah menerangkan dalil-dalil untuk menolak argumentasi orang-orang yang menyekutukan Allah dan tidak percaya kepada hari akhir. Akan tetapi mereka menolak dalil-dalil yang dinyatakan dalam Al-Qur'an itu, bahkan mereka menuduhnya dengan tuduhan yang keji. Allah menyatakan; dan apabila kepada mereka dibacakan ayat-ayat kami yang jelas, yang bertebaran di dalam kitab suci Al-Qur'an orang-orang yang kafir yang mendustakan Allah dan rasul-Nya berkata ketika kebenaran ayat-ayat Al-Qur'an itu datang kepada mereka, 'ini adalah sihir yang nyata. '."
  }
]