[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang musyrik itu berkata, “Muhammad lah yang membuat-buat al-Quran ini”? katakanlah kepada mereka (wahai Rasul) “Bila aku mengada-ngada kedustaan atas nama Allah, niscaya kalian tidak akan sanggup menolak hukuman Allah terhadapku sedikitpun bila Allah hendak menghukumku karena itu. Allah lebih mengetahui dari siapa pun selainNya tentang apa yang kalian ucapkan tentang al-Quran. Cukuplah Allah sebagai saksi atas diriku dan diri kalian. Maha Pengampun bagi siapa yang bertaubat, Maha Penyayang kepada hamba-hambaNya yang berimn.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Apakah orang-orang musyrik itu mengatakan bahwa Muhammad membuat-buat Al-Qur`ān ini dan menisbahkannya kepada Allah? Katakan -wahai Rasul- kepada mereka, “Jika aku membuat-buatnya dari diriku sendiri, maka kalian tidak punya alasan untukku jika Allah ingin menyiksaku, maka bagaimana mungkin aku menyediakan diriku untuk disiksa karena sengaja membuat-buatnya? Allah Maha tahu akan apa yang kalian bicarakan tentang hinaan kalian terhadap Al-Qur`ān dan celaan kalian terhadapku. Cukuplah Allah sebagai saksi antara diriku dan kalian, Dia Maha Pengampun atas dosa-dosa orang yang bertobat dari hamba-hamba-Nya, Maha Penyayang terhadap mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-10. Apakah mereka mengatakan, ‘Muhammad yang telah membuat al-Qur’an ini sendiri’? Hari Rasulullah, katakanlah kepada mereka: “Andai saja aku membuatnya sendiri dan mengatakan itu dari Allah, maka kalian tidak akan mampu melindungiku dari azab Allah jika Dia segera menyiksaku karena perbuatan itu. Allah Maha Mengetahui tuduhan kalian terhadap al-Qur’an, dan cukup Allah sebagai saksiku bahwa aku adalah orang yang benar dan kalian adalah orang-orang yang ingkar. Dia Maha Pengampun dan Pengasih bagi orang-orang yang bertaubat.” Dan katakanlah kepada mereka: “Aku bukanlah Rasul yang pertama, Allah telah mengutus para nabi dan rasul sebelumku. Dan aku tidak mengetahui apa yang akan Allah lakukan terhadap diriku dan kalian di dunia; aku hanya mengikuti al-Qur’an yang diwahyukan kepadaku, dan aku hanyalah pemberi peringatan dengan berbagai mukjizat dan bukti yang jelas.” Katakan juga kepada mereka: “Sampaikanlah kepadaku, jika al-Qur’an ini dari Allah namun kalian mengingkarinya, sedangkan orang dari Bani Israil -seperti Abdullah bin Salam- telah bersaksi bahwa al-Qur’an ini benar, dan kalian enggan mengimaninya. Allah tidak akan memberi hidayah bagi orang-orang kafir agar mengikuti kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَمْ يَقُولُونَ افْتَرَىٰهُ ۖ (Bahkan mereka mengatakan: “Dia (Muhammad) telah mengada-adakannya (Al Quran)”) Yakni membuat al-Qur’an sendiri namun mengatakan itu dari Allah. قُلْ إِنِ افْتَرَيْتُهُۥ(Katakanlah: “Jika aku mengada-adakannya) Yakni sebagai pengandaian saja sebagaimana yang mereka tuduhkan. فَلَا تَمْلِكُونَ لِى مِنَ اللهِ شَيْـًٔا ۖ( maka kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu) Maka kalian tidak akan mampu menghindarkanku dari siksaan Allah. Lalu untuk apa aku berdusta terhadap Allah demi kalian, sedangkan kalian tidak mampu menghindarkan siksaan-Nya dariku? هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ ۖ (Dia lebih mengetahui apa-apa yang kamu percakapkan tentang Al Quran itu) Yakni Allah lebih mengetahui perkataan kalian tentang al-Qur’an, yang berupa pendustaan kalian dan kalian katakan bahwa itu hanyalah sihir. كَفَىٰ بِهِۦ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ ۖ( Cukuplah Dia menjadi saksi antaraku dan antaramu) Allah bersaksi untukku bahwa al-Qur’an berasal dari-Nya, dan aku telah menyampaikannya kepada kalian. Dan Allah bersaksi bahwa kalian mendustakan dan mengingkarinya. وَهُوَ الْغَفُورُ الرَّحِيمُ (dan Dialah Yang Maha Pengampun lagi Maha Penyayang”) Yakni bagi orang yang bertaubat dan beriman, serta membenarkan dan mengamalkan al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Bahkan mereka berkata: “Muhammad hanya mengada-adakan Alquran dari dirinya sendiri.” Katakan kepada mereka wahai Rasul: “Jika aku memang mengada-ada Alquran ini atas nama Allah dengan cara mengira-ngira, maka kalian tidak akan bisa sedikitpun menolongku dari azab Allah. Sesungguhnya hukuman kepadaku pasti akan disegerakan. Allah lebih tahu terhadap cercaan dan makian kalian tentang Alquran. Cukuplah Allah Yang menjadi saksi atas kebenaran yang aku sampaikan. Juga menjadi saksi atas dusta dan pengingkaran kalian. Allah Maha Pengampun bagi siapapun yang mau bertaubat. Allah Maha Pengasih kepada siapapun yang mengimani dan membenarkan Alquran.” Huruf am sebagai kata tanya untuk bermaksud menyanggah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau mereka berkata “Dia telah mengada-adakannya} dia telah membuat-buatnya {Katakanlah,“Jika aku mengada-adakannya} membuat-buatnya {sungguh kalian tidak mampu sedikit pun menghindarkan aku dari (azab) Allah. Dia lebih tahu tentang apa yang kalian katakan tentang itu} kalian mencelanya dengan menjelek-jelekkan ayatnya {Cukuplah Dia} Allah {menjadi saksi antara aku dan kalian. Dialah Yang Maha Pengampun lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Bahkan mereka mengatakan, ‘Dia (Muhammad) telah mengada-adakanya (al-Qur’an)’.” Artinya, Muhammad buat-buat al-Qur’an ini dari dirinya sendiri, bukan dari Allah subhanahu wata’ala. “Katakanlah,” kepada mereka, “Jika aku mengada-adakanya,” maka Allah subhanahu wata’ala memiliki kekuasaan atas diriku dan mengetahui apa yang kalian katakan, lantas mengapa Allah subhanahu wata’ala tidak menyiksaku atas cerita yang aku ada-adakan sebagaimana yang kalian sangkakan, apakah “kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu.” Jika Allah subhanahu wata’ala menghendakiku suatu bahaya atau menghendakiku suatu rahmat. “Cukuplah dia menjadi saksi antaraku dan antaramu, andai aku mengada-adakan al-Qur’an, tentu aku akan di siksa dengan tangan kananNya dan sungguh dia akan menyiksaku dengan siksaan yang bisa di saksikan oleh setiap orang, karena mengada-adakan al-Qur’an adalah dosa mengada-adakan yang paling besar andai memang aku melakukan hal itu. Kemudian Muhammad sholallohu ‘alaihi wasallam mengajak untuk bertaubat dan kembali kepada Allah subhanahu wata’ala meski mereka menentang kebenaran. Kemudian Allah berfirman, “Dan Dia-lah Yang Maha Pengampun lagi Maha Penyayang.” Artinya, bertaubatlah kalian semua kepadaNya dan tinggalkanlah perbuatan kalian, niscaya Allah subhanahu wata’ala akan mengampuni dosa-dosa kalian, merahmati kalian dan menunjukan kepada kalian kebaikan, serta memberikan kalian pahala yang besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 8: Allah mengabarkan tentang perkataan-perkataan orang-orang musyrik Quraisy, mereka berkata : Muhammad membuat-buat hal baru, menyusun dan merekayasa Al Qur’an ini di sisinya. Maka katakan Muhammad kepada mereka : Jika memang Al Qu’an ini adalah rekayasa, Allah mampu untuk mengadzabku, yang ketika Allah mengadzab, tidak ada seorangpun yang kuasa menahan. Ketahuilah bahwa Allah Maha Mengetahui akan kedustaan yang engkau sembunyikan dan kebencian kalian yang bathil, cukuplah Allah menjadi saksi bagiku dan bagi kalian, dan menghukumi antara aku dan kalian, dan Dia Maha Pengampun bagi yang bertaubat dari kesyirikan dan beriman dengan kerisalahanku serta membenarkan Al Qur’an. Allah Maha Penyayang kepada ohamba yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berasal dari dirinya, bukan dari sisi Allah ‘Azza wa Jalla. Yakni jika Dia mengazabku, karena Dia Mahakuasa terhadapku. Oleh karena itu, kalau aku berani mengada-ada terhadap-Nya, tentu Dia bertindak keras terhadapku dan menghukumku dengan hukuman yang dilihat semua orang. Selanjutnya, Beliau mengajak mereka bertobat terhadap hal yang muncul dari mereka berupa menentang yang hak dan memusuhinya, yaitu pada kata-kata, “Dia Maha Pengampun lagi Maha Penyayang.” Bagi orang yang bertobat. Sehingga Dia tidak segera menghukum mereka. Oleh karena itu, bertobatlah kalian kepadanya dan berhentilah dari apa yang kalian kerjakan selama ini, niscaya Dia akan mengampuni dosamu dan merahmatimu; Dia akan memberimu taufiq kepada kebaikan dan membalasmu dengan pahala yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 8",
    "description": "Bahkan mereka orang-orang musyrik itu menuduh nabi Muhammad seraya berkata, 'dia, nabi Muhammad telah mengada-adakannya yakni Al-Qur'an. ' Allah memerintahkan nabi agar menjawab tuduhan itu dengan firman-Nya. Katakanlah, 'jika aku mengada-adakannya, jika aku berdusta dalam apa yang aku nyatakan bahwa Al-Qur'an itu wahyu Allah maka kamu wahai orang-orang musyrik tidak kuasa sedikit pun menghindarkan aku dari azab Allah yang sangat dahsyat yang akan ditimpakan kepadaku. Tetapi Allah tidak akan menimpakan azab kepadaku karena sedikitpun aku tidak menyatakan kebohongan terhadap Al-Qur'an. Dia lebih tahu dari siapa pun apa yang kamu per-cakapkan tentang Al-Qur'an itu, yakni kedengkian kamu terhadap Al-Qur'an dan tuduhan kamu bahwa aku telah mengada-adakannya. Cukuplah dia menjadi saksi antara aku dengan kamu. Dia menjadi saksi bahwa apa yang aku nyatakan adalah benar dan apa yang kamu tuduhkan terhadap Al-Qur'an adalah kebohongan. Dia maha pengampun, terhadap hamba-Nya yang mau bertobat, lagi maha penyayang kepada hamba-Nya yang taat kepadanya. '9. Terhadap tuduhan-tuduhan yang dilontarkan oleh orang-orang musyrik itu Allah memerintahkan kepada nabi agar memberikan jawaban kepada mereka. Katakanlah, wahai nabi Muhammad, 'aku bukanlah rasul yang pertama di antara rasul-rasul yang diutus untuk menjelaskan wahyu Allah kepada umat manusia, dan aku tidak tahu apa yang akan diperbuat terhadapku di dunia dan apa yang akan diperbuat terhadapmu, apakah akan menimpakan azab kepadamu atau menunda sampai datangnya hari kiamat. Aku hanyalah mengikuti apa yang diwahyukan kepadaku, yakni Al-Qur'an, dan aku hanyalah pemberi peringatan kepada umat manusia dari azab Allah dan yang menjelaskan ajaran-ajaran-Nya yang harus dipatuhi agar mereka selamat dari azab itu."
  }
]