[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang musyrik dari kaummu, “Aku bukan Rasul Allah yang pertama kepada makhlukNya. Aku tidak tahu apa yang akan Allah lakukan terhadapku dan terhadap kalian di dunia. Aku tidak mengikuti dalam apa yang aku perintahkan kepada kalian dan apa yang aku lakukan kecuali wahyu Allah yang Dia wahyukan kepadaku. Aku tidak lain kecuali pemberi peringatan dengan peringatan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan kenabianmu, “Aku bukanlah utusan pertama yang diutus oleh Allah, telah banyak para rasul yang mendahuluiku. Aku tidak tahu apa yang akan diperbuat oleh Allah terhadap diriku dan apa yang akan diperbuat oleh Allah terhadap diri kalian di dunia, aku tidak lain hanyalah mengikuti apa yang diwahyukan oleh Allah kepadaku, maka aku tidak berbicara dan berbuat kecuali yang sesuai dengan yang diwahyukan, aku tidak lain hanyalah seorang pemberi peringatan, yang memberi peringatan kepada kalian akan siksa dari Allah dengan peringatan yang sejelas-jelasnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. قُلْ مَا كُنتُ بِدْعًا مِّنَ الرُّسُلِ (Katakanlah: “Aku bukanlah rasul yang pertama di antara rasul-rasul) Yakni aku bukanlah rasul yang pertama, karena Allah telah mengutus rasul-rasul sebelumku. وَمَآ أَدْرِى مَا يُفْعَلُ بِى وَلَا بِكُمْ ۖ (dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu) Di masa yang akan datang, apakah aku akan tetap tingga di Makkah atau meninggalkannya? Apakah aku akan mati atau terbunuh? Dan apakah siksaan kalian akan dipercepat atau ditangguhkan? إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَىَّ (Aku tidak lain hanyalah mengikuti apa yang diwahyukan kepadaku) Yakni aku hanya mengikuti al-Qur’an dan aku tidak mengada-ada. وَمَآ أَنَا۠ إِلَّا نَذِيرٌ مُّبِينٌ (dan aku tidak lain hanyalah seorang pemberi peringatan yang menjelaskan”) Yakni aku peringatkan kalian dari siksaan Allah dan azab-Nya dengan begitu jelas. Dalam shahih Bukhari dan lainnya diriwayatkan bahwa Ummu al-‘Ala berkata: saat Utsman bin Madz’un aku mengatakan “Semoga Allah merahmatimu hai Abu as-Sa’ib, aku bersaksi bahwa Allah telah memuliakanmu.” Maka Rasulullah bersabda: “Bagaimana kemu mengetahui bahwa dia dimuliakan Allah? Dia telah didatangi kematian dari Tuhannya, dan aku berharap kebaikan baginya. Demi Allah meskipun aku Rasulullah, namun aku tidak mengetahui bagaimana Allah akan memperlakukan aku dan kalian.” Maka Ummu al-‘Ala berkata: “Demi Allah, setelah kejadian itu aku tidak pernah lagi mencap kesucian seseoarang.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Katakanlah wahai Rasul: “Aku bukanlah utusan seorang diri, aku bukan satu-satunya utusan, ada rasul-rasul yang telah diutus sebelumku. Aku tidak tahu apa yang akan Allah berlakukan padaku di dunia. Entah aku tetap berada di Makkah, atau dipindah, atau bahkan terbunuh. Aku juga tidak tahu tentang nasib kalian, apakah akan dihukum oleh Allah atau dibiarkan. Aku hanya mengikuti apa yang telah Allah wahyukan kepadaku yaitu Alquran. Aku tidak membuat sesuatu yang baru. Aku hanya sebagai pemberi peringatan kepadamu atas azab Allah dengan sejelas-jelasnya peringatan. Namun kalian tetap dalam kekafiran. In dalam ayat ini pada lafadz in attabi’u adalah huruf yang berfungsi meniadakan / nafi yang bermakna aku tidak mengikuti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku bukanlah Rasul yang pertama di antara para rasul} orang pertama dari para rasul {dan aku tidak mengetahui apa yang akan diperbuat kepadaku dan kepada kalian. Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku dan aku tidak lain hanyalah seorang pemberi peringatan yang menjelaskan”} yang menjalaskan peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Katakanlah, ‘Aku bukanlah Rasul yang pertama di antara rasul-rasul’.” Artinya, aku bukanlah rasul pertama yang datang kepada kalian sehingga kalian merasa aneh dengan risalah yang aku bawa dan kalian mengingkari seruanku. Telah berlalu para rasul dan nabi yang seruanku dan seruan mereka adalah sama, lantas kerena apa kalian mengingkari ajakanku? “Dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu.” Artinya, aku hanya manusia biasa, aku tida berkuasa sama sekalia terhadap urusanku, hanya Allah subhanahu wata’ala yang mengaturku dan kalian, Dia-lah yang mengutuskan perkaraku dan perkara kalian, aku sama sekali tida membawa risalah dari diriku. “Dan aku tidak lain hanyalah seorang pemberi peringatan yang memeberi penjelasan.” Jika kalian menerima risalahku dan merespon seruanku, maka itulah bagian kalian di dunia dan akhirat, namun jika kalian menolak risalah dan ajakanku, maka hisab kalian ada dalam Kekuasaan Allah subhanahu wata’ala, aku telah menyampaikan peringatan kepada kalian, dan barang siapa yang telah memberi paringatan, maka telah memiliki alasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahqaf ayat 9: Allah menjelaskan agar Nabi-Nya ﷺ berkata kepada mereka orang-orang musyrik : Tidaklah aku adalah utusan yang pertama kali diutus kepada suatu kaum, karena sungguh telah diutus sebelum aku banyak utusan yang diutus kepada kaumnya, dan diturunkannya kitab, lalu mengapa kalian merasa aneh dengan dakwahku dan mengingkari kerisalahanku ? Tidaklah aku kecuali hanya manusia seperti kalian, aku tidak mengetahui yang ghaib, tidak juga mengetahui sesuatu yang akan terjadi di masa yang akan datang, tidak juga aku mengetahui apa yang aku akan kerjakan esok begitu juga dengan kalian, aku hanyalah utusan yang diutus Allah, aku mengikuti apa yang Allah wahyukan kepadaku, aku tidak menambahkan sesuatupun dari pribadiku, bukan aku yang akan menghisab kalian, sungguh aku hanyalah penyampai dan pemberi peringatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni aku bukanlah rasul yang pertama di antara rasul-rasul, lalu mengapa kamu menganggap aneh kerasulanku dan mendustakanku, padahal sebelumku telah ada para nabi dan rasul yang dakwah mereka sama dengan dakwahku. Di dunia ini, yakni apakah aku akan diusir dari kampung halamanku atau dibunuh sebagaimana yang terjadi pada para nabi sebelumku, atau kamu merajamku atau bahkan kamu akan diberi hukuman sebagaimana yang terjadi pada orang-orang sebelummu. Aku hanyalah manusia, aku tidak berkuasa apa-apa. Allah Subhaanahu wa Ta'aala yang berkuasa terhadapku dan terhadapmu, dan aku tidak dapat mendatangkan apa-apa dari sisiku. Yakni aku tidak mengadakan sesuatu pun dari sisiku. Yakni jika kamu menerima risalahku dan memenuhi seruanku, maka itu adalah keberuntungan untukmu di dunia dan akhirat, dan jika kamu menolaknya, maka hisabmu terserah Allah, dan aku telah memperingatkan kamu, sedangkan orang yang telah diperingatkan, maka sudah ditegakkan hujjah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahqaf Ayat 9",
    "description": "Terhadap tuduhan-tuduhan yang dilontarkan oleh orang-orang musyrik itu Allah memerintahkan kepada nabi agar memberikan jawaban kepada mereka. Katakanlah, wahai nabi Muhammad, 'aku bukanlah rasul yang pertama di antara rasul-rasul yang diutus untuk menjelaskan wahyu Allah kepada umat manusia, dan aku tidak tahu apa yang akan diperbuat terhadapku di dunia dan apa yang akan diperbuat terhadapmu, apakah akan menimpakan azab kepadamu atau menunda sampai datangnya hari kiamat. Aku hanyalah mengikuti apa yang diwahyukan kepadaku, yakni Al-Qur'an, dan aku hanyalah pemberi peringatan kepada umat manusia dari azab Allah dan yang menjelaskan ajaran-ajaran-Nya yang harus dipatuhi agar mereka selamat dari azab itu. 10. Lebih lanjut Allah memerintahkan kepada nabi Muhammad agar mengatakan kepada orang-orang musyrik itu 'terangkanlah kepadaku, bagaimana pendapatmu jika sebenarnya Al-Qur'an yang kusampaikan kepadamu ini datang dari Allah, dan kamu mengingkarinya dengan menuduh bahwa aku telah mengada-adakannya, padahal ada seorang saksi dari bani israil yang mengakui kebenaran yang serupa dengan yang disebut dalam Al-Qur'an, yakni wahyu Allah yang disebut dalam kitab taurat dan kitab-kitab sebelumnya yang mengajarkan tentang tauhid, hari akhir dan ajaran-ajaran lainnya yang serupa dengan ajaran Al-Qur'an lalu dia beriman kepada apa yang tertulis di dalamnya, sedangkan kamu menyombongkan diri, tidak percaya kepada ajaran serupa itu yang terdapat di dalam kitab suci Al-Qur'an. Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim, disebabkan keengganan mereka untuk menerima petunjuk-Nya."
  }
]