[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan para malaikat yang mencabut nyawa orang orang kafir dengan keras, Para malaikat yang mencabut nyawa orang orang beriman dengan semangat dan lembut, Para malaikat yang melayang saat turun dari langit dan naik ke langit, Para malaikat yang berlomba melaksanakan perintah Allah dengan segera, Para malaikat yang melaksankan perintah-perintah tuhan mereka terkait dengan tugas yang mereka emban dalam mengatur alam semesta, dan tidak boleh bagi makhluk untuk bersumpah dengan selain penciptanya,dan barang siapa melakukannya,maka dia berbuat syirik, Makhluk-makhluk pasti dibangkitkan dan dihisab pada hari yang bumi berguncang karena tiupan sangkakala pertama,yaitu tiupan kematian, Yang diikuti dengan tiupan kedua untuk kebangkitan kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan malaikat yang mencabut nyawa orang-orang kafir dengan cara yang keras dan kasar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-7. Allah bersumpah dengan tujuh sumpah yang agung: Dengan para malaikat yang mencabut nyawa orang-orang kafir dengan kasar; dengan para malaikat yang mencabut nyawa orang-orang beriman dengan lembut; dengan para malaikat yang senantiasa bertasbih dan makhluk-makhluk lain seperti bintang-bintang, dan kapal-kapal yang bertasbih di udara dan di laut; dengan para malaikat yang mendahului malaikat lainnya dalam menjalankan tugas; dengan para malaikat yang mengatur berbagai urusan yang diperintahkan Allah. Sungguh kalian akan dibangkitkan dan dihisab pada hari ketika bumi tergoncang sehingga seluruh manusia meninggal pada tiupan sangkakala yang pertama; kemudian diikuti tiupan kedua untuk membangkitkan seluruh makhluk dari kubur mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالنّٰزِعٰتِ (Demi (malaikat-malaikat) yang mencabut (nyawa)) Allah bersumpah dengan para malaikat yang mencabut nyawa hamba-hamba-Nya dari jasad mereka seperti orang yang menarik tali busur panah selebar-lebarnya. غَرْقًا(dengan keras) Yakni mencabutnya sampai ke seluruh saraf dalam tubuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Aku (Allah) bersumpah demi malaikat yang mencabut nyawa orang-orang kafir dengan cabutan yang sangat pedih dan sangat menyakitkan, yang pedihnya menyentuh semua sendi tubuh mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi (malaikat) yang mencabut (nyawa) dengan keras} Aku bersumpah demi malaikat yang mencabut nyawa orang-orang kafir dengan sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 1-5) Sumpah-sumpah dengan para malaikat mulia dan pekerjaan ini menunjukan sempurnanya ketundukan mereka pada perintah Allah dan cepatnya mereka dalam melaksanakannya. Kemungkinan yang menjadi obyek sumpah adalah pembalasan dan kebangkitan, dengan dalil setelahnya menyebutkan kondisi-kondisi hari kiamat. Dan kemungkinan juga obyek sumpah dan yang disumpahkan sama. Allah bersumpah atas para malaikat karena beriman kepada malaikat merupakan salah satu dari enam rukun iman dan karena menyebutkan pekerjaan mereka disini mencakup balasan yang diemban oleh para malaikat pada saat kematian, sebelum dan sesudahnya. Allah berfirman, “Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras,” mereka adalah para malaikat yang mencabut nyawa dengan sekeras-kerasnya dan kencang dalam mencabutnya hingga ruh keluar dari raga, supaya diberi balasan atas amal perbuatannya. “Dan demi malaikat-malaikat yang mencabut nyawa dengan lemah lembut,” mereka juga para malaikat yang menabut ruh dengan kuat dan giat. Atau yang dimaksudkan dengan lemah lembut adalah bagi ruh orang-orang mukmin seadngkan cabutan keras berlaku bagi orang-orang kafir. “Dan demi malaikat-malaikat yang turun dari langit dengan cepat,”nyaitu para malaikat yang turun nahik di udara. “Dan demi malaikat-malaikat yang mendahului,” malaikat lainnya, “dengan kencang,”segera menunaikan perintah Allah dan mendahului para setan dalam menyampaikan wahyu kepada para rasul agar tidak dicuri. “ Dan demi malaikat-malaikat yang mengatur urusan dunia,” yakni, para malaikat yang ditugaskan oleh Allah untuk mengatur berbagai urusan alam atas dan alam bawah, seperti hujan, tumbuh-tumbuhan, angin, laut, janin, hewan, surga, neraka, dan tugas lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالنَّازِعَاتِ } huruf \"و\" pada ayat ini adalah huruf yang sering digunakan dalam bersumpah, dan di ayat ini yang bersumpah adalah Allah ta'ala, Allah bersumpah dengan para malaikat yang mulia, dan Dia berkehendak sesukanya untuk bersumpah dengan nama apapun dari makhluknya. { وَالنَّازِعَاتِ } adalah para malaikat yang bertugas mencabut nyawa dari jasad ketika ajal menjemput, dan ini akan menjadi dua bagian : Yang pertama adalah : Ruh orang-orang kafir akan dicabut dengan cara { غَرْقًا } yang kuat, yakni mereka akan merasa kesakitan yang berlebih ketika malaikat mencabut nyawa mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالنَّازِعَاتِ غَرْقًا “Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras” Maknanya: Malaikat-malaikat yang ditugaskan mencabut nyawa orang-orang kafir, mereka mencabutnya dengan: غَرْقًا “dengan keras” Maknanya: Menariknya dengan kasar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 1: 1-5. Surat ini dimulai dengan penyebutan banyak sumpah, yaitu Allah bersumpah dengan malaikat-malaikat yang mencabut ruh-ruh orang kafir, kemudian bersumpah dengan malaikat-malaikat yang menggenggam ruh-ruh orang-orang beriman. Dan Allah bersumpah dengan malaikat yang di tempatkan di ufuk langit-langit dunia, yang mereka senantiasa bertasbih di langit dan turun dengan perintah Rabb-nya beserta petunjuk dari-Nya. Allah bersumpah pula dengan malaikat-malaikat yang berlomba-lomba satu sama lain di antara mereka dalam mentadabburi perintah dari Rabb-Nya. Bersumpah pula (Allah), atas malaikat-malaikat-Nya yang mentadabburi urusan-urusan alam dengan perintah dari Allah Ta’ala. Dan jawaban dari sumpah-sumpah tersebut adalah bahwasanya hari kiamat adalah suatu kebenaran, dan sungguh mereka semua (wahai sekalian manusia !), kalian akan dibangkitkan dan akan di hisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan para malaikat yang mulia dan perbuatan mereka yang menunjukkan sempurnanya ketundukan mereka kepada perintah Allah dan segeranya mereka melaksanakan perintah-Nya. Isi sumpahnya kemungkinan menetapkan kebangkitan dan pembalasan berdasarkan disebutkannya keadaan hari Kiamat setelahnya. Yaitu ketika mencabut nyawa orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 1",
    "description": "1-5. Allah memulai surah ini dengan sumpah demi malaikat yang diberinya tugas berat. Di antara tujuannya adalah agar manusia menghayati peran-peran tersebut dalam kehidupan. Demi malaikat yang mencabut nyawa kaum kafir dengan keras dan kasar sebagai tanda kegeraman para malaikat itu terhadap mereka. Demi malaikat yang mencabut nyawa orang mukmin dengan halus dan lemah lembut sebagai tanda simpati para malaikat itu kepada mereka. Malaikat mencabut nyawa mereka sambil berkata, 'wahai jiwa yang tenang, kembalilah ke tuhanmu dengan hati yang rida dan diridai-Nya. ' demi malaikat yang turun dari langit dengan cepat untuk melaksanakan tugas dari Allah sembari selalu bertasbih menyucikan Allah dan mengagungkannya sepanjang waktu, dan demi malaikat yang mendahului yang lain dengan kencang, cepat, dan cekatan untuk melakukan tugas-tugasnya tanpa mengulur waktu, dan demi malaikat yang mengatur urusan dunia, seperti pengisaran angin, turunnya hujan, dan sebagainya sesuai perintah Allah"
  }
]