[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-12. Orang-orang yang mendustakan kebangkitan kembali itu berkata, “apakah kami akan dikembalikan hidup sesudah kami mati dalam perut bumi?”, “Apakah kami akan dihidupkan sesudah kami menjadi tulang tulang yang lapuk?”, Mereka menjawab sendiri, ”kembalinya kita itu hanya akan menjadi kerugian dan kedustaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Apakah jika kami telah menjadi tulang belulang yang hancur, bisakah kami dikembalikan seperti semula?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Orang-orang yang mendustakan mengingkari hari kebangkitan dengan berkata: “Apakah kita akan kembali hidup setelah mati dan dikubur di dalam tanah? Apakah kita akan kembali hidup padahal kita telah menjadi tulang-belulang yang berserakan? Sungguh kebangkitan itu tidak akan terjadi, dan tidak berguna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10–11. Orang-orang kafir yang tidak percaya kepada hari kebangkitan berkata: “Apakah kita akan dikembalikan lagi kepada kehidupan yang semula? Apakah kalau kami sudah jadi bongkahan tulang juga akan dibangkitkan?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah apabila kita telah menjadi tulang-belulang yang hancur} yang sangat tua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 10-14) “(Orang-orang kafir) berkata,” di dunia seraya mendustakan, “Apakah kami benar-benar dikembaliakn kepada kehidupan yang semula? Apakah akan dibangkitkan juga apabila telah menjadi tulang-belulang yang hancur lumat?” Artinya, mereka menganggap mustahil bahwa Allah akan membangkitkan mereka dan mengembalikan mereka setelah mereka menjadi tulang-belulang karena ketidaktahuan mereka akan kuasa Allah dan karena sikap sembrono mereka. Allah berfirman dalam menjelaskan mudahnya hal itu, “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja,” yakni, ditiup sangkakala, maka tiba-tiba semua manusia “hidup kembali di permukaan bumi,” yakni berada diatas permukaan bumi seraya berdiri menatap, kemudian Allah mengumpulkan mereka semua dan memutuskan perkara di antara mereka dengan hukumNya yang Mahaadil lalu memberi mereka balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Apakah kami akan dihidupkan kembali setelah kami menjadi tulang tulang yang lapuk didalam kubur ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat pada tafsir surat an-nazi'at ayat 8"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 11: 10-12. Kemudian mereka (orang-orang kafir) yang mendustakan akan datangnya hari kebangkitan (kiamat) berkata : Apakah kami akan dihidupkan kembali sebagaimana kondisi pertama kami (sebelum mati) padahal kami telah masuk ke dalam kubur ?! Apakah kami akan dibangkitkan setalah tulang-benulang kami remuk dan tercerai berai ?! Mereka berkata dengan ejekan : Jika memang apa yang engkau (Muhammad) katakan benar (yaitu kami akan dibangkitkan), maka kami akan menjadi orang-orang yang merugi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 11",
    "description": "'apakah kita akan dibangkitkan juga apabila kita telah menjadi tulang belulang yang hancur'' mereka memandang persoalan hari kebangkitan hanya dengan pendekatan logika, padahal persoalan ini harus didekati dengan keimanan. Al-qur'an banyak menyajikan dalil meyakinkan tentang keniscayaan hari kebangkitan. '12. Mereka yang ingkar itu berkata dengan nada mengejek, 'kalau hal yang demikian itu benar-benar terjadi, itu adalah suatu pengembalian yang merugikan bagi kami. Hal itu tidak akan terjadi kepada kami. '."
  }
]