[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-12. Orang-orang yang mendustakan kebangkitan kembali itu berkata, “apakah kami akan dikembalikan hidup sesudah kami mati dalam perut bumi?”, “Apakah kami akan dihidupkan sesudah kami menjadi tulang tulang yang lapuk?”, Mereka menjawab sendiri, ”kembalinya kita itu hanya akan menjadi kerugian dan kedustaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Mereka berkata, “Jika kami dikembalikan seperti semula, sungguh pengembalian itu merupakan suatu kerugian, ia terpedaya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. قَالُوا۟ تِلْكَ إِذًا كَرَّةٌ خَاسِرَةٌ (Mereka berkata: “Kalau demikian, itu adalah suatu pengembalian yang merugikan”) Yakni jika kita dibangkitkan setelah kematian pasti kita akan merugi karena kita akan tertimpa apa yang dikatakan Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Orang yang mengingkari hari kebangkitan berkata: \"Pengembalian atau pembangkitan ini berarti hanya pembangkitan yang merugikan atau tidak berguna\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Kalau demikian, itu cara kembali yang merugikan”} cara kembali yang merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 10-14) “(Orang-orang kafir) berkata,” di dunia seraya mendustakan, “Apakah kami benar-benar dikembaliakn kepada kehidupan yang semula? Apakah akan dibangkitkan juga apabila telah menjadi tulang-belulang yang hancur lumat?” Artinya, mereka menganggap mustahil bahwa Allah akan membangkitkan mereka dan mengembalikan mereka setelah mereka menjadi tulang-belulang karena ketidaktahuan mereka akan kuasa Allah dan karena sikap sembrono mereka. Allah berfirman dalam menjelaskan mudahnya hal itu, “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja,” yakni, ditiup sangkakala, maka tiba-tiba semua manusia “hidup kembali di permukaan bumi,” yakni berada diatas permukaan bumi seraya berdiri menatap, kemudian Allah mengumpulkan mereka semua dan memutuskan perkara di antara mereka dengan hukumNya yang Mahaadil lalu memberi mereka balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka berkata \"Jika perkataan ( Muhammad ) tentang ini benar maka kami adalah termasuk orang yang rugi, karena sungguh kami belum mempersiapkan diri umtuk menghadapi peristiwa itu, dan mereka lagi-lagi menyangkal bahwa semua itu sangat jauh dan tidak mungkin terjadi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat pada tafsir surat an-nazi'at ayat 8"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 12: 10-12. Kemudian mereka (orang-orang kafir) yang mendustakan akan datangnya hari kebangkitan (kiamat) berkata : Apakah kami akan dihidupkan kembali sebagaimana kondisi pertama kami (sebelum mati) padahal kami telah masuk ke dalam kubur ?! Apakah kami akan dibangkitkan setalah tulang-benulang kami remuk dan tercerai berai ?! Mereka berkata dengan ejekan : Jika memang apa yang engkau (Muhammad) katakan benar (yaitu kami akan dibangkitkan), maka kami akan menjadi orang-orang yang merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menganggap mustahil kebangkitan itu karena tidak tahunya mereka terhadap kekuasaan Allah dan tidak takutnya mereka kepada kebesaran-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 12",
    "description": "Mereka yang ingkar itu berkata dengan nada mengejek, 'kalau hal yang demikian itu benar-benar terjadi, itu adalah suatu pengembalian yang merugikan bagi kami. Hal itu tidak akan terjadi kepada kami. '13. Pengembalian dan pembangkitan itu bukanlah hal yang sulit bagi Allah. Maka pengembalian itu hanyalah dengan sekali tiupan saja oleh malaikat israfil melalui tiupan yang kedua."
  }
]