[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Sesungguhnya ia hanya satu tiupan, Dan merekapun hidup kembali di muka bumi setelah sebelumnya mereka di dalam perut bumi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Perkara kebangkitan itu adalah perkara mudah, itu hanyalah berupa sekali tiupan dari Malaikat yang ditugaskan untuk meniup sangkakala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Janganlah kalian menganggap kebangkitan itu tidak akan terjadi, karena ia hanya sekedar satu tiupan saja kemudian kalian tiba-tiba telah hidup kembali di permukaan bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَإِنَّمَا هِىَ زَجْرَةٌ وٰحِدَةٌ (Sesungguhnya pengembalian itu hanyalah satu kali tiupan saja) Yakni tiupan kedua yang membangkitkan seluruh makhluk, Kami tidak butuh melakukan sesuatu yang lebih dari itu karena kekuasaan Kami sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Maka pembangkitan itu hanya terjadi dalam satu kali tiupan, tiupan itu adalah tiupan sangkakala yang kedua untuk membangkitkan mereka dari kubur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Cara kembali itu hanyalah dengan sekali tiupan} tiupan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 10-14) “(Orang-orang kafir) berkata,” di dunia seraya mendustakan, “Apakah kami benar-benar dikembaliakn kepada kehidupan yang semula? Apakah akan dibangkitkan juga apabila telah menjadi tulang-belulang yang hancur lumat?” Artinya, mereka menganggap mustahil bahwa Allah akan membangkitkan mereka dan mengembalikan mereka setelah mereka menjadi tulang-belulang karena ketidaktahuan mereka akan kuasa Allah dan karena sikap sembrono mereka. Allah berfirman dalam menjelaskan mudahnya hal itu, “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja,” yakni, ditiup sangkakala, maka tiba-tiba semua manusia “hidup kembali di permukaan bumi,” yakni berada diatas permukaan bumi seraya berdiri menatap, kemudian Allah mengumpulkan mereka semua dan memutuskan perkara di antara mereka dengan hukumNya yang Mahaadil lalu memberi mereka balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah kembali menjelaskan tentang kekuasaan-Nya yang tidak satupun dari makhluknya mampu mengahalanginya, Dia berkata : { فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ } Sesungguhnya pengembalian itu hanyalah dalam satu kali tiupan saja, Malaikat memanggil mereka yang ada didalam kubur dengan tiupan itu, lalu kemudian bangkitlah mereka dari kubur mereka, Allah berfirman : { مُهْطِعِينَ إِلَى الدَّاعِ ۖ يَقُولُ الْكَافِرُونَ هَٰذَا يَوْمٌ عَسِر } ( Mereka datang dengan cepat kepada penyeru itu. Orang-orang kafir berkata: “Ini adalah hari yang berat”.) [ Al-Qomar : 8 ] dlam ayat lain Allah berkata : { مَّ إِذَا دَعَاكُمْ دَعْوَةً مِنَ الْأَرْضِ إِذَا أَنْتُمْ تَخْرُجُونَ } ( Kemudian apabila Dia memanggil kamu sekali panggil dari bumi, seketika itu (juga) kamu keluar (dari kubur).) [ A-Rum : 25 ] . { فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ } Malikat memanggil mereka denganperintah Allah, dia memanggil tulang-tulang yang telah lapuk, dan juga rambut-rambut yang telah berjatuhan, urat-urat daging, beserta dagingnya, semuanya dipanggil dalam sesaat, dan ketika itu pun langsung terkumpul dan membentuk tubuh manusia seperti sedia kala ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ (13) فَإِذَا هُمْ بِالسَّاهِرَةِ (14) “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja, maka dengan serta merta mereka hidup kembali di permukaan bumi.” Pengembalian dari Allah ‘Azza Wa Jalla, mereka dikembalikan, dan mereka akan dipanggil, lalu merekaakan bangkit dari kubur-kubur mereka, dengan sikap satu sikap berdiri di atas bumi, setelah ia berada di bawahnya, Allah Tabaaroka Wa Ta’ala berfirman: إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَدَيْنَا مُحْضَرُونَ “Tidak adalah teriakan itu selain sekali teriakan saja, maka tiba-tiba mereka semua dikumpulkan kepada Kami.”(QS. Yasin: 53) semua manusia dalam kalimat itu akan keluar dari kubur-kubur mereka dalam keadaan hidup kembali, kemudian mereka akan hadir di hadapan Allah ‘Azza Wa Jalla untuk diberi balasan, oleh karena itu Allah Berfirman: فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ (13) فَإِذَا هُمْ بِالسَّاهِرَةِ (14) “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja, maka dengan serta merta mereka hidup kembali di permukaan bumi.” Firman-Nya ini serupa dengan firman-Nya: وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ “Dan perintah Kami hanyalah satu perkataan seperti kejapan mata.”(QS. Al-Qomar: 50) Yakni bahwa jika Allah menginginkan sesuatu Dia hanya akan mengatakan kun (jadilah) satu kali saja, maka akan jadi,dan tidak akan terlambat dari Firman Allah Ta’ala sesaat bagai kedipan mata, tidak ada yang bisa menghalangi Allah suatu apa pun, jika saja semua manusia bangkit dari kubur-kuburnya karena Allah ‘Azza Wa Jalla dengan hanya satu buah kata. Ini adalah sesuatu yang paling menunjukkan bahwa Allah Ta’ala Maha Kuasa atas segala sesuatu, juga tidak ada yang bisa melemahkan-Nya, di langit maupun di bumi, sebagaimana Allah Ta’ala berfirman: وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِنْ شَيْءٍ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ إِنَّهُ كَانَ عَلِيمًا قَدِيرًا “Dan tiada sesuatu pun yang dapat melemahkan Allah baik di langit maupun di bumi. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa.”(QS. Fatir: 44)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 13: 13-14. Kemudian Allah menjelaskan kepada mereka (orang-orang kafir) dengan berkata : Ketahuilah oleh kalian wahai manusia bahwasanya jeritan kebangkitan (setelah ditiupnya sangkakala) adalah tiupan pada kali kedua; Yaitu ketika terkumpul seluruh makhluk dalam kondisi hidup di atas bumi yang datar setelah mereka terkubur dalam perut bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan tentang mudahnya perkara itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 13",
    "description": "Pengembalian dan pembangkitan itu bukanlah hal yang sulit bagi Allah. Maka pengembalian itu hanyalah dengan sekali tiupan saja oleh malaikat israfil melalui tiupan yang kedua. 14. Maka seketika itu mereka hidup kembali di bumi yang baru. Dengan tiupan sangkakala kedua itu saja semua manusia akan bangkit dari kubur dan digiring ke padang mahsyar."
  }
]