[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Sesungguhnya ia hanya satu tiupan, Dan merekapun hidup kembali di muka bumi setelah sebelumnya mereka di dalam perut bumi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Tiba-tiba semua kembali hidup di atas bumi setelah sebelumnya mereka mati terkubur di dalam tanah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَإِذَا هُم بِالسَّاهِرَةِ (maka dengan serta merta mereka hidup kembali di permukaan bumi) Dikatakan bahwa yang dimaksud dengan (الساهرة) yakni bumi putih yang diciptakan Allah sebagai tempat menghisab para makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Apabila seluruh makhluk telah hidup pada tanah putih (bumi yang baru) setelah mereka menjadi mayat-mayat di perut bumi itu. As sahirah adalah suatu daerah di Syam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seketika itu, mereka hidup kembali di bumi} di permukaan bumi dalam keadaan hidup setelah mereka mati terkubur di dalam perut bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 10-14) “(Orang-orang kafir) berkata,” di dunia seraya mendustakan, “Apakah kami benar-benar dikembaliakn kepada kehidupan yang semula? Apakah akan dibangkitkan juga apabila telah menjadi tulang-belulang yang hancur lumat?” Artinya, mereka menganggap mustahil bahwa Allah akan membangkitkan mereka dan mengembalikan mereka setelah mereka menjadi tulang-belulang karena ketidaktahuan mereka akan kuasa Allah dan karena sikap sembrono mereka. Allah berfirman dalam menjelaskan mudahnya hal itu, “Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja,” yakni, ditiup sangkakala, maka tiba-tiba semua manusia “hidup kembali di permukaan bumi,” yakni berada diatas permukaan bumi seraya berdiri menatap, kemudian Allah mengumpulkan mereka semua dan memutuskan perkara di antara mereka dengan hukumNya yang Mahaadil lalu memberi mereka balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "السَهِرَة : Adalah bumi yang datar , yakni ketika kiamat terjadi bumi akan menjadi rata , Allah berfirman : { وَيَسْأَلُونَكَ عَنِ الْجِبَالِ فَقُلْ يَنْسِفُهَا رَبِّي نَسْفًا , فَيَذَرُهَا قَاعًا صَفْصَفًا , لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا } ( Dan mereka bertanya kepadamu tentang gunung-gunung, maka katakanlah: “Tuhanku akan menghancurkannya (di hari kiamat) sehancur-hancurnya , Dan mereka bertanya kepadamu tentang gunung-gunung, maka katakanlah: “Tuhanku akan menghancurkannya (di hari kiamat) sehancur-hancurnya , Tidak ada sedikitpun kamu lihat padanya tempat yang rendah dan yang tinggi-tinggi. ) inilah padang mahsyar yang Allah kumpulkan seluruh manusia dari awal penciptaan sampai akhir kehidupan dunia , mereka tidak di batasi oleh dinding , tidak pula oleh pepohonan dan bebatuan , tidak satupun pembatas dan penghalang satu sama lain diantara mereka, bumi seluruhnya menjadi rata. Seluruh manusia akan dikumpulkan dalam sesaat diatas tanah bumi yang rata , dan tidak satupun dari mereka yang mampu menghindar dari pristiwa ini , seluruhnya akan mematuhi perintah Allah dalam seketika , yaitu perintah Allah al-kauny , Sebagaimana yang Allah katakan : { إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ } ( Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya: “Jadilah!” maka terjadilah ia. ) dan perintah itu ada dua macam : Perintah syar'i : yaitu apa yang Allah perintah dan larangan Allah yang terdapat didalam Al-qur'an dan Sunnah. Perintah yang telah Allah taqdirkan itu pasti akan terjadi : yaitu perintah kauny, Ketika Allah memerintahkan hambanya, ketika itu pun mereka akan patuh kepadanya. Dan dikatakan dalam riwayat lain, bahwa ( السَهِرَة ) adalah negri syam yang nantinya akan menjadi padang mahsyar, akan tetapi pendapat yang paling tepat ialah bahwasanya ( السَهِرَة ) bumi yang menjadi rata setelah terjadinya peristiwa hari kiamat yang maha dahsyat, dan itu akan bertempat di negri syam, wallahua'lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat pada tafsir surat an-nazi'at ayat 13"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 14: 13-14. Kemudian Allah menjelaskan kepada mereka (orang-orang kafir) dengan berkata : Ketahuilah oleh kalian wahai manusia bahwasanya jeritan kebangkitan (setelah ditiupnya sangkakala) adalah tiupan pada kali kedua; Yaitu ketika terkumpul seluruh makhluk dalam kondisi hidup di atas bumi yang datar setelah mereka terkubur dalam perut bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengumpulkan mereka, dan mereka berdiri menunggu keputusan-Nya. Ketika itu, Dia memutuskan mereka dengan adil dan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 14",
    "description": "Maka seketika itu mereka hidup kembali di bumi yang baru. Dengan tiupan sangkakala kedua itu saja semua manusia akan bangkit dari kubur dan digiring ke padang mahsyar. 15. Wahai nabi Muhammad, bersabarlah atas pengingkaran kaummu sebagaimana kesabaran nabi-nabi terdahulu. Sudahkah sampai kepadamu kisah nabi musa yang berdakwah kepada fir'aun yang zalim'"
  }
]