[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Apakah telah datang kepadamu (wahai rasul) berita tentang musa? Ketika tuhannya memanggilnya di lembah suci yang berkah,lembah thuwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Apakah telah datang kepadamu -wahai Rasul- berita tentang Musa dengan Rabbnya dan bersama musuhnya, Fir'aun?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-19. Allah memancing kerinduan Nabi Muhammad: Apakah telah sampai kepadamu kisah Nabi Musa ketika Tuhannya berfirman kepadanya di lembah Thuwa yang suci? Dia berkata kepada Nabi Musa: “Pergilah kepada Fir’aun di negeri Mesir; sungguh dia telah melampaui batas perusakan dan keangkuhan. Kemudian katakanlah kepadanya, ‘Apakah kamu ingin menyucikan dirimu dari kotoran kekafiran, dan aku akan menuntunmu kepada ketaatan Tuhanmu sehingga kamu akan merasa takut dari-Nya?’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. هَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ (Sudah sampaikah kepadamu (ya Muhammad) kisah Musa) Yakni Sungguh telah sampai kepadamu kisah Fir’aun dan Musa serta apa yang terjadi di antara mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Wahai Nabi, apakah cerita tentang Musa sudah kamu dengar?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sudah sampaikah kepadamu kisah Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian dalam ayat ini Allah mengatakan kepada Nabi-Nya ( Muhammad ) bahwasa telah lewat sebelumnya Rasul-rasul yang kaumnya telah mendustakannya dan jumlah mereka sangatlah banyak, maka bagimu dari mereka contoh yang kamu bisa mengambil hikmah darinya, sebagai contoh yaitu fir'aun bersama kaumnya, Allah berfirman : { هَلْ أَتَاكَ حَدِيثُ مُوسَىٰ } Telah datang kepadamu ( Muhammad ) Kisah tentang Musa yang Allah telah sebutkan dan mengulanginya beberapa kali dalam Al-Qur'an yang ketika itu ia ( Musa ) melakukan perjalanan bersama istri dan keluarganya pulang ke kampung halamannya stelah datang berkunjung ke negri madyan dan ketika dalam perjalanan mereka merasa kedinginan, mereka pun tersesat dan melihat ada api yang tengah membara, dan mereka pun senang dengan adanya api itu, dan kemudian ia mempersilahkan keluarganya untuk duduk dan menunggu sedang ia pergi menghampiri asal dari api tersebut, untuk bertanya kepada pemilik api tadi, kemanakah arah jalan yang benar ? atau ia pergi mengambil suluh api yang menyala untuk menghangatkan badan mereka, itulah tujuan Nabi Musa ketika itu, Akan tetapi sesampainya di lembah api yang ia saksikan terdengar suara bahwa Allah memanggilnya { فَلَمَّا أَتَاهَا نُودِيَ مِنْ شَاطِئِ الْوَادِ الْأَيْمَنِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنَ الشَّجَرَةِ أَنْ يَا مُوسَىٰ إِنِّي أَنَا اللَّهُ رَبُّ الْعَالَمِينَ} ( Maka tatkala Musa sampai ke (tempat) api itu, diserulah dia dari (arah) pinggir lembah yang sebelah kanan(nya) pada tempat yang diberkahi, dari sebatang pohon kayu, yaitu: “Wahai Musa, sesungguhnya aku adalah Allah, Tuhan semesta alam. ) [ Al-Qhasas : 30 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala menceritakan yang terjadi pada umat-umat sebelum Muhammad shallallaahu ‘alaihi wa sallam, Allah Ta’ala berfirman: هَلْ أَتَاكَ حَدِيثُ مُوسَى (15 “Sudahkah sampai kepadamu (ya Muhammad) kisah Musa.” Yang di ajak berinteraksi dalam firman-Nya: هَلْ أَتَاكَ “Sudahkah sampai kepadamu” adalah Nabi shallallaahu ‘alaihi wa sallam atau kepada siapa pun yang sesuai dan tepat ditujukan ungkapan ini kepadanya, sehingga jika dimaknai Nabi shallallaahu ‘alaihi wa sallam maka maknanya: Sudahkan sampai kepadamu wahai Muhammad, jika dimaknai dengan makna kedua maka: Sudahkah sampai kepadamu wahai manusia حَدِيثُ مُوسَى “Kisah Musa” beliau adalah anaknya Imran ‘alaihisshilaatu wassalaam, Nabi terbaik Bani Israil, beliau adalah salahsatu ulul’azmi yang berjumlah lima, mereka adalah: Muhammad shallallaahu’alaihi wa sallam, Ibrahim, Musa, Isa, dan Nuh ‘Alaihimushalaatu wassalaam, mereka telah disebutkan di dua tempat dalam al-Quran, dalah satunya dalam Surat al-Ahzaab yaitu Firman Allah Ta’ala: وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنْكَ وَمِنْ نُوحٍ وَإِبْرَاهِيمَ وَمُوسَى وَعِيسَى ابْنِ مَرْيَمَ “Dan (ingatlah) ketika Kami mengambil perjanjian dari nabi-nabi dan dari kamu (sendiri), dari Nuh, Ibrahim, Musa dan Isa putera Maryam” (QS. Al-Ahzab: 7) Yang kedua dalam firman Allah Ta’ala: شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّى بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَى وَعِيسَى “Dia telah mensyariatkan kamu tentang agama apa yang telah diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa”(QS. Asy-Syura: 13) Kisah Musa ‘alaihissalaam disebutkan lebih banyak daripada kisah lainnya, kerena Musa adalah Nabinya orang-orang yahudi, mereka banyak di kota Madinah dan sekitarnya pada zaman Nabi shallallaahu ‘alaihi wa sallam. Kisah-kisah Nabi Musa adalah kisah terbanyak, terlengkap dan terluas yang berkaitan tentang berita para Nabi. Dalam Firman-Nya: هَلْ أَتَاكَ حَدِيثُ مُوسَى (15) “Sudahkah sampai kepadamu (ya Muhammad) kisah Musa.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 15: 15-16. Kemudian Allah mengarahkan perkataan-Nya (kepada Muhammad) dan berkata : Tidakkah engkau wahai Muhammad pernah mendengar kisah Musa ? Yaitu ketika Tuhan-nya menyeru di lembah (Thuwa) yang suci dan diberkahi, ia adalah lembah yang terletak di sisi kanan gunung Sina."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 15",
    "description": "Wahai nabi Muhammad, bersabarlah atas pengingkaran kaummu sebagaimana kesabaran nabi-nabi terdahulu. Sudahkah sampai kepadamu kisah nabi musa yang berdakwah kepada fir'aun yang zalim' 16. Ingatlah kisah ketika tuhan memanggilnya di lembah suci, yaitu lembah tuwa;"
  }
]