[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Apakah telah datang kepadamu (wahai rasul) berita tentang musa? Ketika tuhannya memanggilnya di lembah suci yang berkah,lembah thuwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Tatkala Rabbnya Yang Mahasuci menyerunya di Lembah Ṭuwa yang suci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. إِذْ نَادَىٰهُ رَبُّهُۥ بِالْوَادِ الْمُقَدَّسِ (Tatkala Tuhannya memanggilnya di lembah suci) Yakni lembah yang diberkahi dan disucikan. طُوًى (yaitu lembah Thuwa) Yaitu lembah yang terletak di bukit Sinai, yang merupakan tempat Allah memanggil Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Ketika Musa dipanggil Allah di lembah suci berkah, yaitu lembah di bawah gunung Thur Sina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Tuhannya menyeru dia di lembah suci} yang disucikan {yaitu Lembah Thuwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِذْ نَادَاهُ رَبُّهُ } Ketika Tuhannya memanggilnya, dari ayat ini menjelasakan bahwa Allah pun juga memanggil, Ia juga berbicara kepada hamba-Nya dengan nada suara yang tinggi maupun kecil, Allah berfirman : { وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّ } ( Dan Kami telah memanggilnya dari sebelah kanan gunung Thur dan Kami telah mendekatkannya kepada Kami di waktu dia munajat (kepada Kami) ) [ Maryam : 52 ] Allah memanggil Musa ketika Musa meminta kepada Allah dengan suaranya yang kecil. Itulah keistimewaan Nabi Musa disisi Allah diantara para Nabi dan Rasul, Allah berbicara kepadanya tanpa perantara malaikat, Allah berbicara langsung kepadanya dan Musa mendengarkan suara itu, maka dari itu Musa dijuluki sebaga \"كليم الله\" Yang Allah berbicara kepadanya, Allah berfirman : { مِنْهُمْ مَنْ كَلَّمَ اللَّهُ } ( Di antara mereka ( Rasul ) ada yang Allah berkata-kata (langsung dengan dia) ) [ Al-Baqarah : 253 ] { إِذْ نَادَاهُ رَبُّهُ } Ketika Allah memanggil Musa { بِالْوَادِ الْمُقَدَّسِ } Disuatu lembah yang suci bernama { طُوًى }, yang letaknya berada tepat disamping gunung Thur, Allah juga mengatakan dalam ayat lain : { إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ ۖ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى , وَأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوحَىٰ } ( Sesungguhnya Aku inilah Tuhanmu, maka tanggalkanlah kedua terompahmu; sesungguhnya kamu berada dilembah yang suci, Thuwa , Dan Aku telah memilih kamu, maka dengarkanlah apa yang akan diwahyukan (kepadamu) ) [ Thaha : 12-13 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Menarik perhatian bagi pendengar agar mendengarkan jalan cerita, إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى “Tatkala Tuhannya memanggilnya di lembah suci ialah Lembah Thuwa;” Allah 'Azza Wa Jalla memanggilnya berupa panggilan dengan suara Allah 'Azza Wa Jalla, Allah Ta'ala berfirman: وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا \" Dan Kami telah memanggilnya dari sebelah kanan gunung Thur dan Kami telah mendekatkannya kepada Kami di waktu dia munajat (kepada Kami) \"(QS. Maryam: 52) Firman Allah: بِالْوَادِ الْمُقَدَّسِ \" di lembah suci \" Maksudnya dalah Thur, yang dimaksudkan lembah adalah tempat air mengalir, Allah namakan dengan lembah suci, karena disitulah Musa ‘alaihissholaatu wassalaam mendapatkan wahyu, Firman Allah: طُوًى [Thuwa] adalah nama lembah itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 16: 15-16. Kemudian Allah mengarahkan perkataan-Nya (kepada Muhammad) dan berkata : Tidakkah engkau wahai Muhammad pernah mendengar kisah Musa ? Yaitu ketika Tuhan-nya menyeru di lembah (Thuwa) yang suci dan diberkahi, ia adalah lembah yang terletak di sisi kanan gunung Sina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu tempat dimana Allah Subhaanahu wa Ta'aala berbicara dengan Nabi Musa serta memberikan risalah kenabian kepada Beliau dan wahyu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 16",
    "description": "Ingatlah kisah ketika tuhan memanggilnya di lembah suci, yaitu lembah tuwa; 17. Di lembah itu Allah menurunkan wahyu kepada nabi musa dan membekalinya dengan dua mukjizat: tongkat yang berubah menjadi ular dan telapak tangan yang bercahaya. Wahai nabi musa, pergilah engkau kepada fir'aun! sesungguhnya dia telah melampaui batas, memperbudak bangsa israel, membunuhi anak lelaki mereka, dan membiarkan hidup anak perempuan mereka."
  }
]