[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-19. Dia berfirman kepada musa,”pergilah kepda fir’aun,dia telah melampaui batas dalam kedurhakaan”. Dan katakanlah kepadanya, “apakah kamu ingin menyucikan dirimu dari keburukan keburukan dan menghiasinya dengan iman”. “Dan aku akan menunjukanmu kepada ketaatan kepada tuhanmu sehingga kamu takut dan bertakwa kepadaNYA?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Allah berfirman kepadanya yang maksudnya, “Pergilah ke Fir'aun, sesungguhnya ia telah melampaui batas dalam kezaliman dan kesombongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Allah memerintahkan Musa: “Pergilah engkau kepada Fir’aun di Mesir, sesungguhnya dia sudah melampaui batas kekufuran terhadap Allah, dengan penuh kesombongan dan membuat kerusakan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Pergilah engkau kepada Fir‘aun! Sesungguhnya dia telah melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah 'azza wa jalla menyebutkan dalam ayat ini apa yang Musa dapatkan dari kejadian yang dia alamai dalam perjalanananya, yaitu ketika Allah berbicara kepadanya dan juga doa yang dipanjatkan oleh Musa 'alaihissalam kepada Tuhannya : { وَيَسِّرْ لِي أَمْرِي ، رَبِّ اشْرَحْ لِي صَدْرِي } ( Berkata Musa: “Ya Tuhanku, lapangkanlah untukku dadaku , Dan mudahkanlah untukku urusanku, ) [ Thaha : 25 : 26 ] Allah memerintahkan kepada Musa untuk pergi menemui Fir'aun, padahal sebenarnya dia telah meninggalkan dan menghindar dari kekejaman Fir'aun dan bala tentaranya, dan berpindah ke negri madyan takun akan pembunuhan yang bisa menimpa dirinhya, akan tetapi Allah memerintahkannya untuk kembali kepada Fir'aun . { اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ } pergilah kamu menemui Fir'aun, karema sesungguhnya dia telah melampaui batas, dia telah meremehkan penciptaan, dan telah menentang perintah Allah 'azza wajalla, dan mengangap dirinya adalah Tuhan, dan pada hakikatnya dia hanyalah manusia yang lemah, akan tetapi dia telah mengangkat derajat dirinya sendiri dan mengatakan : { أَنَا رَبُّكُمُ الْأَعْلَى } ( \"Akulah Tuhanmu yang paling tinggi\" ) [ An-Nazi'at : 24 ] , dan juga mengatakan : { مَا عَلِمْتُ لَكُمْ مِنْ إِلَٰهٍ غَيْرِي } ( aku tidak mengetahui tuhan bagimu selain aku. ) [ Al-Qashash : 38 ], itulah kedurhakaan Fir'aun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "اذْهَبْ إِلَى فِرْعَوْنَ إِنَّهُ طَغَى “Pergilah kamu kepada Firaun, sesungguhnya dia telah melampaui batas,” Fir’aun adalah raja bangsa mesir terdahulu. Ia pernah berkata kepada kaumnya: Dialah tuhan mereka yang tertinggi, dan dialah yang tidak ada tuhan selain dia,sebagaimana dalam firman Allah Ta’ala: وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي “Dan berkata Firaun: \"Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku.”(QS. Al-Qashas: 38) Ia mengaku-ngaku sesuatu yang bukan haknya, dan mengignkari hak yang lainnya, yaitu hak Allah ‘Azza Wa Jalla. Allah memerintahkan Nabi-Nya,Musa ‘alaihissholaatu wassalaam untuk pergi kepada fir’aun, dan inilah risalah kenabian, dan Allah menjelaskan sebab diutusnya ia, yaitu fir’aun telah melampaui batas. Dalas surat Thoha, Allah berfirman: اذْهَبَا إِلَى فِرْعَوْنَ إِنَّهُ طَغَى “Pergilah kamu berdua kepada Firaun, sesungguhnya dia telah melampaui batas;”(QS. Thaha: 43) tidak ada pertentangan antara kedua ayat tersebut. Karena Allah telah mengutus Musa terlebih dahulu kemudian Musa shallallaahu ‘alaihi wa sallam meminta Allah untuk meneguhkan pendiriannya dengan diutusnya Harun, maka Allah mengutus Harun ‘alaihimassalam bersama Musa, maka mereka berdua diutus bersamaan kepada Fir’aun. Firman Allah Ta’ala: إِنَّهُ طَغَى “sesungguhnya dia telah melampaui batas” Maknanya: Melebihi batas,kerena melampau batas adalah melebihinya, termasuk makna itu adalah firman Allah Ta’ala: إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ “Sesungguhnya Kami, tatkala air telah naik (sampai ke gunung) Kami bawa (nenek moyang), kamu ke dalam bahtera, ” (QS. Al-Haqqah: 11) termasuk dari pecahan kata طُغْيَان[Thughyaan] (melampaui batas) thaghut. Kerena di dalam thaghut ada unsur melampaui batas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 17: 17-19. Kemudian Allah berkata kepada Musa : Pergilah engkau menuju manusia yang melampaui batas (thagut) yaitu Fir’aun, karena sesungguhnya ia telah berbuat kejahatan dan ia telah melakukan kemaksiatan dan sombong. Dan katakan wahai Musa (padanya) dengan ucapan yang lemah lembut, katakan padanya : Apakah engkau wahai Fir’aun mendambakan kesucian atas dirimu yang telah tenggelam dalam dosa-dosa yang sangat ?; Dan agar supaya engkau mendapat petunjuk atasnya? Dan aku akan beri petunjuk agar engkau taat kepada Rabb-mu dan memiliki rasa takut yang akan membuatmu terhindar dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni laranglah dia dari bersikap melampaui batas, melakukan kemusyrikan dan kedurhakaan dengan kata-kata yang lembut dan ucapan yang halus agar dia sadar atau merasa takut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 17",
    "description": "Di lembah itu Allah menurunkan wahyu kepada nabi musa dan membekalinya dengan dua mukjizat: tongkat yang berubah menjadi ular dan telapak tangan yang bercahaya. Wahai nabi musa, pergilah engkau kepada fir'aun! sesungguhnya dia telah melampaui batas, memperbudak bangsa israel, membunuhi anak lelaki mereka, dan membiarkan hidup anak perempuan mereka. 18-19. Maka nasihati dan katakanlah kepada fir'aun dengan sopan dan lemah lembut, 'adakah keinginanmu untuk membersihkan diri dari kesesatan dan dosa' dan engkau akan kupimpin dan kubimbing ke jalan tuhanmu yang benar dan lurus agar engkau takut kepada-Nya dengan menyembah-Nya dan berbuat baik''."
  }
]