[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-19. Dia berfirman kepada musa,”pergilah kepda fir’aun,dia telah melampaui batas dalam kedurhakaan”. Dan katakanlah kepadanya, “apakah kamu ingin menyucikan dirimu dari keburukan keburukan dan menghiasinya dengan iman”. “Dan aku akan menunjukanmu kepada ketaatan kepada tuhanmu sehingga kamu takut dan bertakwa kepadaNYA?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan katakan kepadanya, \"Tidakkah engkau -wahai Fir'aun- ingin bersih dari kekufuran dan kemaksiatan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فَقُلْ (dan katakanlah) Yakni kepada Fir’aun. هَل لَّكَ إِلَىٰٓ أَن تَزَكَّىٰ (“Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)”) Yakni katakanlah kepadanya setelah kamu sampai di hadapannya: “Apakah kamu ingin menyucikan dirimu dari kesyirikan? Musa diperintah untuk bersikap lembut kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Katakanlah kepadanya perkataan yang lembut: “Apakah kamu punya keinginan atau kehendak untuk membersihkan dirirmu dari kekafiran dan durhaka kepada Allah?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu, katakanlah,\"Apakah kamu ingin menyucikan diri} menyucikan diri dari kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَقُلْ } Katakanlah ( wahai Musa ) kepadanya secara langsung, berdirilah didepannya, dan sampaikanlah nasihat itu, ini dalil bahwa para Raja seharusnya dinasehati, sekalipun mereka adalah orang yang paling keras diantara manusia, akan tetapi mereka mesti dinasehati secara langsung, menyampaikan kepada mereka nasihat secara diam-diam, dan bukan secara terang-terangan, ataupun menjelek-jelekkannya dihadapan orang banyak, begitupun menyebarkan kesalahan mereka di media-media yang tersebar luas, karena dengan cara ini manfaatnya kurang besar dan tidak memberi mereka manfaat sama sekali, bahkan dapat menyebabkan bertambahnya kedurhakaan mereka, oleh karena itu sampaikanlah kepadanya nasehat secara langsung, jika itu kamu mampu dan berani untuk melakukannya, dan jika sebaliknya, maka diam lebih baik bagimu, sedangkan jika kamu menyebarkan keburukannya dihadapan halayak banyak, dan kamu menyangka bahwa apa yang kamu lakukan adalah dakwah untuk menyampaikan risalah Allah, maka sebenarnya itu adalah kesalahan, dan itu menyalahi kebenaran, mereka akan berbuat lebih dari apa yang telah mereka lakukan, mereka akan menghentikan dakwahmu, karena yang demikian bukanlah langkah dakwah yang benar. Pergilah wahai Musa dan katakanlah kepada Fir'aun perkataan lemah lembut dan beradab, bukan perkataan yang buruk, janganlah kamu mengatakan kepadanya : \"wahai kamu yang buruk perangainya, wahai penjahat, wahai kafir ! \" dan sebagainya, Allah berfirman : { فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ } ( Maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut, mudah-mudahan ia ingat atau takut” ) [ Thaha : 44 ] { هَلْ لَكَ إِلَىٰ أَنْ تَزَكَّىٰ } \"Adakah keinginan bagimu untuk membersihkan diri \". bertutur kata kepadanya dengan cara yang lembut , itulah Dakwah, dan bukan dengan cacian dan penghinaan, dan sebagainya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَقُلْ هَلْ لَكَ إِلَى أَنْ تَزَكَّى “dan katakanlah (kepada Firaun): \"Adakah keinginan bagimu untuk membersihkan diri ” Pertanyaan di sini untuk menarik perhatian Fir’aun agar ia mau mensucikan diri dari keburukan dan kerusakan. Asal kata اَلزَّكَاة [az-Zakat] berarti tumbuh dan bertambah, di disebut juga bermakna islam dan tauhid, yang menunjukkan makna ini adalah firman Allah Ta’ala: وَوَيْلٌ لِلْمُشْرِكِينَ (6) الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ “Dan kecelakaan yang besarlah bagi orang-orang yang mempersekutukan (Nya), (yaitu) orang-orang yang tidak menunaikan zakat dan mereka kafir akan adanya (kehidupan) akhirat.”(QS. Fussilat: 6-7) juga firman Allah Ta’ala: قَدْ أَفْلَحَ مَنْ زَكَّاهَا (9) وَقَدْ خَابَ مَنْ دَسَّاهَا “sesungguhnya beruntunglah orang yang menyucikan jiwa itu, dan sesungguhnya merugilah orang yang mengotorinya.”(QS. Asy-Syams: 9-10)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 18: 17-19. Kemudian Allah berkata kepada Musa : Pergilah engkau menuju manusia yang melampaui batas (thagut) yaitu Fir’aun, karena sesungguhnya ia telah berbuat kejahatan dan ia telah melakukan kemaksiatan dan sombong. Dan katakan wahai Musa (padanya) dengan ucapan yang lemah lembut, katakan padanya : Apakah engkau wahai Fir’aun mendambakan kesucian atas dirimu yang telah tenggelam dalam dosa-dosa yang sangat ?; Dan agar supaya engkau mendapat petunjuk atasnya? Dan aku akan beri petunjuk agar engkau taat kepada Rabb-mu dan memiliki rasa takut yang akan membuatmu terhindar dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan dengan membersihkan diri dari syirk, yaitu dengan bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah. Atau membersihkan diri dari noda syirk dan kekafiran dengan menggantinya dengan iman dan amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 18",
    "description": "18-19. Maka nasihati dan katakanlah kepada fir'aun dengan sopan dan lemah lembut, 'adakah keinginanmu untuk membersihkan diri dari kesesatan dan dosa' dan engkau akan kupimpin dan kubimbing ke jalan tuhanmu yang benar dan lurus agar engkau takut kepada-Nya dengan menyembah-Nya dan berbuat baik''18-19"
  }
]