[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-19. Dia berfirman kepada musa,”pergilah kepda fir’aun,dia telah melampaui batas dalam kedurhakaan”. Dan katakanlah kepadanya, “apakah kamu ingin menyucikan dirimu dari keburukan keburukan dan menghiasinya dengan iman”. “Dan aku akan menunjukanmu kepada ketaatan kepada tuhanmu sehingga kamu takut dan bertakwa kepadaNYA?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Aku akan menunjukkan kepadamu jalan menuju Rabb yang telah menciptakanmu dan memeliharamu, sehingga engkau takut kepada-Nya, lalu engkau mengerjakan perbuatan yang diridai-Nya dan menghindari perbuatan yang menjadikan-Nya murka?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَأَهْدِيَكَ إِلَىٰ رَبِّكَ فَتَخْشَىٰ (Dan kamu akan kupimpin ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?”) Yakni aku akan menuntunmu untuk menyembah dan mengesakan-Nya, sehingga kamu dapat takut dari siksaan-Nya. dan ketakutan ini hanya dimiliki oleh orang yang mendapat petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. “Aku akan menuntunmu untuk mengenal Tuhanmu dan menuntunmu untuk beriman kepada-Nya. Sehingga nantinya kamu akan selamat dari siksa-Nya dengan mengerjakan amal kewajiban dan meninggalkan kemunkaran.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan aku akan menunjukkan kepadamu} Aku akan membimbingmu {kepada Tuhanmu agar engkau takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَهْدِيَكَ } Dan akan aku tunjukkan kepadamu jalan benar yang harus kamu lalui, yaitu Hidayah yang Tuhan berikan kepadamu, karena sesungguhnya hidayah hanya lah milik Allah, sedangkan Rasul hanyalah sebagai pembimbing . Akan aku tunjukkan kepadamu jalan Tuhan yang menciptakanmu, yang mengatur segala urusanmu, dan Dialah yang berkuasa atas dirimu, dan sesungguhnya kamu berada dalam genggamannya. Ingat dan sadarilah bahwa sesungguhnya kamu adalah makhluk yang diciptakan, kamu adalah seorang hamba, bahwasanya kamu itu memiliki Tuhan, dan bukanlah kamu sebagai Tuhan, melainkan Dialah Allah Tuhan semsta alam. { وَأَهْدِيَكَ إِلَىٰ رَبِّكَ } dan aku tunjukkan kepadamu jalan Tuhanmu, maha suci Allah, ketika Fir'aun berkata bahwa dialah tuhan, datanglah Musa dan mengatakan kepadanya { وَأَهْدِيَكَ إِلَىٰ رَبِّكَ } , dia menjelaskan bahwa hanya Allah lah Tuhan satu-satunya . Apakah Fir'auntelah menciptakan sesuatu ?! Tidak , sedikitpun dia tidak mampu menciptakan sesuatu, dan Hanya Allah lah Tuhan yang mampu menciptakan segala sesuatu, Dialah yang memberi rezeki, Dialah yang menghidupkan dan mematikan serta mengatur segala urusan. Maka tinggalkan pernyataan mu itu { أَنا رَبُّكُمُ الأَعْلَى } dan hanya Dialah Allah Tuhan bagi kita semua, Tuhan semesta alam, { فَتَخْشَىٰ } agar kamu takut kepada-Nya, jika kamu tau siapa tuhanmu maka kamu akan takut kepada-Nya, dan hanya orang sombong dan bodohlah yang tidak mengetahui siapa Tuhannya, sedangkan dia yang mengetahui siapa Tuhannya, maka dia akan tkaut kepada-Nya, dan berserah diri kepada-Nya, dia akan mengakui bahwa dirinya hanyalah hamba yang lemah, dan akan dikembalikan kepada Tuhannya, dan akan mendapatkan balasan terhadap amalannya. Akan tetapi tawaran itu belum berpengaruh kepadanya, lalu Musa berkata : { قَالَ أَوَلَوْ جِئْتُكَ بِشَيْءٍ مُبِينٍ } ( Musa berkata: “Dan apakah (kamu akan melakukan itu) kendatipun aku tunjukkan kepadamu sesuatu (keterangan) yang nyata?\" ) [ As-Syuara' : 30 ] yakni akan aku tunjukkan kepadamu bukti nyata yang ada pada diriku, yaitu mukjizat yang Allah kehendaki untukku, dan bahwasanya aku adalah sesorang Rasul utusan-Nya, kemudian Fir'aun berkata kepada Musa : { قَالَ إِنْ كُنْتَ جِئْتَ بِآيَةٍ فَأْتِ بِهَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ } ( Fir’aun menjawab: “Jika benar kamu membawa sesuatu bukti, maka datangkanlah bukti itu jika (betul) kamu termasuk orang-orang yang benar”. ) dan ketika itu Musa pun menunjukkan mukjizat yang Allah berikan kepadanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَهْدِيَكَ إِلَى رَبِّكَ فَتَخْشَى “Dan kamu akan kutunjukkan ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?” Maknanya adalah akan ku tunjukkan kepada Rabbnya,yaitu kepada agama Allah ‘Azza Wa Jalla yang dapat mengantarkan kepada Allah: فَتَخْشَى “agar supaya kamu takut kepada-Nya?” Agar kamu takut kepada Allah kerena ilmu yang telah kamu ketahui, karena al-khasyyah (rasa takut dalam ayat ini) maksudnya adalah al-khaufu (rasa takut) yang disertai ilmu, jika tidak disertai ilmu maka itu adalah al-Khaufu (rasa takut) yang hampa, inilah perbedaan antara rasa takut al-Khaufu dengan al-Khasy-yah. Berbedaan keduanya: al-Khasyyah adalah rasa takut yang disertai ilmu (mengenal yang ditakuti): إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ “Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama.”(QS. Fathir: 28) sedangkan al-Khaufu adalah sekedar takut saja walau tanpa ilmu, oleh karenanya terkadang seseorang takut kepada sesuatu yang muncul dari perasaannya kepada sesuatu yang sebenarnya tidak ada, terkadang ia melihat bayangan yang hakikatnya tidak ada, sehingga ia takut padanya. Ini adalah ketakutan yang didasari dugaan saja, namun al-Khasyyah adalah rasa takut disertai ilmu. Lalu Musa ‘alaihissholaatu wassalaam pergi mendatangi Fir’aun dan menyampaikan sesuatu yang diperintahkan Allah kepadanya: هَلْ لَكَ إِلَى أَنْ تَزَكَّى (18) وَأَهْدِيَكَ إِلَى رَبِّكَ فَتَخْشَى (19) “Adakah keinginan bagimu untuk membersihkan diri, Dan kamu akan kutunjukkan ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?” Saat manusia tidak mau menerima dan mengakui kerasulan seseorang kecuali dengan tanda, juga tidak menerima seseorang yan mengaku-ngaku maka Allah membuat bukti atas kebenaran setiap Rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 19: 17-19. Kemudian Allah berkata kepada Musa : Pergilah engkau menuju manusia yang melampaui batas (thagut) yaitu Fir’aun, karena sesungguhnya ia telah berbuat kejahatan dan ia telah melakukan kemaksiatan dan sombong. Dan katakan wahai Musa (padanya) dengan ucapan yang lemah lembut, katakan padanya : Apakah engkau wahai Fir’aun mendambakan kesucian atas dirimu yang telah tenggelam dalam dosa-dosa yang sangat ?; Dan agar supaya engkau mendapat petunjuk atasnya? Dan aku akan beri petunjuk agar engkau taat kepada Rabb-mu dan memiliki rasa takut yang akan membuatmu terhindar dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni aku tunjukkan kepadamu jalan kepada-Nya serta aku terangkan tempat terletak keridhaan-Nya dari tempat terletak kemurkaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 19",
    "description": "18-19. Maka nasihati dan katakanlah kepada fir'aun dengan sopan dan lemah lembut, 'adakah keinginanmu untuk membersihkan diri dari kesesatan dan dosa' dan engkau akan kupimpin dan kubimbing ke jalan tuhanmu yang benar dan lurus agar engkau takut kepada-Nya dengan menyembah-Nya dan berbuat baik''20. Fir'aun marah mendengar ajakan nabi musa dan memintanya memperlihatkan bukti kerasulannya. Nabi musa lalu memperlihatkan kepadanya mukjizat yang besar, yaitu tongkat yang berubah menjadi ular dan tangan yang bercahaya."
  }
]