[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan para malaikat yang mencabut nyawa orang orang kafir dengan keras, Para malaikat yang mencabut nyawa orang orang beriman dengan semangat dan lembut, Para malaikat yang melayang saat turun dari langit dan naik ke langit, Para malaikat yang berlomba melaksanakan perintah Allah dengan segera, Para malaikat yang melaksankan perintah-perintah tuhan mereka terkait dengan tugas yang mereka emban dalam mengatur alam semesta, dan tidak boleh bagi makhluk untuk bersumpah dengan selain penciptanya,dan barang siapa melakukannya,maka dia berbuat syirik, Makhluk-makhluk pasti dibangkitkan dan dihisab pada hari yang bumi berguncang karena tiupan sangkakala pertama,yaitu tiupan kematian, Yang diikuti dengan tiupan kedua untuk kebangkitan kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan Allah bersumpah dengan malaikat yang mencabut nyawa orang-orang yang beriman dengan cara yang mudah dan gampang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَالنّٰشِطٰتِ نَشْطًا (dan (malaikat-malaikat) yang mencabut (nyawa) dengan kuat) Yakni yang menarik nyawa, yakni mengeluarkannya dari jasad dengan tarikan yang kuat. Dan asal kata (النشط) yakni menarik timba dengan tali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Juga demi malaikat yang mencabut ruh orang mukmin dengan perlahan-lahan dan kelembutan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi (malaikat) yang mencabut (nyawa) dengan lemah lembut} Aku bersumpah demi malaikat yang mencabut nyawa orang-orang mukmin dengan dengan menemaninya dan mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 1-5) Sumpah-sumpah dengan para malaikat mulia dan pekerjaan ini menunjukan sempurnanya ketundukan mereka pada perintah Allah dan cepatnya mereka dalam melaksanakannya. Kemungkinan yang menjadi obyek sumpah adalah pembalasan dan kebangkitan, dengan dalil setelahnya menyebutkan kondisi-kondisi hari kiamat. Dan kemungkinan juga obyek sumpah dan yang disumpahkan sama. Allah bersumpah atas para malaikat karena beriman kepada malaikat merupakan salah satu dari enam rukun iman dan karena menyebutkan pekerjaan mereka disini mencakup balasan yang diemban oleh para malaikat pada saat kematian, sebelum dan sesudahnya. Allah berfirman, “Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras,” mereka adalah para malaikat yang mencabut nyawa dengan sekeras-kerasnya dan kencang dalam mencabutnya hingga ruh keluar dari raga, supaya diberi balasan atas amal perbuatannya. “Dan demi malaikat-malaikat yang mencabut nyawa dengan lemah lembut,” mereka juga para malaikat yang menabut ruh dengan kuat dan giat. Atau yang dimaksudkan dengan lemah lembut adalah bagi ruh orang-orang mukmin seadngkan cabutan keras berlaku bagi orang-orang kafir. “Dan demi malaikat-malaikat yang turun dari langit dengan cepat,”nyaitu para malaikat yang turun nahik di udara. “Dan demi malaikat-malaikat yang mendahului,” malaikat lainnya, “dengan kencang,”segera menunaikan perintah Allah dan mendahului para setan dalam menyampaikan wahyu kepada para rasul agar tidak dicuri. “ Dan demi malaikat-malaikat yang mengatur urusan dunia,” yakni, para malaikat yang ditugaskan oleh Allah untuk mengatur berbagai urusan alam atas dan alam bawah, seperti hujan, tumbuh-tumbuhan, angin, laut, janin, hewan, surga, neraka, dan tugas lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu para malaikat yang mencabut nyawa orang beriman dengan lembut dan cepat sebagaimana onta yang hilang dari talinya, maka { وَالنَّاشِطَاتِ } adalah malaikat yang mencabut nyawa orang-orang mukminin, { نَشْطًا } berarti : malaikat mencabut nyawa mereka dengan mudah, tiada kesukaran yang mereka dapati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالنَّاشِطَاتِ نَشْطًا “dan (malaikat-malaikat) yang mencabut (nyawa) dengan lemah-lembut” Maknanya: Para malaikat yang ditugaskan mencabut nyawa orang-orang beriman, mencabut dengan lembut, maksudnya melepasnya dengan kelembutan seperti melepas simpul. Orang-orang kita (arab) menyebutnya dengan simpul pita atau istilah-istilah lainnya, yakni simpul yang bila ditarik salah satu dari ujung talinya maka ia akan terlepas. Simpul ini akan cepat terlepas. Mereka, Para Malaikat yang ditugaskan untuk mencabut nyawa orang-orang beriman melepaskannya dengan lemah lembut. Penyebab itu adalah kerena malaikat-malaikat yang ditugaskan untuk mencabut nyawa orang-orang kafir, jika mereka memanggil nyawanya untuk keluar, mereka akan memanggil dengan panggilan-panggilan terburuk. Malaikat akan mengatakan kepada nyawa orang kafir: Keluarlah wahai jiwa yang buruk yang berada di dalam tubuh yang buruk. Keluarlah menuju amarah Allah. Maka ruh itu akan kabur, tidak ingin keluar ke sana, ia akan terpecah di dalam tubuh sehingga malaikat mencabutnya dengan kasar, malaikat mencabutnya dengan cara yang hampir mencabik-cabik tubuh karena kerasnya cara itu. Ada pun nyawa orang-orang beriman –semoga Allah menjadikanku dan anda termasuk mereka- jika malaikat turun untuk mencabutnya, ia akan memberi kabar gembira: Keluarlah wahai jiwa yang baik yang berada di tubuh yang baik.keluarlah menuju keridhaan Allah. Maka kondisi ini akan ringan baginya untuk meninggalkan tubuhnya yang menyelimutinya, ia keluar dengan mudah. Oleh karena itu, ketika Nabi ‘alaihisshalaatu wassalaam bersabda: مَنْ أَحَبَّ لِقَاءَ اللهِ أَحَبَّ اللهُ لِقَاءَهُ، وَمَنْ كَرِهَ لِقَاءَ اللهِ كَرِهَ اللهُ لِقَاءَه. قَالَتْ عَائِشَةُ:يَا رَسُوْلَ اللهِ إِنَّا لَنَكْرَهُ الْمَوْتَ، فَقَالَ: لَيْسَ ذلِكَ، وَلَكِنَّ الْمُؤْمِنَ إِذَا حَضَرَهُ الْمَوْتُ بُشِّرَ بِرِضْوَانِ اللهِ وَكَرَامَتِهِ فَلَيْسَ شَيْءٌ أَحَبُّ إِلَيْهِ مِمَّا أَمَامَه، فَأَحَبَّ لِقَاءَ اللهِ وَأَحَبَّ اللهُ لِقَاءَهُ “Barang siapa yang cinta bertemu Allah maka Allah akan cinta untuk bertemu dengannya, dan siapa saja yang membenci bertemu Allah maka Allah akan membenci bertemu dengannya” Aisyah bertanya: Ya Rasulullaah, sesungguhnya kita benci kematian, maka beliau menjawab: “ Bukan itu yang dimaksud, akan tetapi maksudnya adalah seorang mukmin apabila kematian menghadirinya, ia akan diberi kabar gembira dengan keridhaan dan kedermaan Allah, maka tidak ada sesuatu yang lebih ia cintai selain yang ada dihadapannya itu, maka ia cinta bertemu dengan Allah, dan Allah cinta bertemu dengannya ”(1) Karena seorang mukmin saat itu melihat dirinya akan berpindah ke rumah yang lebih baik dari rumah yang akan ia tinggalkan. Maka ia akan bergembira seperti jika salah seorang dari kita bergembira saat dikatakan kepadanya, pindahlah dari rumah yang terbuat dari tanah liat kerumah yang dijaga, megah, kokoh lagi bagus, maka ia gembira dan cinta akan bertemu Allah. Sedangkan orang kafir –wal’iyadzu billah- sebaliknya. Jika diberi kabar kemarahan Allah dan siksa, maka ia akan membenci kematian, ia akan membenci bertemu Allah, maka Allah benci bertemu dengannya. (1) Dikeluarkan Bukhari (6507) dari hadits Ubadah Bin Shamit radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 2: 1-5. Surat ini dimulai dengan penyebutan banyak sumpah, yaitu Allah bersumpah dengan malaikat-malaikat yang mencabut ruh-ruh orang kafir, kemudian bersumpah dengan malaikat-malaikat yang menggenggam ruh-ruh orang-orang beriman. Dan Allah bersumpah dengan malaikat yang di tempatkan di ufuk langit-langit dunia, yang mereka senantiasa bertasbih di langit dan turun dengan perintah Rabb-nya beserta petunjuk dari-Nya. Allah bersumpah pula dengan malaikat-malaikat yang berlomba-lomba satu sama lain di antara mereka dalam mentadabburi perintah dari Rabb-Nya. Bersumpah pula (Allah), atas malaikat-malaikat-Nya yang mentadabburi urusan-urusan alam dengan perintah dari Allah Ta’ala. Dan jawaban dari sumpah-sumpah tersebut adalah bahwasanya hari kiamat adalah suatu kebenaran, dan sungguh mereka semua (wahai sekalian manusia !), kalian akan dibangkitkan dan akan di hisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ketika mencabut nyawa orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 2",
    "description": "1-5. Allah memulai surah ini dengan sumpah demi malaikat yang diberinya tugas berat. Di antara tujuannya adalah agar manusia menghayati peran-peran tersebut dalam kehidupan. Demi malaikat yang mencabut nyawa kaum kafir dengan keras dan kasar sebagai tanda kegeraman para malaikat itu terhadap mereka. Demi malaikat yang mencabut nyawa orang mukmin dengan halus dan lemah lembut sebagai tanda simpati para malaikat itu kepada mereka. Malaikat mencabut nyawa mereka sambil berkata, 'wahai jiwa yang tenang, kembalilah ke tuhanmu dengan hati yang rida dan diridai-Nya. ' demi malaikat yang turun dari langit dengan cepat untuk melaksanakan tugas dari Allah sembari selalu bertasbih menyucikan Allah dan mengagungkannya sepanjang waktu, dan demi malaikat yang mendahului yang lain dengan kencang, cepat, dan cekatan untuk melakukan tugas-tugasnya tanpa mengulur waktu, dan demi malaikat yang mengatur urusan dunia, seperti pengisaran angin, turunnya hujan, dan sebagainya sesuai perintah Allah"
  }
]