[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa memperlihatkan mukjizat besar kepada fir’aun,yaitu tongkat dan tangan (yang bercahaya). Tetapi fir’aun mendustakan nabi Allah Musa alaihi salam,dan durhaka kepada tuhannya, Kemudian dia berpaling dari iman,dan berusaha keras dalam menentang nabi Musa alaihi salam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Musa -'alaihissalām- pun memperlihatkan kepadanya mukjizat agung yang menunjukkan bahwa dia adalah utusan dari Rabbnya, yaitu tangan dan tongkat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-25. Kemudian Nabi Musa menunjukkan kepada Fir’aun mukjizat besar dari tongkat dan tangannya yang menjadi bukti kebenaran risalahnya. Namun Fir’aun mendustakannya dan menentang perintah Allah, kemudian dia berpaling dari keimanan dan melanjutkan kerusakan yang dia buat. Dia mengumpulkan kaum dan pengikutnya dengan menyeru mereka dengan angkuh: “Aku adalah tuhan kalian yang maha tinggi.” Maka Allah membalasnya di dunia dengan menenggelamkannya, dan di akhirat dia akan diazab dengan dibakar api neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. فَأَرَىٰهُ الْءَايَةَ الْكُبْرَىٰ (Lalu Musa memperlihatkan kepadanya mukjizat yang besar) Terdapat pendapat mengatakan: yakni mukjizat dari tongkatnya. Dan pendapat lain mengatakan: yakni dari tangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20–21. Lalu Musa pergi kepada Fir’aun dan menunjukkan mukjizat yang besar untuk membuktikan kebenaran kenabiannya. Namun Fir’an tidak mempercayainya, dan melawan perintah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia memperlihatkan kepadamu mukjizat yang besar} tanda yang agung berupa tongkat dan tangan yang putih bersinar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Musa kemudian memperlihatkan mukjizat Allah yang ada pada dirinya kepada Fir'aun yang ia tidak akan bisa mengingkarinya, Musa melemparkan tongkat yang biasa ia pakai untuk bersandar, dia melemarkanya ke hadapan Fir'aun dan tongkat itu tiba-tiba berubah wujud menjadi seekor Ular besar yang merayap dengan cepatnya, perhatikanlah bagaimana tongkat itu yang tadinya adalah benda padat seketika menjadi hewan yang lentur, Allah berkata tentang kejadian ini : { فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُبِينٌ } ( Maka Musa menjatuhkan tongkat-nya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. ) [ Al-A'raf : 108 ] itulah mukjizat yang pertama, kemudian { وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ } ( Dan ia ( Musa ) mengeluarkan tangannya, maka ketika itu juga tangan itu menjadi putih bercahaya (kelihatan) oleh orang-orang yang melihatnya. ) [ Al-A'raf : 108 ]. Yakni ketika Musa memasukkan tangannya dan kemudian mengeluarkannya kembali, seketika muncullah cahaya dari tangan Nabi Musa yang terangnya bagaikan cahaya matahari yang menyinari bumi ,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Di sinilah Allah berfirman: فَأَرَاهُ الْآيَةَ الْكُبْرَى “Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” Yakni Musa memperlihatkan tanda yang besar kepada Fir’aun. Tanda apakah ini? Tanda tersebut adalah sebuah tongkat dari sebatang kayu dari pohon sebagaimana sudah ma’ruf, yang apabila Musa letakkan di tanah maka kayu itu akan menjadi seekor ular yang berjalan, kemudian jika diambil maka wujudnya akan kembali menjadi kayu. Ini adalah diantara tanda-tanda kekuasaan Allah bahwa suatu benda mati yang diletakkan di tanah maka ia menjadi ular yang berjalan kemudia apabila diambil dari tanah maka akan kembali ke wujudnya semula, seperti layaknya tongkat biasa. Allah utus Musa dengan tanda kuasa-Nya tersebut, juga beliau diberi tanda kekuasaan-Nya dengan tangan bila dimasukkan ke dalam sakunya lalu dikeluarkan maka akan keluar dengan cahaya putih tanpa nampak kecacatan sedikitpun, putih bersih bukan karena penyakit namun itu adalah putih tanda kekuasaan Allah. Allah ‘Azza Wa Jalla utus beliau dengan membawa tongkat dan tangan yang putih, karena beliau berada di masa yang mana ilmu sihir sedang menyebar luas, maka Allah utus dengan sesuatu yang dapat mengalahkan para ahli sihir yang berusa menentang Musa ‘alaihissholaatu wassalaam. Para ulama mengatakan: Pada masa Nabi Isa shallallaahu ‘alaihi wa sallam berkembang pesat ilmu kedokteran, maka Isa datang dengan sesuatu yang tidak mampu dilakukan oleh para dokter, yaitu tidaklah ia mengusap orang yang cacat pasti dia akan sembuh, jika didatangkan orang yang cacat permanen lalu diusaplah dengan tangannya maka orang itu akan sembuh seketika dengan izin Allah, dia dapat menyembuhkan buta dan berpenyakit kusta padahal kusta tidak ada obatnya namun ia bisa menyembuhkannya dengan izin dari Allah ‘Azza Wa Jalla. Dia menyembuhkan seorang buta yang dilahirkan tanpa mata, lebih hebat dari itu beliau dapat membangkitkan orang-orang mati dari kubur. Itu semua tidak mungkin dilampaui oleh seorang dokter pun. Oleh kerenanya tanda kuasa Allah pada masa nabi Isa sangat cocok dengan keadaan orang-orang masa itu. Para ulama mengatakan: Adapun Rasulullah shallallahu ‘alaihi wa sallam beliau telah datang di tengah bangsa Arab mereka berbangga bangga dengan kafasihan bahasa arab, mereka memandang bahwa kefasihan itu adalah kedudukan tertinggi seseorang. Maka datanglah Muhammad shallallaahu ‘alaihi wa sallam denga AL-Quran ini yang tidak dapat ditandingi oleh para pakar sastra bahasa arab (pujangga arab). Mereka tidak mampu mendatangkan yang serupa dengannya. Allah Ta’ala berfirman: قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا “Katakanlah: \"Sesungguhnya jika manusia dan jin berkumpul untuk membuat yang serupa Al Qur'an ini, niscaya mereka tidak akan dapat membuat yang serupa dengan dia, sekalipun sebagian mereka menjadi pembantu bagi sebagian yang lain”(QS. Al-Isra: 88) maknanya: andaikata setiap mereka saling membantu maka mereka tetap tidak akan mampu mendatangkan yang semisal dengan al-Quran. Maka kita katakan: Sesungguhnya Musa ‘alaihishalaatu wa salaam, menunjukkan kepada Fir’aun tanda yang besar, namun itu semua tidak bermanfaat: وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ “Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman”(QS. Yunus: 101) , إِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَنَ بِالْغَيْبِ “Sesungguhnya kamu hanya memberi peringatan kepada orang-orang yang mau mengikuti peringatan dan yang takut kepada Tuhan Yang Maha Pemurah walaupun dia tidak melihat-Nya. ”(QS. Yasin: 11) Orang-orang yang tidak memiliki kesiapan untuk menerima hidayah maka mereka tidak akan mendapatkan hidayah meskipun didatangkan semua tanda kuasa Allah wal’iyaadzu billaah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 20: Kemudian setelah selesai pertemuan antara Musa dan Fir’aun dan telah selesai Musa melaksanakan apa yang diperintahkan dari Rabb-nya, maka Fir’aun meminta agar ditunjukkan mukjizat yang dibawa dalam dakwah Musa kepada Fir’aun. Maka Fir’aun melihat tanda-tanda dari mukjizat Musa yaitu dilemparkannya tongkat (Musa) yang berubah menjadi ular berbisa dan kedua tangan yang berubah menjadi (cahaya) putih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu tangan yang bercahaya atau tongkat yang berubah menjadi ular."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 20",
    "description": "Fir'aun marah mendengar ajakan nabi musa dan memintanya memperlihatkan bukti kerasulannya. Nabi musa lalu memperlihatkan kepadanya mukjizat yang besar, yaitu tongkat yang berubah menjadi ular dan tangan yang bercahaya. 21. Fir'aun semakin marah karena merasa terhina dan harga dirinya terusik oleh kedatangan nabi musa. Bukan beriman, tetapi dia justru mendustakan nabi musa dan mendurhakai-Nya dan menuduh beliau sebagai pesihir ulung."
  }
]