[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa memperlihatkan mukjizat besar kepada fir’aun,yaitu tongkat dan tangan (yang bercahaya). Tetapi fir’aun mendustakan nabi Allah Musa alaihi salam,dan durhaka kepada tuhannya, Kemudian dia berpaling dari iman,dan berusaha keras dalam menentang nabi Musa alaihi salam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Adapun tanggapan yang terjadi dari Fir'aun tidak lain hanyalah pendustaan terhadap mukjizat ini dan ia mendurhakai apa yang diperintahkan oleh Musa -'alaihissalām- kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20–21. Lalu Musa pergi kepada Fir’aun dan menunjukkan mukjizat yang besar untuk membuktikan kebenaran kenabiannya. Namun Fir’an tidak mempercayainya, dan melawan perintah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan tetapi, dia mendustakan dan durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Walaupun demikian Fir'aun tetaplah pada pembangkangannya. Setelah Fir'aun menyaksikan ayat-ayat Allah beserta bukti nyatanya melalui mukjizat yang Allah anugerahkan kepada Nabi Musa 'alaihissalam, akan tetapi ia tetap pada kesombongannya dan pendustaannya terhadap ayat-ayat Allah dan Mukjizat Nabi Musa 'alaihissalam, dan ia pun berkata { أناَ رَبُّكُمُ الأَعْلَى } saya lah Tuhanmu yang paling tinggi, dan ia juga mengatakan pada ayat ayat lain : { يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَٰهٍ غَيْرِي } ( Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku. ) [ Al-Qashas : 38 ] , dan Fir'aun meminta kepada Mentrinya untuk mendirikan bangunan yang menjulang ke langit, agar ia bisa melihat Tuhan yang dikatakan oleh Musa, Fir'aun berkata : { فَاجْعَلْ لِي صَرْحًا لَعَلِّي أَطَّلِعُ إِلَىٰ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ مِنَ الْكَاذِبِينَ } ( kemudian buatkanlah untukku bangunan yang tinggi supaya aku dapat naik melihat Tuhan Musa, dan sesungguhnya aku benar-benar yakin bahwa dia termasuk orang-orang pendusta”. ) [ Al-Qashas : 38 ], walaupun sang mentri dapat mendirikan bangunan itu menjulang ke langit, akan tetapi Fir'aun tetap takkan bisa sampai ketempat Tuhan Musa itu berada, dan manusia jika telah ditimpa olehya kesombongan, maka dengan cara apapun ia akan terus melakukan pembangkangan dan pendustaannya. Sampai ia pun mengatakan bahwa dialah Tuhan yang paling tinggi"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah Ta’ala berfirman: فَكَذَّبَ وَعَصَى “Tetapi Firaun mendustakan dan mendurhakai” Mendustakan berita (wahyu) dan tidak mentaati perintah, maksudnya: Ia berkata kepada Musa: Sesungguhnya kamu bukan Rasul.Bahkan ia mengatakan: إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ “Sesungguhnya Rasulmu yang diutus kepada kamu sekalian benar-benar orang gila” (QS. Asy-Syu’ara: 27) ia tidak ta’at perintah itu, ia tidak melaksanakan perintah Musa, dan tidak patuh terhadap syari’atnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 21: Akan tetapi Fir’aun tetap dengan pendiriannya dan sombong serta mendustakan mukjizat Musa. Maka ia adalah orang yang durhaka kepada Rabb-nya dan tidak beriman kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mendustakan Nabi Musa ‘alaihis salam. Yakni mendurhakai Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 21",
    "description": "Fir'aun semakin marah karena merasa terhina dan harga dirinya terusik oleh kedatangan nabi musa. Bukan beriman, tetapi dia justru mendustakan nabi musa dan mendurhakai-Nya dan menuduh beliau sebagai pesihir ulung. 22. Kemudian dia berpaling dari kebenaran seraya berusaha menantang nabi musa untuk bertanding melawan para pesihir yang didatangkannya dari seluruh pelosok mesir."
  }
]