[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa memperlihatkan mukjizat besar kepada fir’aun,yaitu tongkat dan tangan (yang bercahaya). Tetapi fir’aun mendustakan nabi Allah Musa alaihi salam,dan durhaka kepada tuhannya, Kemudian dia berpaling dari iman,dan berusaha keras dalam menentang nabi Musa alaihi salam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kemudian ia berpaling dari keimanan terhadap apa yang dibawa oleh Musa -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. ثُمَّ أَدْبَرَ (Kemudian dia berpaling) Yakni berpaling dan enggan untuk beriman. يَسْعَىٰ (seraya berusaha menantang) Yakni berbuat kerusakan di bumi, dan berusaha menentang apa yang dibawa oleh Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Fir’aun mengingkari Musa dan menolak untuk beriman, justru membuat kerusakan di bumi dan membantah perintah Musa sebagai Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian dia berpaling} berpaling menolak keimanan {seraya berusaha} berusaha dengan sungguh-sungguh untuk menentang apa yang dibawa Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian ia berpaling dari peringatan dan terus menentang kebenaran yang dibawakan oleh Nabi Musa 'alaihissalam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ أَدْبَرَ يَسْعَى “Kemudian dia berpaling seraya berusaha menantang (Musa).” Maknanya: Berpaling membelakangi berusaha menentang"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 22: Lalu Fir’aun menentang dengan penolakan yang keras atas urusan keimanan dan ketauhidan (yang disampaikan oleh musa). Ia bersikukuh menentang Musa dan memeranginya. (Padahal) bersama’an dengan sikap Fir’aun tersebut, ia meyakini kebenaran yang dikatakan Musa, sebagaimana yang di firmankan oleh Allah, “Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya”. {An Naml : 14}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari beriman. Bisa juga diartikan berusaha mengadakan kerusakan di bumi atau berusaha menentang yang hak dan memeranginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 22",
    "description": "Kemudian dia berpaling dari kebenaran seraya berusaha menantang nabi musa untuk bertanding melawan para pesihir yang didatangkannya dari seluruh pelosok mesir. 23. Kemudian dia mengumpulkan pembesar-pembesarnya yang setia lalu berseru memanggil kaumnya melalui petugas dan bala tentaranya."
  }
]