[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-26. Dia mengumpulkan rakyat kerajaannya dan memanggil mereka, Dia berkata,”aku adalah tuhan kalian yang tidak ada tuhan di atasnya.” Maka Allah menghukumnya dengan azab di dunia dan akhirat,dan menjadikan nya sebagai nasihat dan pelajaran bagi orang orang yang membangkang sepertinya. Sesungguhnya fir’aun dan apa yang menimpanya merupakan nasihat bagi siapa yang hendak mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Justru ia mengumpulkan bala tentaranya untuk mengalahkan Musa -'alaihissalām-, lalu ia menyeru kaumnya dengan berkata,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فَحَشَرَ (Maka dia mengumpulkan) Maka Fir’aun mengumpulkan tentaranya untuk berperang, atau mengumpulkan para penyihir untuk melawannya, atau mengumpulkan orang-orang untuk menyaksikan apa yang terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Maka semua manusia berkumpul, maka para pembesarnya dipanggil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia mengumpulkan} mengumpulkan kaum dan pembesar-pembesarnya {lalu menyeru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan setelah itu FIr'aun mengumpulkan seluruh rakyatnya dan memangil mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَحَشَرَ فَنَادَى “Maka dia mengumpulkan (pembesar-pembesarnya) lalu berseru memanggil kaumnya” Maknanya: mengumpulkan manusia dan menyeru mereka dengan suara yang lantang agar lebih tegas dalam melarang mereka dari yang diinginkan Musa ‘alaihissholaatu wassalaam, dari mereka"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 23: 23-25. Kemudian Fir’’aun mengumpulkan pasukannya dan anggota kerajaannya dalam satu barisan, kemudian Fir’aun berkata : Ketahuilah oleh kalian bahwasanya aku adalah Rabb yang maha tinggi. Itulah keadaan Fir’aun yang telah buta mata hatinya dan tertipu akan kekuatannya, kerajaannya, dan para pasukannya. Dan balasan dari Allah kepada Fir’aun adalah adzab baik di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 23",
    "description": "Kemudian dia mengumpulkan pembesar-pembesarnya yang setia lalu berseru memanggil kaumnya melalui petugas dan bala tentaranya. 24. Fir'aun berkata dengan sombong dan angkuh, 'akulah tuhanmu yang paling tinggi. Hanya aku yang berhak kamu taati, bukan tuhan nabi musa. Akulah yang paling berkuasa di negeri mesir ini. '"
  }
]