[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-26. Dia mengumpulkan rakyat kerajaannya dan memanggil mereka, Dia berkata,”aku adalah tuhan kalian yang tidak ada tuhan di atasnya.” Maka Allah menghukumnya dengan azab di dunia dan akhirat,dan menjadikan nya sebagai nasihat dan pelajaran bagi orang orang yang membangkang sepertinya. Sesungguhnya fir’aun dan apa yang menimpanya merupakan nasihat bagi siapa yang hendak mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. “Aku adalah tuhan kalian yang tertinggi, maka kalian tidak boleh taat kepada selainku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَقَالَ أَنَا۠ رَبُّكُمُ الْأَعْلَىٰ ((Seraya) berkata: “Akulah tuhanmu yang paling tinggi”) Fir’aun bermaksud menyatakan bahwa tidak ada tuhan yang lebih tinggi darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Allah berkata kepada mereka: “Aku adalah Tuhanmu yang paling tinggi dari semua kekuasaanmu, bukan Tuhan yang hanya lebih tinggi saja\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Akulah Tuhanmu yang paling tinggi”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dia pun berkata : \"Akulah tuhanmu yang paling tinggi dan tiada lagi Tuhan diatasku\"."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَى “(Seraya) berkata: \"Akulah tuhanmu yang paling tinggi” Maknanya: Tidak ada yang lebih tinggi dariku, karena اَلْأَعْلَى [al-A’laa] dalam kaedah bahasa arab adalah isim tafdhil (kata yang menunjukkan paling tinggi) dari اَلْعُلُوُّ [al-‘Uluw] “tinggi” lihatlah bagaimana laki-laki ini sombong dan mengaku-ngaku sesuatu yang bukan haknya pada ucapannya: أَنَا رَبُّكُمُ الْأَعْلَى “” Ia berbangga-bangga dengan sungai dan kerajaan yang luas, ia berkata pada bangsanya: يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي أَفَلَا تُبْصِرُونَ (51) أَمْ أَنَا خَيْرٌ مِنْ هَذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ “Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku dan (bukankah) sungai-sungai ini mengalir di bawahku; maka apakah kamu tidak melihat (nya) Bukankah aku lebih baik dari orang yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?? ” (QS. Az-Zukhruf: 51-52). Maka apa yang terjadi setelah itu?! Allah ‘Azza Wa Jalla menenggelamkannya dengan air sungai yang ia bangga-banggakan itu, dan Allah wariskan kerajaan mesir untuk Bani Israil yang dulu ia lemahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 24: 23-25. Kemudian Fir’’aun mengumpulkan pasukannya dan anggota kerajaannya dalam satu barisan, kemudian Fir’aun berkata : Ketahuilah oleh kalian bahwasanya aku adalah Rabb yang maha tinggi. Itulah keadaan Fir’aun yang telah buta mata hatinya dan tertipu akan kekuatannya, kerajaannya, dan para pasukannya. Dan balasan dari Allah kepada Fir’aun adalah adzab baik di dunia maupun di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, tidak ada tuhan di atasku. Lalu kaumnya menaatinya dan mengakui kebatilannya itu karena pengaruhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 24",
    "description": "Fir'aun berkata dengan sombong dan angkuh, 'akulah tuhanmu yang paling tinggi. Hanya aku yang berhak kamu taati, bukan tuhan nabi musa. Akulah yang paling berkuasa di negeri mesir ini. ' 25. Pertandingan melawan para pesihir akhirnya dihelat dan memunculkan nabi musa sebagai pemenang. Mereka lantas beriman kepada nabi musa. Merasa terancam, fir'aun mengejar nabi musa dan pengikutnya hingga pinggir laut merah. Maka Allah menghukumnya dengan azab di akhirat dengan siksaan yang pedih dan siksaan di dunia dengan menenggelamkannya di laut merah bersama para prajuritnya."
  }
]