[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-26. Dia mengumpulkan rakyat kerajaannya dan memanggil mereka, Dia berkata,”aku adalah tuhan kalian yang tidak ada tuhan di atasnya.” Maka Allah menghukumnya dengan azab di dunia dan akhirat,dan menjadikan nya sebagai nasihat dan pelajaran bagi orang orang yang membangkang sepertinya. Sesungguhnya fir’aun dan apa yang menimpanya merupakan nasihat bagi siapa yang hendak mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Maka Allah menyiksanya dengan memberi balasan di dunia berupa tenggelam di lautan, dan memberi balasan di Akhirat dengan memasukkannya ke dalam siksa yang paling pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. فَأَخَذَهُ اللَّـهُ نَكَالَ الْءَاخِرَةِ وَالْأُولَىٰٓ (Maka Allah mengazabnya dengan azab di akhirat dan azab di dunia) Yakni Allah kemudian mematikannya dan mengazabnya dengan azab di akhirat berupa azab neraka, serta dengan azab di dunia dengan menenggelamkannya di lautan, agar menjadi pelajaran bagi orang yang mendengar kisahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Maka Allah menghukum mereka sebagai azab dan siksaan bagi mereka. Agar mereka bisa dijadikan pelajaran bagi kaum lainnya yang disiksa di dunia dan di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Allah menghukumnya} menghukumnya {dengan azab di akhirat dan di dunia} azab di akhirat dengan neraka dan azab di dunia dengan ditenggelamkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 15-25) Allah berfirman kepada Nabinya Muhammad, “tatkala Rabbnya memanggilnya di lembah suci, yaitu lembah Thuwa,” yakni tempat dimana Allah berbicara dengan Musa dan memberi karunia risalah pada beliau, “ Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,” yakni, meski ia melampaui batas, berbuat syirik dan durhaka, berkatalah padanya dengan lemah lembut, semoga ia ingat atau takut. ‘Dan katakanlah (kepada firaun), ‘Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’,” apalah pada dirimu terdapat sifat terpuji dan indah yang diperebutkan oleh orang orang berakal? Yaitu dengan menyucikan dirimu dengan dari kotoran kufur dan tindakan yang melampaui batas menuju keimanan dan amal baik. “ Dan kamu akan kupimpin ke jalan Rabbmu,” yakni aku tunjukkan padaNya dan aku jelaskan faktor faktor keridhaanNya padamu dan juga faktor faktor kemurkaanNya, “ Agar supaya kamu takut” kepada Allah bila kau mengetahui jalan yang lurus. Fir’aun enggan atas seruan Musa. “ Lalu Musa memperlihatkan kepadanya mukjizat yang besar.” yaitu jenis tanda-tanda kebesaran yang agung yang tidak menafikan mukjizat mukjizat lain yang beragam. “Maka Musa menjatuhkan tongkatnya, lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya. Dan ia mengeluarkan tangannya, maka seketika itu juga tangan menjadi putih bercahaya (kelihatan) oleh orang orang yang melihatanya.” (Al-A’raf: 107-108). “Tetapi Fir’aun mendustakan” kebenaran “dan mendurhakai” perintah. “Kemudian dia berpaling seraya berusaha menantang (Musa),” yaitu berusaha melawan kebenaran dan memeranginya. “Maka ia mengumpulkan (pembesar pembesarnya),” yakni dari tentaranya, “lalu berseru memanggil kaumnya (seraya) berkata, ‘Akulah Rabbmu yang paling tinggi. “Kaumnya tunduk pada Fir’aun dan mengakui kebatilan Musa. Ketika Fir’aun meremehkan Musa, “maka Allah mengazabnya dengan azab di akhirat dan azab di dunia,” yakni, Allah menjadikan hukuman terhadapnya sebagai petunjuk dan peringatan keras, serta untuk menjelaskan azab dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan hasil dari pernyataannya itu Allah kemudian memberinya azab yang pedih, didunia maupun di akhirat nanti. { فَأَخَذَهُ اللَّهُ نَكَالَ الْآخِرَةِ } yaitu azab pada hari kiamat, dan juga { وَالْأُولَىٰ } azab didunia, ALlah mengazab Fir'aun dengan azab dunia serta azab akhirat, itu dikarenakan kesombongannya dan penolakannya terhadap kebenaran Firman Allah yang di bawa oleh Nabi Musa 'alaihissalam, terlebih lagi setelah Musa menunjukkan kepadanya beberapa Mukjizat yang Allah berikan kepadanya, akan tetapi semua itu sama sekali tidak berguna bagi Fir'aun, dikarenakan kekerasan hatinya dan kesombongannya, serta pengakuannya bahwa dialah Tuhan yang paling tinggi, dia juga berkata kepada Musa : \"wahai Musa apa yang kamu tunjukkan kepadaku yang kamu anggap itu Mukjizat adalah sihir, maka kami pun akan mendatangkan kepadamu sihir yang sama\" , { فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِثْلِهِ } ( Dan kamipun pasti akan mendatangkan (pula) kepadamu sihir semacam itu ) [ Taha : 58 ] , Fir'aun menganggap bahwa Musa adalah seorang penyihir, dan apa yang Musa lakukan adalah merupakan sebuah rekayasa sihir , maka Musa pun berkata \"Kami juga memiliki tukang sihir bahkan lebih banyak, dan merekalah yang akan menunjukkan kepadamu ( Musa ) kebenaran yang hakiki\" . Kemudian Fir'aun pun mengumpulkan para penyihirnya di suatu lembah yang luas, dan berkumpul pula segenap ummat manusia dan bersama mereka Fir'aun, dan juga Musa, kemudian para penyihir pun memulai pertunjukan mereka dengan memenuhi lembah itu dengan berbagai sihir mereka, sebagaimana yang Allah katakan : { سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ } ( mereka menyulap mata orang dan menjadikan orang banyak itu takut, serta mereka mendatangkan sihir yang besar (mena’jubkan) ) , dan akhirnya lembah itu penuh dengan berbagai macam sihir yang menakutkan. Ketika itu pun Musa juga merasa takut, Sebagaimana yang Allah kataka : { فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُوسَىٰ , قُلْنَا لَا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلَىٰ } ( Maka Musa merasa takut dalam hatinya , Kami berkata: “janganlah kamu takut, sesungguhnya kamulah yang paling unggul (menang) ) [ Thaha : 67-68 ] Dan akhirnya Musa melemparkan tongkatnya kemudian tongkat itu berubah menjadi ular yang sangat besar dan memusnahkan seluruh sihir yang mereka lemparkan , bahkan hampir memakan para penyihir yang hadir, mereka pun memohon kepada Musa untuk menghentikan aksinya, kemudian Musa mecukupkan aksinya itu dan kembalilah tongkatnya seperti semula. Dan ketika itu pun para penyihir menyatakan keimanan mereka , karena mereka mengakui bahwa apa yang mereka lakukan adalah pembohongan dan penipuan, dan jauh daripada kebenaran, dan apa yang dibawakan oleh Musa adalah merupan kebenaran yang datangnya dari Allah ta'ala. Dan inilah hikmah dari dikumpulnya kaum yang besar oleh Fir'aun untuk menunjukkan kebenaran yang mereka akui, akan tetapi semuanya sia-sia dan apa yang mereka lakukan adalah kebathilan, akan tetapi Fir'aun dikala itu tetap pada kesombongannya yang tinggi, Fir'aun semakin mengancam Musa bersama kaumnya, dan Allah pun memerintahkan Musa untuk keluar bersama bani israil yang beriman kepadanya yang selama ini bersamanya yang sebagian besar merrka adalah dari keturunan Ya'kub 'alaihissalam . Allah memerintahkan Nabi-Nya dan orang-orang mukmin yang selalu bersamanya untuk keluar dari negri itu meninggalkan pemerintahan Fir'aun yang kejam ini, ketika Fir'aun mengetahui akan rencana kepergian Musa dan kaumnya, dan ini juga merupakan ayat Allah dan kehendak-Nya untuk memusnahkan Fir'aun dan bala tentaranya, Fir'aun kemudian bersikeras dan mengumpulkan bala tentaranya { فَأَرْسَلَ فِرْعَوْنُ فِي الْمَدَائِنِ حَاشِرِينَ 53 إِنَّ هَٰؤُلَاءِ لَشِرْذِمَةٌ قَلِيلُونَ 54 وَإِنَّهُمْ لَنَا لَغَائِظُونَ وَإِنَّا لَجَمِيعٌ حَاذِرُونَ } ( Kemudian Fir’aun mengirimkan orang yang mengumpulkan (tentaranya) ke kota-kota , (Fir’aun berkata): “Sesungguhnya mereka (Bani Israil) benar-benar golongan kecil , Dan sesungguhnya mereka membuat hal-hal yang menimbulkan amarah kita , Dan sesungguhnya kita benar-benar golongan yang selalu berjaga-jaga” ) [ Asy-Syuara' : 53-56 ] Fir'aun mengumpulkan bala tentaranya untuk memusnahkan Musa dan kaumnya. Mereka pun keluar dan mengikuti jejak Musa dan kaumnya, dan akhirnya mereka berhasil menemui Musa di dermaga laut merah, dan kedua golongan itupun saling bertemu { فَلَمَّا تَرَاءَى الْجَمْعَانِ قَالَ أَصْحَابُ مُوسَىٰ إِنَّا لَمُدْرَكُونَ } ( Maka setelah kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa: “Sesungguhnya kita benar-benar akan tersusul”. ) [ Asy-Syuara' : 61 ] , laut merah tepat berada didepan Musa bersama kaumnya,, dan musuh berada di belakang mereka, lalu kemana mereka akan lari ? Musa berkata : { قَالَ كَلَّا ۖ إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ } ( Musa menjawab: “Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku”. ) [ Asy-Syuara' : 62 ] . Dan akhirnya Allah berkata kepada Musa : { فَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنِ اضْرِبْ بِعَصَاكَ الْبَحْرَ ۖ فَانْفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيمِ } ( Lalu Kami wahyukan kepada Musa: “Pukullah lautan itu dengan tongkatmu”. Maka terbelah lah lautan itu dan tiap-tiap belahan adalah seperti gunung yang besar. ) [ Asy-Syuara' : 63 ] ,Musa kemudian memukulkan tongkatnya kelaut atas perintah Allah, dan terbelahlah lau itu lalu membentuk jalan sebanyak 12 jalan, yakni sesuai dengan jumlah suku-suku bani israil pada waktu, maka setiap suku mengikuti jalannya masing-masing, sehingga mereka tidak berdesak-desakan, dan ketika Fir'aun melihat mereka berjalan menyebrangi lautan dia pun mengikuti mereka dari belakang bersama bala tentaranya, sesampainya Musa dan kaumnya seluruhnya di seberang lautan dan Fir'aun beserta bala tentaranya telah memasuki lautan seluruhnya, Allah kemudian dengan kuasanya mengembalikan air laut itu pada keadannya seperti semula, maka dalam seketika laut pun menenggelamkan Fir'aun beserta pengikutnya . Dan Allah menolong Rasulnya dan juga orang-orang beriman, dan terbebaslah mereka dari kekejaman Fir'aun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَخَذَهُ اللَّهُ نَكَالَ الْآخِرَةِ وَالْأُولَى : “Maka Allah mengazabnya dengan azab di akhir dan azab di awal.” Allah mengazabnya dengan azab Sang Maha Perkasa dan Maha Kuasa. نَكَالَ الْآخِرَةِ وَالْأُولَى “azab di akhir dan azab di awal” Yakni: Bahwa Allah mengazabnya di akhirat dan di dunia. Ia akan menjadi ibrah di zamannya, dan ibrah pada masa setelahnya hingga hari kiamat bagi siapa saja yang membaca Kitabullaah , dan apa saja telah Allah lakukan kepada Fir’aun maka ia akan mengambil ibrah yang dapat dipelajari, bagaimana Allah memusnahkannya bersama kerajaannya yang besar, kesombongannya dan melampaui batas, maka ia menjadi terhinakan di hadapan Allah dengan kehinaan sesungguhnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 25: 23-25. Kemudian Fir’’aun mengumpulkan pasukannya dan anggota kerajaannya dalam satu barisan, kemudian Fir’aun berkata : Ketahuilah oleh kalian bahwasanya aku adalah Rabb yang maha tinggi. Itulah keadaan Fir’aun yang telah buta mata hatinya dan tertipu akan kekuatannya, kerajaannya, dan para pasukannya. Dan balasan dari Allah kepada Fir’aun adalah adzab baik di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 25",
    "description": "Pertandingan melawan para pesihir akhirnya dihelat dan memunculkan nabi musa sebagai pemenang. Mereka lantas beriman kepada nabi musa. Merasa terancam, fir'aun mengejar nabi musa dan pengikutnya hingga pinggir laut merah. Maka Allah menghukumnya dengan azab di akhirat dengan siksaan yang pedih dan siksaan di dunia dengan menenggelamkannya di laut merah bersama para prajuritnya. 26. Demikianlah kisah dakwah dan ketabahan nabi musa menghadapi fir'aun. Sungguh, pada yang demikian itu terdapat pelajaran yang sangat berharga bagi orang yang takut kepada Allah. Kisah itu mengajarkan bahwa kebenaran pasti akan mengalahkan kebatilan dan jabatan yang tinggi seringkali menjerumuskan seseorang untuk melanggar baik terhadap aturan agama maupun etika."
  }
]