[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-26. Dia mengumpulkan rakyat kerajaannya dan memanggil mereka, Dia berkata,”aku adalah tuhan kalian yang tidak ada tuhan di atasnya.” Maka Allah menghukumnya dengan azab di dunia dan akhirat,dan menjadikan nya sebagai nasihat dan pelajaran bagi orang orang yang membangkang sepertinya. Sesungguhnya fir’aun dan apa yang menimpanya merupakan nasihat bagi siapa yang hendak mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sesungguhnya di dalam balasan Kami terhadap Fir'aun di dunia dan di Akhirat itu terdapat nasihat bagi orang yang takut kepada Allah, karena orang yang takut kepada Allah lah yang bisa mendapatkan manfaat dari nasihat-nasihat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Sungguh pada azab yang besar itu terdapat pelajaran bagi orang yang takut kepada siksaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. إِنَّ فِى ذٰلِكَ لَعِبْرَةً لِّمَن يَخْشَىٰٓ (Sesungguhnya pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Tuhannya)) Yakni kisah Fir’aun dan perbuatannya yang disebutkan ini adalah pelajaran yang besar bagi orang yang takut dan taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sungguh dalam hukuman itu ada pelajaran bagi orang-orang yang takut kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran} pelajaran {bagi orang yang takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(26) “sesungguhnya pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Rabbnya),” karena orang yang takut keoada Allah adalah orang yang mendapatkan manfaat dari tanda-tanda kebesaran serta pelajaran-pelajaran. Ketika mengetahui hukuman dan azab Fir’aun, ia mengetahui bahwa semua orang yang menyombongkan diri, durhaka, dan menentang Allah yang maha tinggi akan mendapatkan siksaan di dunia dan di akhirat. Sedangkan orang yang rasa takutnya pada Allah lenyap dari hatinya, meski semua tanda kebesaran datang padanya, maka ia tetap tidak akan beriman."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya dari apa yang telah terjadi dalam kisah Musa dan Fir'aun adalah pelajaran berharga bagi orang-orang yang takut kepada Tuhannya, maka apakah kalian tidak mengambil pelajaran darinya ? , dan apakah kalian tidak takut jika terjadi hal yang sama pada kalian, akan tetapi jika hati telah tertup maka tiada lagi manfaat dari peringatan itu { سَيَذَّكَّرُ مَنْ يَخْشَىٰ , وَيَتَجَنَّبُهَا الْأَشْقَى } ( Orang yang takut (kepada Allah) akan mendapat pelajaran , Dan orang-orang yang celaka (kafir) akan menjauhinya ) [ Al-A'la : 10-11 ] Dan intinya adalah : Bahwa apa yang Allah sebutkan dalam surat ini yang berkenaan dengan kisah Musa dan Fir'aun yang sambungan kisahnya ada pada beberapa ayat dalam surat As-Syu'ara' dan surat lainnya, adalah merupakan hiburan serta pelajaran bagi Rasulullah Muhammad, dan juga merupakan hiburan bagi orang beriman dan para penebar dakwah islam dalam tiap waktu mereka, dan merupakan janji dari Allah bahwasanya mereka tidak berputus asa, serta tidak frustasi dihadapan musuh, mereka juga tidak berputusa asa dari pertolongan Allah terhadap musuh mereka, dan ini sudah menjadi ketentuan Allah pada makhluknya yang tidak dapat diubah dan digantikan lagi dengan ketentuan lain kecuali dengan kehendak-Nya, Allah berfirman : { 19 أَلَمْ نُهْلِكِ الْأَوَّلِينَ 16, ثُمَّ نُتْبِعُهُمُ الْآخِرِينَ 17, كَذَٰلِكَ نَفْعَلُ بِالْمُجْرِمِينَ 18, وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ } ( Bukankah Kami telah membinasakan orang-orang yang dahulu? 16 , Lalu Kami iringkan (azab Kami terhadap) mereka dengan (mengazab) orang-orang yang datang kemudian. 17, Demikianlah Kami berbuat terhadap orang-orang yang berdosa. 18, Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan. 19 ) [ Al-Mursalat : 16-19 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ فِي ذَلِكَ لَعِبْرَةً لِمَنْ يَخْشَى “Sesungguhnya pada yang demikian itu terdapat pelajaran bagi orang yang takut ”إِنَّ فِي ذَلِكَ \" Sesungguhnya pada yang demikian itu \" Maknanya: Pada apa yang terjadi dari diutusnya Musa kepada Fir’aun, percakapannya, tantangan Fir’aun kepadanya dan kesombongan Fir’aun sehingga enggan untuk patuh, terdapat pelajaran لِمَنْ يَخْشَى “bagi orang yang takut” Maknanya: Bagi siapa saja yang takut kepada Allah ‘Azza Wa Jalla. Maka siapa saja yang memiliki rasa takut kepada Allah dan merenungi apa-apa yang terjadi pada Musa dengan Fir’aun , dan akhir yang terjadi pada mereka berdua, maka dia akan mengambil pelajaran dan mengambil ibrah. Sehingga ia akan menempuh jalan para rasul dan meninggalkan jalan-jalan orang-orang kafir. Pelajaran-pelajaran yang terdapat pada kisah Musa sangat banyak, andai saja ada orang yang mau mengumpulkan kisahnya dari ayat-ayat al-Quran dari setiap surat, kemudian mengambil pelajaran dari yang terjadi pada kisahnya, maka ini bagus. Itu dengan cara menukilkan kisah-kisahnya dari seluruh ayat-ayat yang menerangkan kisah Musa, karena setiap surat dalam al-Quran terdapat tambahan pelengkap bagi surat lainnya. Kalau sudah mengumpulkannya lalu mengatakan misalnya: ada beberapa pelajaran yang dipetik dari kisah yang agung ini yaitu: Kemudia ia menyebutkannya, bagaimana Allah ‘Azza Wa Jalla mengutus Musa kepada Fir’aun? Bagaimana Allah memerintahkan Musa dan harun: فَقُولَا لَهُ قَوْلًا لَيِّنًا “maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut”(QS. Thaha: 44) padahal Ia sombong buruk akhlaknya? Bagaimana akhirnya? Bagaimana Musa ‘alaihissholaatu wassalaam bisa keluar dari Mesir karena khawatir akan dirinya secara diam-diam, sebagaimana Rasulullah ‘alaihissholaatu wassalaam keluar dari Mekkah secara diam-diam, Maka kesudahan yang baik diperoleh Rasulullah ‘alaihissholaatu wassalaam dan Musa ‘alaihissholaatu Wassalaam, namun kesudaahan baik bagi Rasulullah shallallaahu ‘alaihi wa sallam dengan perbuatan beliau beserta para sahabatnya, Allah mengazab musuh-musuhya melalui tangan-tangan mereka. Sedangkan kesudahan Musa dengan tindakan Allah ‘Azza Wa jalla langsung. Itu semua adalah pelajaran-pelajaran bagi manusia yang dapat memperbaiki diri dan jiwanya, sehingga akan jelas kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 26: Dan ketahuilah oleh kalian wahai manusia ! Bahwasanya pada kisah Fir’aun dan adzab yang di turunkan padanya sungguh menjadi nasihat bagi siapa yang bertakwa kepada Allah dan takut akan hukuman (dari-Nya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena orang yang takut kepada Allah, dialah yang dapat mengambil manfaat dari ayat-ayat dan pelajaran-pelajaran yang disampaikan. Ketika dia melihat hukuman yang menimpa Fir’aun, maka dia mengetahui bahwa setiap orang yang sombong dan durhaka kepada Allah, bahkan berani menentang Allah, maka Allah akan menghukumnya di dunia dan akhirat. Akan tetapi, orang yang telah hilang rasa takut kepada Allah dari hatinya, maka ia tetap tidak akan beriman meskipun didatangkan setiap ayat kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 26",
    "description": "Demikianlah kisah dakwah dan ketabahan nabi musa menghadapi fir'aun. Sungguh, pada yang demikian itu terdapat pelajaran yang sangat berharga bagi orang yang takut kepada Allah. Kisah itu mengajarkan bahwa kebenaran pasti akan mengalahkan kebatilan dan jabatan yang tinggi seringkali menjerumuskan seseorang untuk melanggar baik terhadap aturan agama maupun etika. 27. Menjelaskan keperkasaan Allah dan kelemahan manusia, Allah berfrman, 'apakah penciptaan kamu yang lebih hebat ataukah langit yang telah dibangun-Nya' secara logika, penciptaan langit yang demikian luas tentu lebih sulit daripada penciptaan manusia."
  }
]