[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-33. Apakah menurut kalian (wahai manusia),dibangkitkannya kalian sesudah kematian lebih berat daripada menciptakan langit? Allah menjunjung di atas kalian seperti bangunan,mengangkat di angkasa,tidak ada ketidak serasian padanya dan tidak pula ada retak. Allah menjadikan malamnya gelap dengan terpendamnya matahari,menjadikan siang terang dengan terbitnya matahari. Allah membentangkan bumi sesudah menciptakan langit,dan meletakan manfaat-manfaatnya di dalamnya. Dan Allah memancarkan dari dalamnya mata-mata air, dan menumbuhkan sesuatu yang bisa menjaganya dari tumbuh-tumbuhan. Dan menetapkan gunung-gunung sebagai patok-patoknya. Allah menciptakan seluruh nikmat nikmat ini bagi kalian dan ternak ternak kalian. Sesungguhnya menciptakan kalian kembali pada hari kiamat adalah lebih mudah bagi Allah daripada menciptakan semua ini, dan semuanya bagi Nya adalah mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Apakah penciptaan kalian oleh Allah -wahai orang-orang yang mendustakan Hari Kebangkitan- lebih sulit daripada penciptaan langit yang telah dibangun oleh Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-33. Allah mengingkari orang-orang yang mendustakan hari kebangkitan: “Hai para hamba, menurut kalian apakah penciptaan kalian lebih sulit daripada penciptaan langit? Allah telah membangun langit dengan sempurna, dengan menjadikannya bangunan yang tinggi, penjuru-penjuru yang seimbang, menjadikan malamnya gelap gulita dan siangnya terang benderang. Kemudian setelah penciptaan langit, Allah membentangkan bumi, mengeluarkan air dari dalam perutnya, menumbuhkan tanaman di permukaannya, dan menancapkan gunung-gunung padanya agar tidak berguncang. Seluruh kenikmatan ini adalah kenikmatan bagi kalian hingga waktu tertentu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. ءَأَنتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَآءُ ۚ (Apakah kamu lebih sulit penciptaanya ataukah langit?) Yakni apakah pembangkitan kalian setelah kematian menurut kalian lebih sulit daripada penciptaan langit yang merupakan benda yang sangat besar yang terdapat didalamnya berbagai hal yang menakjubkan yang sangat jelas?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Apakah penciptaanmu itu merupakan penciptaan yang paling sulit? Ataukah penciptaan langit yang lebih sulit, yang diciptakan dengan berbagai keseimbangan?” Pertanyaan ini dimaksudkan untuk mencela orang-orang yang ingkar terhadap hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah penciptaan kalian yang lebih hebat} lebih sulit {ataukah langit yang telah Dia bangun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(ayat 27-33) Allah berfirman menjelaskan petunjuk terang bagi mereka yang mengingkari hari kebangkitan dan yang menganggap mustahil pengembalian jasad oleh Allah, “Apakah kamu,” wahai manusia,”yang lebih sulit penciptaannya atau langit,” yang berbintang besar,makhluk kuat dan tinggi?” Allah telah membangunnya. Dia meninggikan bangunannya,” yaitu wujud dan bentuknya,” lalu menyempurnakannya” dengan mantap dan rapi,yang membuat akal kagum dan terperangah (amat menakjubkan).” dan Dia menjadikan malamnya gelap gulita,” yakni,menggelapkannya. Kegelapan menyelimuti seluruh penjuru langit sehingga membuat permukaan bumi menjadi gelap. “dan menjadikan siangnya terang bendearang,” yakni,menampakan cahaya besar padanya ketika matahari terbit. Manusia pun bertebaran untuk kepentingan-kepentingan agama dan dunia meraka. “dan bumi sesudah itu,” yaitu setelah penciptaan langit,”dihamparkanNya,” yakni Allah menempatkan di dalamnya berbagai manfaat. Hal itu dijelaskan dengan firmanNya, ”Ia memancarkan dari padanya mata airnya, dan (menumbuhkan)tumbuh – tumbuhannya. Dan gunung –gunung dipancangkanNya dengan teguh,” yakni dikokohkan dengan bumi sehingga bumi terhampar setelah penciptaan langit sebagaimana dijelaskan secara nash dalam ayat – ayat al Qur’an. Bumi diciptakan sebelum penciptaan langit sebagaimana disebutkan dalam firman Allah, ”Katakanlah, ‘Sesungguhnya patutkah kamu kafir kepada yang menciptakan bumi dalam dua masa dan kamu adakan sekutu – sekutu bagiNya? (yang bersifat)demikian itulah Rabb semesta alam. ‘ dan dia menciptakan di bumi itu gunung – gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan – makanan (penghuninya) dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang – orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi,’Datanglah kamu berdua menurut perintahKu dengan suka hati.’ Maka dia menjadikannya tujuh langit dalam dua masa dan Dia mewahyukan pada tiap – tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang – bintang yang cemerlang dan kami memelilharanya dengan sebaik – baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.” (fushshilat:9-12). Karena itu,Dzat yang menciptakan langit besar dengan berbagai cahaya dan gugusan yang ada, serta bumi berdebu lagi tebal serta berbagai kepentingan – kepentingan makhluk dan manfaat mereka di dalamnya, pasti mampu untuk membangkitakan manusia mukallaf lalu memberi balasan atas amal perbuatan mereka.Yang berbuat baik akan mendapatkan kebaikan dan yang berbuat buruk janganlah mencela siapapun kecuali dirinya sendiri. Karena itulah, selanjutnya Allah menyebutkan datangnya Hari Kiamat kemudian pembalasan seraya berfirman, “Maka apabila malapetaka yang sangat besar (Hari Kiamat) telah datang, pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya, dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat, adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sesungguhnya nerakalah tempat tinggal(nya). Dan adapun orang-orang yang takut kepada kebesaran Rabbnya dan menahan diri dari keinginan hawa nafsunya, maka sesungguhnya surgalah tempat tinggal(nya).” (An-Nazi’at: 34-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada ayat ini Allah mengatakan kepada orang-orang yang mengingkari kebangkitan yang mereka mejauh dari bahwasanya Allah akan menghidupkan kembali orang-orang yang telah mati, dan akan membangkitkan mereka setelah sebelumnya menjadi tulang-belulang yang hancur lebur, mereka mengingkari dan menolak akan hal ini, dikarenakan mereka tidak mengenal Allah dengan sebenar-benarnya, dan mereka juga tidak meyakini akan kekuasaan Allah diatas segala-galanya, Allah telah menyebutkan dalil-dalil serta bukti yang bekenaan dengan kebangkitan, dan kehidupan manusia setelah kematian, dan bagaimana Allah menciptakan bumi dan meninggikan langit diatasnya tanpa tiang, semua itu dapat terwujud dengan kuasa Allah, maka apakah Allah tidak bisa membangkitkan mereka yang telah mati yang merupakan peristiwa yang jauh lebih mudah bagi Allah untuk mewujudkannya ?! . Maka Allah berkata : { أَأَنْتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ ۚ بَنَاهَا } ( Apakah penciptaan kalian (wahai manusia) setelah kematian lebih sulit dari penciptaan langit ? ) , tentu langitlah yang lebih sulit penciptaannya, maka jika Allah mampu menciptakan sesuatu yang besar, maka sudah pasti dia mampu menciptakan sesuatu yang ringan dari itu, dan inilah bukti yang jelas, maka dari itu Allah mengatakan dalam ayat lain : { لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ } ( Sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia akan tetapi kebanyakan manusia tidak mengetahui. ) [ Ghafir : 57 ] dan di ayat ini Allah mengatakan { أَأَنْتُمْ أَشَدُّ خَلْقًا } wahai kalian yang mendustakan kebangkitan, apakah penciptaan langit lebih sulit dari kalian ? . Dan orang-orang yang berakal akan mengatakan : langit lebih sulit penciptaannya, dan mereka akan mengakui hal itu dan mengatakan : jikalau langit penciptaannya lebih sulit, dan Allah mampu melakukan hal itu, maka terlebih lagi Dia akan mampu menghidupkan yang telah mati . Kata { السَّمَاءُ ۚ } langit, pada dasarnya digunakan untuk segala sesuatu yang meninggi atau berada diatas, dan secara istilah terbagi menjadi dua bagian : ( السَمَاء المَبْنِيَّة ) yaitu langit yang tujuh yang Allah ciptakan. Dan langit lainnya yaitu segala sesuatu yang meninggi, sebagaimana yang Allah katakan : { وَهُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ مَاءً } ( Dan Dialah yang menurunkan air hujan dari langit, ) [ Al-An'am : 99 ] , kata langit disini berarti awan, disebut langit karena tempatnya berada diatas. Dan langit yang dimaksud dalam ayat ini adalah langit yang tujuh yang Allah bangun diatas bumi, Allah berfirman : { وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ , وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ } ( Dan langit itu Kami bangun dengan kekuasaan (Kami) dan sesungguhnya Kami benar-benar berkuasa , Dan bumi itu Kami hamparkan, maka sebaik-baik yang menghamparkan (adalah Kami). ) [ Az-Zariyat : 47-48 ] , inilah kuasa Allah, Dia meciptakan langit ini dengan kuasanya dan dengan keinginannya, serta menjadikannya tujuh tingkatan, yang saling bersusun diatas satu sama lainnya, dan disetiap antara dua langit adalah angkasa yang luas, dan atas langit yang paling tinggi ada air, dan diatas air ada kursi, dan diatas kursi itulah singgasana Allah 'azza wajalla."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَأَنْتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ “Apakah kalian (manusia) yang lebih sulit penciptaannya ataukah langit? Allah telah membangunnya,” Istifham (istilah kalimat tanya dalam bahasa arab) ini untuk menetapkan kepastian adanya kebangkitan, karena orang-orang musyrik mendustakan Nabi shallallaahu ‘alaihi wa sallam dalam perkara ini, mereka mengatakan: مَنْ يُحْيِ الْعِظَامَ وَهِيَ رَمِيمٌ “Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?” (QS. Yasin: 78) maka Allah ‘Azza Wa Jalla mengatakan: أَأَنْتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ “Apakah kalian (manusia) yang lebih sulit penciptaannya ataukah langit? Allah telah membangunnya” Jawaban ini tentu diketuhui setiap orang: Bahwa langit yang lebih berat, sebagaimana dalam firman Allah ‘Azza Wa Jalla: لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ “Sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia akan tetapi kebanyakan manusia tidak mengetahui.”(QS. Ghafir: 57) بَنَاهَا “Allah telah membangunnya,” Kalimat ini tidak ada kaitan dengan kalimat sebelumnya, oleh karenanya, hendaknya yang membaca, saat membacanya berhenti sejenak pada kalimat أَمِ السَّمَاءُ “ataukah langit” kemudian ia melanjutkannya dengan membaca بَنَاهَا “Allah telah membangunnya,” kalimat ini adalah kalimat isti’naafiyah (kalimat pengawal dalam bahasa arab) yang berfungsi sebagai penjelasan agungnya langit. بَنَاهَا Maknanya: Allah yang telah menciptakannya, dan Allah subhaanahu wa ta’ala telah menjelaskannya di dalam ayat yang lain di surat Adz-Dzariyat bahwa Dia menciptakannya dengan kekuatan: وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ “Dan langit itu Kami bangun dengan kekuatan (Kami)” (QS. Adz-Dzariyat: 47) maknanya: Dengan kekuatan, ada yang menyangka bahwa kata الأَيْدِ [al-Aydi] adalah bentuk jamak dari يَدٌ [Yadun] yang artinya tangan, padahal itu salah, yang benar adalah bahwa al-Aydi adalah masdar dari : آدَ-يَئِيْدُ [Aada- Yaiidu] yang berarti kekuatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 27: 27-29. Kemudian Allah menujukan firman-Nya kepada mereka para pendusta, para pengingkar. Allah berkata kepada mereka : Apakah membangkitkan kalian (pada hari kiamat) lebih susah (bagi-Ku) ataukah menjadikan sesuatu yang tidak ada menjadi ada dan wujud dalam pandangan kalian ? Ataukah penciptaan langit yang Aku ciptakan dan Aku tinggikan di atas kalian sebagaimana bangunan atasnya ? Tidak ada celah atasnya (yaitu langit) maupun retak padanya. Dan Kami jadikan pula menjulang tinggi dan rata secara sempurna sesuai perintah. Dan Kami jadikan malam gelap gulita dan siangnya bersinar dan bercahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menyebutkan dalil yang jelas kepada orang-orang yang mengingkari kebangkitan dan menganggap mustahil Allah akan menghidupkan kembali manusia yang telah mati dan menjadi tulang-belulang. Wahai orang yang mengingkari kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 27",
    "description": "Menjelaskan keperkasaan Allah dan kelemahan manusia, Allah berfrman, 'apakah penciptaan kamu yang lebih hebat ataukah langit yang telah dibangun-Nya' secara logika, penciptaan langit yang demikian luas tentu lebih sulit daripada penciptaan manusia. 28. Allah telah menciptakan langit. Dia telah meninggikan bangunannya sedemikian tinggi dan kukuh lalu dia menyempurnakannya sehingga tidak kamu jumpai di sana keretakan atau bentuk-bentuk cacat lainnya."
  }
]