[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-33. Apakah menurut kalian (wahai manusia),dibangkitkannya kalian sesudah kematian lebih berat daripada menciptakan langit? Allah menjunjung di atas kalian seperti bangunan,mengangkat di angkasa,tidak ada ketidak serasian padanya dan tidak pula ada retak. Allah menjadikan malamnya gelap dengan terpendamnya matahari,menjadikan siang terang dengan terbitnya matahari. Allah membentangkan bumi sesudah menciptakan langit,dan meletakan manfaat-manfaatnya di dalamnya. Dan Allah memancarkan dari dalamnya mata-mata air, dan menumbuhkan sesuatu yang bisa menjaganya dari tumbuh-tumbuhan. Dan menetapkan gunung-gunung sebagai patok-patoknya. Allah menciptakan seluruh nikmat nikmat ini bagi kalian dan ternak ternak kalian. Sesungguhnya menciptakan kalian kembali pada hari kiamat adalah lebih mudah bagi Allah daripada menciptakan semua ini, dan semuanya bagi Nya adalah mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Allah menjadikan malamnya gelap gulita jika mataharinya telah tenggelam, dan menjadikan siangnya terang bercahaya jika matahari telah terbit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَأَغْطَشَ لَيْلَهَا (dan Dia menjadikan malamnya gelap gulita) Yakni Allah menjadikannya gelap. وَأَخْرَجَ ضُحَىٰهَا (dan menjadikan siangnya terang benderang) Yakni Allah menampakkan siangnya diterangi oleh matahari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Allah menjadikan langit malam itu gelap gulita, dan langit siang terang benderang dengan pijar matahari. Adl-dluha berarti siang, yang bermakna asli awal siang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menjadikan gelap malamnya} Dia menjadikan gelap malamnya dengan tenggelamnya matahari {dan menampakkan siangnya} menampakkan cahayanya dengan terbitnya matahari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(ayat 27-33) Allah berfirman menjelaskan petunjuk terang bagi mereka yang mengingkari hari kebangkitan dan yang menganggap mustahil pengembalian jasad oleh Allah, “Apakah kamu,” wahai manusia,”yang lebih sulit penciptaannya atau langit,” yang berbintang besar,makhluk kuat dan tinggi?” Allah telah membangunnya. Dia meninggikan bangunannya,” yaitu wujud dan bentuknya,” lalu menyempurnakannya” dengan mantap dan rapi,yang membuat akal kagum dan terperangah (amat menakjubkan).” dan Dia menjadikan malamnya gelap gulita,” yakni,menggelapkannya. Kegelapan menyelimuti seluruh penjuru langit sehingga membuat permukaan bumi menjadi gelap. “dan menjadikan siangnya terang bendearang,” yakni,menampakan cahaya besar padanya ketika matahari terbit. Manusia pun bertebaran untuk kepentingan-kepentingan agama dan dunia meraka. “dan bumi sesudah itu,” yaitu setelah penciptaan langit,”dihamparkanNya,” yakni Allah menempatkan di dalamnya berbagai manfaat. Hal itu dijelaskan dengan firmanNya, ”Ia memancarkan dari padanya mata airnya, dan (menumbuhkan)tumbuh – tumbuhannya. Dan gunung –gunung dipancangkanNya dengan teguh,” yakni dikokohkan dengan bumi sehingga bumi terhampar setelah penciptaan langit sebagaimana dijelaskan secara nash dalam ayat – ayat al Qur’an. Bumi diciptakan sebelum penciptaan langit sebagaimana disebutkan dalam firman Allah, ”Katakanlah, ‘Sesungguhnya patutkah kamu kafir kepada yang menciptakan bumi dalam dua masa dan kamu adakan sekutu – sekutu bagiNya? (yang bersifat)demikian itulah Rabb semesta alam. ‘ dan dia menciptakan di bumi itu gunung – gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan – makanan (penghuninya) dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang – orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi,’Datanglah kamu berdua menurut perintahKu dengan suka hati.’ Maka dia menjadikannya tujuh langit dalam dua masa dan Dia mewahyukan pada tiap – tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang – bintang yang cemerlang dan kami memelilharanya dengan sebaik – baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.” (fushshilat:9-12). Karena itu,Dzat yang menciptakan langit besar dengan berbagai cahaya dan gugusan yang ada, serta bumi berdebu lagi tebal serta berbagai kepentingan – kepentingan makhluk dan manfaat mereka di dalamnya, pasti mampu untuk membangkitakan manusia mukallaf lalu memberi balasan atas amal perbuatan mereka.Yang berbuat baik akan mendapatkan kebaikan dan yang berbuat buruk janganlah mencela siapapun kecuali dirinya sendiri. Karena itulah, selanjutnya Allah menyebutkan datangnya Hari Kiamat kemudian pembalasan seraya berfirman, “Maka apabila malapetaka yang sangat besar (Hari Kiamat) telah datang, pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya, dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat, adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sesungguhnya nerakalah tempat tinggal(nya). Dan adapun orang-orang yang takut kepada kebesaran Rabbnya dan menahan diri dari keinginan hawa nafsunya, maka sesungguhnya surgalah tempat tinggal(nya).” (An-Nazi’at: 34-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Allah menjadikan malamnya gelap gulita, yakni kegelapan dimalam hari, { وَآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُمْ مُظْلِمُونَ } ( Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah malam; Kami tanggalkan siang dari malam itu, maka dengan serta merta mereka berada dalam kegelapan. ) [ Yaa Siin : 37 ] , malam yang gelap gulita Allah menjadikannya demikian demi kemaslahatan hambanya , yaitu agar mereka dapat beristirahat dan juga melindungi diri mereka, sebagaimana yang Allah katakan : { وَجَعَلْنَا اللَّيْلَ لِبَاسًا } ( Dan Kami jadikan malam sebagai pakaian, ) yakni sebagai pakaian yang menutupi dengan gelapnya . Dan Allah menjadikan siangnya terang benderang dengan cahaya matahari yang menyebar keseluruh penjuru bahkan menembus gua-gua yang sempit, sehingga teranglah dunia ini demi kemaslahatan manusia, maka dari itu Allah mengatakan : { قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ , قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ } ( Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?” , Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?” ) [ Al-Qashas : 71-72 ]. Allah menyebut pendengaran dan diikuti setelahnya malam, karena pada hari pendegaran akan jauh lebih jelas, dan pada saat itu penglihatan akan menjadi berkurang, maka kamu tidak melihat melainkan kamu hanya mendengar, kemudian Allah menyebut waktu siang dan bersamanya Allah meneyebut penglihatan, dan itu dikarenakan pada siang hari mata akan berkuasa sehingga dapat melihat dengan jelas, semua ini dapt terjadi dengat kuasa Allah 'azza wajallaa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَغْطَشَ لَيْلَهَا وَأَخْرَجَ ضُحَاهَا (29) “dan Dia menjadikan malamnya gelap gulita dan menjadikan siangnya terang benderang.” Maknanya: Allah jadikan gelap.oleh karenanya malam itu gelap. Allah Ta’ala berfirman: وَجَعَلْنَا اللَّيْلَ وَالنَّهَارَ آيَتَيْنِ فَمَحَوْنَا آيَةَ اللَّيْلِ وَجَعَلْنَا آيَةَ النَّهَارِ مُبْصِرَةً “Dan Kami jadikan malam dan siang sebagai dua tanda, lalu Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang,”(QS. Al-Isra: 12) وَأَخْرَجَ ضُحَاهَا Allah terangkan dengan matahari yang keluar dari tempat terbitnya dan tenggelam ke arah barat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 29: 27-29. Kemudian Allah menujukan firman-Nya kepada mereka para pendusta, para pengingkar. Allah berkata kepada mereka : Apakah membangkitkan kalian (pada hari kiamat) lebih susah (bagi-Ku) ataukah menjadikan sesuatu yang tidak ada menjadi ada dan wujud dalam pandangan kalian ? Ataukah penciptaan langit yang Aku ciptakan dan Aku tinggikan di atas kalian sebagaimana bangunan atasnya ? Tidak ada celah atasnya (yaitu langit) maupun retak padanya. Dan Kami jadikan pula menjulang tinggi dan rata secara sempurna sesuai perintah. Dan Kami jadikan malam gelap gulita dan siangnya bersinar dan bercahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga manusia dapat bertebaran di bumi untuk maslahat agama dan dunia mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 29",
    "description": "Dan dia menjadikan malamnya gelap gulita, dan menjadikan siangnya terang benderang. Dia menyediakan malam sebagai waktu beristirahat dan siang sebagai waktu bekerja. Penciptaan siang dan malam bukan perkara mudah, melainkan melalui mekanisme yang amat rumit dalam pandangan manusia. 30. Dan setelah penciptaan langit itu bumi dia hamparkan sebagai tempat tinggal yang nyaman bagi manusia dan makhluk lainnya."
  }
]