[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan para malaikat yang mencabut nyawa orang orang kafir dengan keras, Para malaikat yang mencabut nyawa orang orang beriman dengan semangat dan lembut, Para malaikat yang melayang saat turun dari langit dan naik ke langit, Para malaikat yang berlomba melaksanakan perintah Allah dengan segera, Para malaikat yang melaksankan perintah-perintah tuhan mereka terkait dengan tugas yang mereka emban dalam mengatur alam semesta, dan tidak boleh bagi makhluk untuk bersumpah dengan selain penciptanya,dan barang siapa melakukannya,maka dia berbuat syirik, Makhluk-makhluk pasti dibangkitkan dan dihisab pada hari yang bumi berguncang karena tiupan sangkakala pertama,yaitu tiupan kematian, Yang diikuti dengan tiupan kedua untuk kebangkitan kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan Allah bersumpah dengan dengan malaikat yang turun dari langit dengan cepat menuju bumi karena perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالسّٰبِحٰتِ (dan (malaikat-malaikat) yang turun dari langit) Yakni para malaikat yang turun dari langit dengan bergegas untuk menjalankan perintah Allah, meluncur di udara seperti seorang perenang yang meluncur di air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Juga demi malaikat yang turun dari langit dengan cepat dengan perintah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi (malaikat) yang cepat (menunaikan tugas) dengan mudah} Aku bersumpah demi malaikat yang turun dari langit menuju bumi dengan perintah Allah dengan cepat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 1-5) Sumpah-sumpah dengan para malaikat mulia dan pekerjaan ini menunjukan sempurnanya ketundukan mereka pada perintah Allah dan cepatnya mereka dalam melaksanakannya. Kemungkinan yang menjadi obyek sumpah adalah pembalasan dan kebangkitan, dengan dalil setelahnya menyebutkan kondisi-kondisi hari kiamat. Dan kemungkinan juga obyek sumpah dan yang disumpahkan sama. Allah bersumpah atas para malaikat karena beriman kepada malaikat merupakan salah satu dari enam rukun iman dan karena menyebutkan pekerjaan mereka disini mencakup balasan yang diemban oleh para malaikat pada saat kematian, sebelum dan sesudahnya. Allah berfirman, “Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras,” mereka adalah para malaikat yang mencabut nyawa dengan sekeras-kerasnya dan kencang dalam mencabutnya hingga ruh keluar dari raga, supaya diberi balasan atas amal perbuatannya. “Dan demi malaikat-malaikat yang mencabut nyawa dengan lemah lembut,” mereka juga para malaikat yang menabut ruh dengan kuat dan giat. Atau yang dimaksudkan dengan lemah lembut adalah bagi ruh orang-orang mukmin seadngkan cabutan keras berlaku bagi orang-orang kafir. “Dan demi malaikat-malaikat yang turun dari langit dengan cepat,”nyaitu para malaikat yang turun nahik di udara. “Dan demi malaikat-malaikat yang mendahului,” malaikat lainnya, “dengan kencang,”segera menunaikan perintah Allah dan mendahului para setan dalam menyampaikan wahyu kepada para rasul agar tidak dicuri. “ Dan demi malaikat-malaikat yang mengatur urusan dunia,” yakni, para malaikat yang ditugaskan oleh Allah untuk mengatur berbagai urusan alam atas dan alam bawah, seperti hujan, tumbuh-tumbuhan, angin, laut, janin, hewan, surga, neraka, dan tugas lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Adalah para malaikat yang bertasbih saat naik ke langit dan turun dari langit, naik untuk menghadap kepada Allah, dan turun dari langit menuju bumi dengan perintah Allah. Kata { سَبْحًا } adalah kata penekanan atau penegasan bahwa itu benar-benar terjadi, begitupun dengan kata-kata penekanan sebelumnya : { غَرْقاً } , {نَشْطاً } ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالسَّابِحَاتِ سَبْحًا “dan (malaikat-malaikat) yang turun dari langit dengan cepat,” Mereka adalah malaikat yang beredar dengan perintah Allah Subhaanahu wa Ta’ala. Maknanya ia beredar dengan capat bagai perenang yang berenang dengan cepat dalam air, sebagaimana dalam firman-Nya tentang matahari, bulan, malam dan siang: كُلٌّ فِي فَلَكٍ يَسْبَحُونَ “Masing-masing dari keduanya itu beredar di dalam garis edarnya. ” (QS. Al-Anbiya: 33) Maknanya: Itu semua beredar dengan perintah Allah ‘Azza Wa Jalla sesuai kehendak Allah Subhaanahu wa Ta’ala, Para malaikat lebih kuat daripada jin dan jin lebih kuat dari pada manusia, perhatikanlah firman Allah tentang Sulaiman: (38) قَالَ عِفْرِيتٌ مِنَ الْجِنِّ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ تَقُومَ مِنْ مَقَامِكَ وَإِنِّي عَلَيْهِ لَقَوِيٌّ أَمِينٌ (39) قَالَ الَّذِي عِنْدَهُ عِلْمٌ مِنَ الْكِتَابِ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ “Hai pembesar-pembesar, siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri\". Berkata 'Ifrit (yang cerdik) dari golongan jin: \"Aku akan datang kepadamu dengan membawa singgasana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat untuk membawanya lagi dapat dipercaya\" Berkatalah seorang yang mempunyai ilmu dari Al Kitab: \"Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip” Maksudnya: Jika anda melepaskan pandangan anda kemudian anda kembalikan, kemudian dikatakan kembali lagi kepadamu maka aku akan mendatangkannya seketika (sekejap mata) فَلَمَّا رَآهُ مُسْتَقِرًّا عِنْدَهُ “Maka tatkala Sulaiman melihat singgasana itu terletak di hadapannya” pada saat itu ia melihatnya ada di sisinya: قَالَ هَذَا مِنْ فَضْلِ رَبِّي لِيَبْلُوَنِي أَأَشْكُرُ أَمْ أَكْفُرُ “Ini termasuk kurnia Rabbku untuk mencoba aku apakah aku bersyukur atau mengingkari (akan nikmat-Nya).”(QS. AN-Naml: 38-40) Para Ulama mengatakan: Yang membawa singgasana bilqis adalah malaikat, sehingga mampu membawanya kepada sulaiman dari yaman, sedangkan sulaiman berada di syam, dengan sekejap. Maka ini menunjukkan bahwa kekuatan malaikat melebihui kekuatan jin, dan jin lebih kuat dari pada anak Adam. Karena tidak ada seorang pun dari anak adam yang mampu membawa singgasana kaum saba dari yaman menuju syam melainkan dengan waktu yang panjang, maka kesimpulannya bahwa malaikat beredar atas dasar perintah Allah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 3: 1-5. Surat ini dimulai dengan penyebutan banyak sumpah, yaitu Allah bersumpah dengan malaikat-malaikat yang mencabut ruh-ruh orang kafir, kemudian bersumpah dengan malaikat-malaikat yang menggenggam ruh-ruh orang-orang beriman. Dan Allah bersumpah dengan malaikat yang di tempatkan di ufuk langit-langit dunia, yang mereka senantiasa bertasbih di langit dan turun dengan perintah Rabb-nya beserta petunjuk dari-Nya. Allah bersumpah pula dengan malaikat-malaikat yang berlomba-lomba satu sama lain di antara mereka dalam mentadabburi perintah dari Rabb-Nya. Bersumpah pula (Allah), atas malaikat-malaikat-Nya yang mentadabburi urusan-urusan alam dengan perintah dari Allah Ta’ala. Dan jawaban dari sumpah-sumpah tersebut adalah bahwasanya hari kiamat adalah suatu kebenaran, dan sungguh mereka semua (wahai sekalian manusia !), kalian akan dibangkitkan dan akan di hisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang menafsirkan dengan malaikat yang terbang di udara naik dan turun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 3",
    "description": "1-5. Allah memulai surah ini dengan sumpah demi malaikat yang diberinya tugas berat. Di antara tujuannya adalah agar manusia menghayati peran-peran tersebut dalam kehidupan. Demi malaikat yang mencabut nyawa kaum kafir dengan keras dan kasar sebagai tanda kegeraman para malaikat itu terhadap mereka. Demi malaikat yang mencabut nyawa orang mukmin dengan halus dan lemah lembut sebagai tanda simpati para malaikat itu kepada mereka. Malaikat mencabut nyawa mereka sambil berkata, 'wahai jiwa yang tenang, kembalilah ke tuhanmu dengan hati yang rida dan diridai-Nya. ' demi malaikat yang turun dari langit dengan cepat untuk melaksanakan tugas dari Allah sembari selalu bertasbih menyucikan Allah dan mengagungkannya sepanjang waktu, dan demi malaikat yang mendahului yang lain dengan kencang, cepat, dan cekatan untuk melakukan tugas-tugasnya tanpa mengulur waktu, dan demi malaikat yang mengatur urusan dunia, seperti pengisaran angin, turunnya hujan, dan sebagainya sesuai perintah Allah"
  }
]