[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-33. Apakah menurut kalian (wahai manusia),dibangkitkannya kalian sesudah kematian lebih berat daripada menciptakan langit? Allah menjunjung di atas kalian seperti bangunan,mengangkat di angkasa,tidak ada ketidak serasian padanya dan tidak pula ada retak. Allah menjadikan malamnya gelap dengan terpendamnya matahari,menjadikan siang terang dengan terbitnya matahari. Allah membentangkan bumi sesudah menciptakan langit,dan meletakan manfaat-manfaatnya di dalamnya. Dan Allah memancarkan dari dalamnya mata-mata air, dan menumbuhkan sesuatu yang bisa menjaganya dari tumbuh-tumbuhan. Dan menetapkan gunung-gunung sebagai patok-patoknya. Allah menciptakan seluruh nikmat nikmat ini bagi kalian dan ternak ternak kalian. Sesungguhnya menciptakan kalian kembali pada hari kiamat adalah lebih mudah bagi Allah daripada menciptakan semua ini, dan semuanya bagi Nya adalah mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dari dalam bumi Allah mengeluarkan air, berupa mata air yang mengalir dan menghidupkan di permukaan bumi berbagai tumbuhan yang menjadi makanan hewan ternak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. أَخْرَجَ مِنْهَا مَآءَهَا وَمَرْعَىٰهَا (Ia memancarkan daripadanya mata airnya, dan (menumbuhkan) tumbuh-tumbuhannya) Yakni Allah mengalirkan sungai dan mata air dari tanah, kemudian mengeluarkan tumbuh-tumbuhan yang dipakai untuk menggembala ternak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Allah menjadikan sumber air dan sungai mencurah dari atas bumi, kemudian Allah menumbuhkan berbagai tumbuhan dan pepohonan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Darinya Dia mengeluarkan air dan tempat penggembalaan} dia menumbuhkan tanaman yang bisa digunakan untuk memelihara makhluk melata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(ayat 27-33) Allah berfirman menjelaskan petunjuk terang bagi mereka yang mengingkari hari kebangkitan dan yang menganggap mustahil pengembalian jasad oleh Allah, “Apakah kamu,” wahai manusia,”yang lebih sulit penciptaannya atau langit,” yang berbintang besar,makhluk kuat dan tinggi?” Allah telah membangunnya. Dia meninggikan bangunannya,” yaitu wujud dan bentuknya,” lalu menyempurnakannya” dengan mantap dan rapi,yang membuat akal kagum dan terperangah (amat menakjubkan).” dan Dia menjadikan malamnya gelap gulita,” yakni,menggelapkannya. Kegelapan menyelimuti seluruh penjuru langit sehingga membuat permukaan bumi menjadi gelap. “dan menjadikan siangnya terang bendearang,” yakni,menampakan cahaya besar padanya ketika matahari terbit. Manusia pun bertebaran untuk kepentingan-kepentingan agama dan dunia meraka. “dan bumi sesudah itu,” yaitu setelah penciptaan langit,”dihamparkanNya,” yakni Allah menempatkan di dalamnya berbagai manfaat. Hal itu dijelaskan dengan firmanNya, ”Ia memancarkan dari padanya mata airnya, dan (menumbuhkan)tumbuh – tumbuhannya. Dan gunung –gunung dipancangkanNya dengan teguh,” yakni dikokohkan dengan bumi sehingga bumi terhampar setelah penciptaan langit sebagaimana dijelaskan secara nash dalam ayat – ayat al Qur’an. Bumi diciptakan sebelum penciptaan langit sebagaimana disebutkan dalam firman Allah, ”Katakanlah, ‘Sesungguhnya patutkah kamu kafir kepada yang menciptakan bumi dalam dua masa dan kamu adakan sekutu – sekutu bagiNya? (yang bersifat)demikian itulah Rabb semesta alam. ‘ dan dia menciptakan di bumi itu gunung – gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan – makanan (penghuninya) dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang – orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi,’Datanglah kamu berdua menurut perintahKu dengan suka hati.’ Maka dia menjadikannya tujuh langit dalam dua masa dan Dia mewahyukan pada tiap – tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang – bintang yang cemerlang dan kami memelilharanya dengan sebaik – baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.” (fushshilat:9-12). Karena itu,Dzat yang menciptakan langit besar dengan berbagai cahaya dan gugusan yang ada, serta bumi berdebu lagi tebal serta berbagai kepentingan – kepentingan makhluk dan manfaat mereka di dalamnya, pasti mampu untuk membangkitakan manusia mukallaf lalu memberi balasan atas amal perbuatan mereka.Yang berbuat baik akan mendapatkan kebaikan dan yang berbuat buruk janganlah mencela siapapun kecuali dirinya sendiri. Karena itulah, selanjutnya Allah menyebutkan datangnya Hari Kiamat kemudian pembalasan seraya berfirman, “Maka apabila malapetaka yang sangat besar (Hari Kiamat) telah datang, pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya, dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat, adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sesungguhnya nerakalah tempat tinggal(nya). Dan adapun orang-orang yang takut kepada kebesaran Rabbnya dan menahan diri dari keinginan hawa nafsunya, maka sesungguhnya surgalah tempat tinggal(nya).” (An-Nazi’at: 34-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ayat ini menafsirkan maksud dari ayat sebelumnya { وَالْأَرْضَ بَعْدَ ذَٰلِكَ دَحَاهَا }, yaitu Pertama-tama Allah menciptakan bumi sebelum menciptakan langit, kemudian Dia menciptakan langit dan bersemayam diatasnya, kemudian setelah penciptaan langit Allah kemudian menghamparkan bumi (menghidupkannya), sebagaimana yang terdapat dalam surat ( Fussilat ) dan peroses penciptaan langit dan bumi berlangsung selama 6 hari, Allah mengatakan dalam AL-Qur'an : { إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ } ( Sesungguhnya Tuhan kamu ialah Allah yang telah menciptakan langit dan bumi dalam enam masa, ) mulai dari hari ahad dan berakhir pada hari jum'at, dan tidak menggenapkannya sampai hari sabtu, oleh karena itu orang - orang yahudi berkata : sesungguhnya Tuhan orang islam beristirahat pada hari sabtu, merasa letih dan beristirahat pada hari sabtu, akan tetapi Allah berkata : { وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ } ( Dan sesungguhnya telah Kami ciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, dan Kami sedikitpun tidak ditimpa keletihan. ) [ Qaf : 38 ] maka ayat ini adalah bantahan terhadap apa yang dikatakan oleh orang-orang yahudi , dan Allah juga mengatakan : { إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ } ( Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya: “Jadilah!” maka terjadilah ia. ) [ Yaa Siin : 82 ] , Sungguh Allah tidak akan letih sebagaimana yang dikatakan oleh Yahudi, bahwasanya Allah merasa letih dan menjadikan hari sabtu untuk beristirahat . { أَخْرَجَ مِنْهَا مَاءَهَا } Dan Allah mengeluarkan air dari dalam bumi ( tanah ) , yaitu dari mata air yang menampung air dengan jumlah yang sangat besar, Allah berfirman : { وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَسْكَنَّاهُ فِي الْأَرْضِ } ( Dan Kami turunkan air dari langit menurut suatu ukuran; lalu Kami jadikan air itu menetap di bumi, ) [ Al-Mu'minun : 18 ] Allah menyimpan air itu didalam bumi untuk kebutuhan manusia, dan Allah juga menyimpan didalam bumi itu berbagai macam mineral baik yang cair maupun yang padat, semua hanya untuk kemaslahatan ummat manusia, Allah mengeluarkan air dari bumi untuk kalian minum darinya dan untuk kalian mengairi tumbuh-tumbuhan yang kalian tanam, bagitupun dengan buah-buahan, hewan ternak yang kalian pelihara, semuanya membutuhkan air sebagaimana kalian membutukannya. { وَمَرْعَاهَا } Dia mengeluarkan tumbuhan dari tanah untuk kepentingan manusia dan hewan ternak agar tumbuhan itu diairi dengan air yang keluar dari bumi pula , inilah yang dimaksud dengan menghamparkan bumi, { وَالْأَرْضَ بَعْدَ ذَٰلِكَ دَحَاهَا } dan bukanlah maksud dari ( بَعْدَ ) adalah penciptaan bumi setelah penciptaan langit, melainkan Allah menghamparkan ( menghidupkan ) bumi setelah Ia menciptakan langit, adapun penciptaan bumi adalah sebelum penciptaan langit, Allah berfirmn : { قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ۚ ذَٰلِكَ رَبُّ الْعَالَمِينَ , وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ , ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ , فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا ۚ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ } ( Katakanlah: “Sesungguhnya patutkah kamu kafir kepada Yang menciptakan bumi dalam dua masa dan kamu adakan sekutu-sekutu bagi-Nya? (Yang bersifat) demikian itu adalah Rabb semesta alam”. 9 , Dan dia menciptakan di bumi itu gunung-gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan-makanan (penghuni)nya dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya. 10 , Kemudian Dia menuju kepada penciptaan langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: “Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa”. Keduanya menjawab: “Kami datang dengan suka hati”. 11 , Maka Dia menjadikannya tujuh langit dalam dua masa. Dia mewahyukan pada tiap-tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang-bintang yang cemerlang dan Kami memeliharanya dengan sebaik-baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui. 12 ) [ Fussilat : 9 - 12 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Hamparan ini Allah jelaskan dengan firman-Nya أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَا (31) “Ia memancarkan daripadanya mata airnya dan (menumbuhkan) tumbuh-tumbuhannya.” Bumi telah diciptakan sebelum langit, sebagaimana dalam firman Allah Ta’ala: قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ذَلِكَ رَبُّ الْعَالَمِينَ (9) وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ (10) ثُمَّ اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ (11) فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْن \"Katakanlah: \"Sesungguhnya patutkah kamu kafir kepada Yang menciptakan bumi dalam dua masa dan kamu adakan sekutu-sekutu bagi-Nya? (Yang bersifat) demikian itulah Tuhan semesta alam\"Dan Dia menciptakan di bumi itu gunung-gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan-makanan (penghuni) nya dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: \"Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati\" Maka Dia menjadikannya tujuh langit dalam dua hari\" (QS. Fussilat: 9-12) Dari sini dijelaskan bahwa Bumi tercipta sebelum langit, namun bumi dihamparkan, mengeluarkan air, dan tumbuh tumbuhan setelah terciptanya langit."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 31: 30-32. Setelah Allah ciptakan langit dan bumi di mana terhampar dan rata untuk mereka tinggal, Allah juga keluarkan (di bumi) mata air serta tumbuh-tumbuhan yang menjadi konsumsi bagi manusia dan binatang. Setelah itu semua, Allah ciptakan gunung yang menjadikan kokoh bumi, Allah menjadikannya sebagaimana pasak agar stabil dan untuk tempat tinggal (makhluk-Nya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 31",
    "description": "Dia hamparkan bumi dan darinya dia pancarkan mata air dan dia tumbuhkan tumbuh-tumbuhannya untuk memenuhi kebutuhan konsumsi makhluk hidup di sana. 32. Dan di bumi itu gunung-gunung dia pancangkan dengan teguh agar bumi tidak bergoncang sehingga bisa ditempati dengan nyaman."
  }
]