[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-33. Apakah menurut kalian (wahai manusia),dibangkitkannya kalian sesudah kematian lebih berat daripada menciptakan langit? Allah menjunjung di atas kalian seperti bangunan,mengangkat di angkasa,tidak ada ketidak serasian padanya dan tidak pula ada retak. Allah menjadikan malamnya gelap dengan terpendamnya matahari,menjadikan siang terang dengan terbitnya matahari. Allah membentangkan bumi sesudah menciptakan langit,dan meletakan manfaat-manfaatnya di dalamnya. Dan Allah memancarkan dari dalamnya mata-mata air, dan menumbuhkan sesuatu yang bisa menjaganya dari tumbuh-tumbuhan. Dan menetapkan gunung-gunung sebagai patok-patoknya. Allah menciptakan seluruh nikmat nikmat ini bagi kalian dan ternak ternak kalian. Sesungguhnya menciptakan kalian kembali pada hari kiamat adalah lebih mudah bagi Allah daripada menciptakan semua ini, dan semuanya bagi Nya adalah mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan gunung-gunung dijadikan-Nya kokoh di atas bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَالْجِبَالَ أَرْسَىٰهَا (Dan gunung-gunung dipancangkan-Nya dengan teguh) Allah menjadikannya sebagai pasak bagi bumi aagar tidak menggoncang penghuninya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Allah mengkokohkan gunung layaknya pasak, agar bumi tidak bergoncang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Gunung-gunung Dia memancangkannya dengan kokok} mengokohkannya di bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(ayat 27-33) Allah berfirman menjelaskan petunjuk terang bagi mereka yang mengingkari hari kebangkitan dan yang menganggap mustahil pengembalian jasad oleh Allah, “Apakah kamu,” wahai manusia,”yang lebih sulit penciptaannya atau langit,” yang berbintang besar,makhluk kuat dan tinggi?” Allah telah membangunnya. Dia meninggikan bangunannya,” yaitu wujud dan bentuknya,” lalu menyempurnakannya” dengan mantap dan rapi,yang membuat akal kagum dan terperangah (amat menakjubkan).” dan Dia menjadikan malamnya gelap gulita,” yakni,menggelapkannya. Kegelapan menyelimuti seluruh penjuru langit sehingga membuat permukaan bumi menjadi gelap. “dan menjadikan siangnya terang bendearang,” yakni,menampakan cahaya besar padanya ketika matahari terbit. Manusia pun bertebaran untuk kepentingan-kepentingan agama dan dunia meraka. “dan bumi sesudah itu,” yaitu setelah penciptaan langit,”dihamparkanNya,” yakni Allah menempatkan di dalamnya berbagai manfaat. Hal itu dijelaskan dengan firmanNya, ”Ia memancarkan dari padanya mata airnya, dan (menumbuhkan)tumbuh – tumbuhannya. Dan gunung –gunung dipancangkanNya dengan teguh,” yakni dikokohkan dengan bumi sehingga bumi terhampar setelah penciptaan langit sebagaimana dijelaskan secara nash dalam ayat – ayat al Qur’an. Bumi diciptakan sebelum penciptaan langit sebagaimana disebutkan dalam firman Allah, ”Katakanlah, ‘Sesungguhnya patutkah kamu kafir kepada yang menciptakan bumi dalam dua masa dan kamu adakan sekutu – sekutu bagiNya? (yang bersifat)demikian itulah Rabb semesta alam. ‘ dan dia menciptakan di bumi itu gunung – gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan – makanan (penghuninya) dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang – orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi,’Datanglah kamu berdua menurut perintahKu dengan suka hati.’ Maka dia menjadikannya tujuh langit dalam dua masa dan Dia mewahyukan pada tiap – tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang – bintang yang cemerlang dan kami memelilharanya dengan sebaik – baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.” (fushshilat:9-12). Karena itu,Dzat yang menciptakan langit besar dengan berbagai cahaya dan gugusan yang ada, serta bumi berdebu lagi tebal serta berbagai kepentingan – kepentingan makhluk dan manfaat mereka di dalamnya, pasti mampu untuk membangkitakan manusia mukallaf lalu memberi balasan atas amal perbuatan mereka.Yang berbuat baik akan mendapatkan kebaikan dan yang berbuat buruk janganlah mencela siapapun kecuali dirinya sendiri. Karena itulah, selanjutnya Allah menyebutkan datangnya Hari Kiamat kemudian pembalasan seraya berfirman, “Maka apabila malapetaka yang sangat besar (Hari Kiamat) telah datang, pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya, dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat, adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sesungguhnya nerakalah tempat tinggal(nya). Dan adapun orang-orang yang takut kepada kebesaran Rabbnya dan menahan diri dari keinginan hawa nafsunya, maka sesungguhnya surgalah tempat tinggal(nya).” (An-Nazi’at: 34-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ketika Allah menciptakan bumi - dan bumi itu diciptakan diatas air ( lautan ) - seakan akan bumi ini terombang ambing di ombak yang besar, kemudian Allah menciptakan gunung dan menjadikannya patok-patok bagi bumi sehingga bumi itu menjadi kokoh, agar tidak lagi terombang ambing dan berguncang, dan akhirnya bumi ini menjadi tenang dan siapapun yang tinggal diatasnya akan merasa aman."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْجِبَالَ أَرْسَاهَا : “Dan gunung-gunung dipancangkan-Nya dengan teguh,” Allah menjadikan gunung-gunung kokoh di bumi, tidak dapat terhempas angin seberapa pun kuatnya angin, juga mengokohkan bumi agar menggoncang manusia sebagaimana Allah berfirman: وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُم “Dan Dia menancapkan gunung-gunung di bumi supaya bumi itu tidak guncang bersama kamu,” (QS. An-Nahl: 15)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 32: 30-32. Setelah Allah ciptakan langit dan bumi di mana terhampar dan rata untuk mereka tinggal, Allah juga keluarkan (di bumi) mata air serta tumbuh-tumbuhan yang menjadi konsumsi bagi manusia dan binatang. Setelah itu semua, Allah ciptakan gunung yang menjadikan kokoh bumi, Allah menjadikannya sebagaimana pasak agar stabil dan untuk tempat tinggal (makhluk-Nya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan demikian, Tuhan yang mampu menciptakan langit yang besar dan kuat serta benda-benda langit yang ada di dalamnya, demikian pula yang menciptakan bumi serta segala kebutuhan makhluk dan berbagai manfaat bagi mereka, pasti mampu membangkitkan makhluk setelah mereka mati, kemudian Dia akan memberikan balasan terhadap amal mereka, maka barang siapa yang berbuat baik, dia akan mendapatkan surga, sebaliknya barang siapa yang berbuat buruk, maka janganlah ia cela selain dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 32",
    "description": "Dan di bumi itu gunung-gunung dia pancangkan dengan teguh agar bumi tidak bergoncang sehingga bisa ditempati dengan nyaman. 33. Allah menciptakan itu semua untuk kesenanganmu dan untuk hewan-hewan ternakmu. Kamu bisa hidup di bumi dengan memanfaatkan apa yang ada, sebagai bukti kasih sayang Allah yang tak terhingga."
  }
]