[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-33. Apakah menurut kalian (wahai manusia),dibangkitkannya kalian sesudah kematian lebih berat daripada menciptakan langit? Allah menjunjung di atas kalian seperti bangunan,mengangkat di angkasa,tidak ada ketidak serasian padanya dan tidak pula ada retak. Allah menjadikan malamnya gelap dengan terpendamnya matahari,menjadikan siang terang dengan terbitnya matahari. Allah membentangkan bumi sesudah menciptakan langit,dan meletakan manfaat-manfaatnya di dalamnya. Dan Allah memancarkan dari dalamnya mata-mata air, dan menumbuhkan sesuatu yang bisa menjaganya dari tumbuh-tumbuhan. Dan menetapkan gunung-gunung sebagai patok-patoknya. Allah menciptakan seluruh nikmat nikmat ini bagi kalian dan ternak ternak kalian. Sesungguhnya menciptakan kalian kembali pada hari kiamat adalah lebih mudah bagi Allah daripada menciptakan semua ini, dan semuanya bagi Nya adalah mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Semua itu merupakan manfaat bagi kalian -wahai manusia- dan untuk hewan-hewan ternak kalian. Maka Żat yang menciptakan ini semua tidak akan kesulitan untuk mengulangi penciptaan mereka dari awal lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Allah menciptakan itu semua sebagai kenikmatan dan kemanfaatan bagi kalian semua dan juga bagi hewan ternak kalian, seperti onta, sapi atau kambing."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{untuk kesenangan kalian} bermanfaat bagi kalian {dan hewan ternak kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(ayat 27-33) Allah berfirman menjelaskan petunjuk terang bagi mereka yang mengingkari hari kebangkitan dan yang menganggap mustahil pengembalian jasad oleh Allah, “Apakah kamu,” wahai manusia,”yang lebih sulit penciptaannya atau langit,” yang berbintang besar,makhluk kuat dan tinggi?” Allah telah membangunnya. Dia meninggikan bangunannya,” yaitu wujud dan bentuknya,” lalu menyempurnakannya” dengan mantap dan rapi,yang membuat akal kagum dan terperangah (amat menakjubkan).” dan Dia menjadikan malamnya gelap gulita,” yakni,menggelapkannya. Kegelapan menyelimuti seluruh penjuru langit sehingga membuat permukaan bumi menjadi gelap. “dan menjadikan siangnya terang bendearang,” yakni,menampakan cahaya besar padanya ketika matahari terbit. Manusia pun bertebaran untuk kepentingan-kepentingan agama dan dunia meraka. “dan bumi sesudah itu,” yaitu setelah penciptaan langit,”dihamparkanNya,” yakni Allah menempatkan di dalamnya berbagai manfaat. Hal itu dijelaskan dengan firmanNya, ”Ia memancarkan dari padanya mata airnya, dan (menumbuhkan)tumbuh – tumbuhannya. Dan gunung –gunung dipancangkanNya dengan teguh,” yakni dikokohkan dengan bumi sehingga bumi terhampar setelah penciptaan langit sebagaimana dijelaskan secara nash dalam ayat – ayat al Qur’an. Bumi diciptakan sebelum penciptaan langit sebagaimana disebutkan dalam firman Allah, ”Katakanlah, ‘Sesungguhnya patutkah kamu kafir kepada yang menciptakan bumi dalam dua masa dan kamu adakan sekutu – sekutu bagiNya? (yang bersifat)demikian itulah Rabb semesta alam. ‘ dan dia menciptakan di bumi itu gunung – gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan – makanan (penghuninya) dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang – orang yang bertanya. Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi,’Datanglah kamu berdua menurut perintahKu dengan suka hati.’ Maka dia menjadikannya tujuh langit dalam dua masa dan Dia mewahyukan pada tiap – tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang – bintang yang cemerlang dan kami memelilharanya dengan sebaik – baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.” (fushshilat:9-12). Karena itu,Dzat yang menciptakan langit besar dengan berbagai cahaya dan gugusan yang ada, serta bumi berdebu lagi tebal serta berbagai kepentingan – kepentingan makhluk dan manfaat mereka di dalamnya, pasti mampu untuk membangkitakan manusia mukallaf lalu memberi balasan atas amal perbuatan mereka.Yang berbuat baik akan mendapatkan kebaikan dan yang berbuat buruk janganlah mencela siapapun kecuali dirinya sendiri. Karena itulah, selanjutnya Allah menyebutkan datangnya Hari Kiamat kemudian pembalasan seraya berfirman, “Maka apabila malapetaka yang sangat besar (Hari Kiamat) telah datang, pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya, dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat, adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia, maka sesungguhnya nerakalah tempat tinggal(nya). Dan adapun orang-orang yang takut kepada kebesaran Rabbnya dan menahan diri dari keinginan hawa nafsunya, maka sesungguhnya surgalah tempat tinggal(nya).” (An-Nazi’at: 34-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Untuk apa Allah menciptakan semua ciptaan ini ? Allah menciptakannya hanya untuk kemaslahatan kalian , itulah kasih sayang Allah untuk kalian. Juga untuk binatang ternak yang Allah ciptakan bagi kalian, seperti unta, sapi, dan domba, Allah menciptakan semua ini hanya untuk kemaslahatan bagi kalian, dan diantara binatang-binatan itu ada yang dapat kalian gunakan sebagai kendaraan, dan darinya juga kalian dapat mengambil susunya untuk kalian minum, dan dagingnya pun kalian bisa memakanya, bahkan dari bulu dan kulitnya memiliki manfaat besar bagi kalian, dan binatang-binatang itu pun menikmati apa yang cocok bagi tubuh mereka dari apa yang dikeluarkan oleh bumi, Allah menciptakan bagi mereka makan dan minum seperti Allah menciptakan juga untuk kalian, itulah kuasa dan kaih sayang Allah, Dialah Allah yang menciptakan segala sesuatu yang ada, dan menertibkanya sebaik mungkin, tidakkah Dia mampu untuk membangitkan kalian kembali setelah kalian mati ? Sesungguhnya hal itu lebih mudah bagi-Nya,."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ “(semua itu) untuk kesenanganmu dan untuk binatang-binatang ternakmu.” Maksudnya: Allah menjadikan itu semua sebagai nikmat yang bisa kita nikmati berupa yang kita makan dan minum. Juga untuk hewan ternak kita,seperti unta, sapi kambing dan hewan ternak lainnya, yang ada disekeliling kita dan bisa mengembangkan harta kita. Setelah Allah ‘Azza Wa Jalla mengingatka hamba-hamba-Nya tentang nikmat-nikmat yang menunjukkan kesempurnaan kuasa dan rahmat-Nya, kemudian Allah mengingatkan akan tempat kembali mereka yang pasti"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 33: Dan bagi setiap kenikmatan-kenikmatan yang telah Allah ciptakan, sesungguhnya Ia ciptakan sebagai manfaat bagi kalian. Kenikmatan itu semua untuk kalian yang kalian dapat bersenang-senang dengan apa yang ada di dalamnya dari yang baik-baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 33",
    "description": "Allah menciptakan itu semua untuk kesenanganmu dan untuk hewan-hewan ternakmu. Kamu bisa hidup di bumi dengan memanfaatkan apa yang ada, sebagai bukti kasih sayang Allah yang tak terhingga. 34-36. Maka apabila malapetaka besar hari kiamat telah datang dengan hancurnya alam semesta. Yaitu pada hari ketika manusia teringat akan apa yang telah dikerjakannya, yang selama ini mereka lupakan, baik berupa amal baik maupun buruk. Dan nanti di akhirat, neraka dengan segala siksaan yang sangat mengerikan di dalamnya akan diperlihatkan dengan jelas kepada setiap orang yang melihat."
  }
]