[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-36. Dan apabila hari kiamat kubra dengan kesulitannya yang berat telah tiba yang ditandai dengan tiupan sangkakala kedua, Saat itu diperlihatkan kepada manusia amal amalnya yang baik dan yang buruk,dia pun mengingatnya dan mengakuinya, Neraka jahanam ditampakan bagi setiap orang yang memandang yang dapat dilihat dengan mata kepala."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan jika telah tiba masa tiupan yang kedua dan hari Kiamat telah tiba."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-36. Jika telah datang kiamat yang mengandung berbagai peristiwa mengerikan, ketika itu akan ditunjukkan kepada manusia segala kebaikan dan keburukan yang telah dia kerjakan, sehingga dia dapat mengingatnya. Kemudian neraka Jahannam akan didatangkan dan ditampakkan kepada para makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. فَإِذَا جَآءَتِ الطَّآمَّةُ الْكُبْرَىٰ (Maka apabila malapetaka yang sangat besar (hari kiamat) telah datang) Yakni bencana besar yang mengalahkan segala bencana, yaitu tiupan kedua yang mengarahkan penduduk surga ke surga dan penduduk neraka ke neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Apabila malapetaka besar yaitu hari kiamat itu sudah tiba, hari ketika manusia mengingat semua amal baik dan buruknya di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila malapetaka terbesar telah datang} bencana yang besar yaitu tiupan yang kedua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 34-36) Maknanya, bila kiamat besar dan huru-hara besar telah tiba yang menyebabkan semua huru-hara lain menjadi kecil dibanding dengannya, pada saat itu, orang tua tidak lagi ingat anaknya, seseorang tidak lagi ingat pada temannya, semua orang yang mencintai tidak lagi ingat pada kekasih yang dicintainya, “manusia (hanya) teringat akan apa yang telah dikerjakannya,” baik dan buruknya selama di dunia. Masing-masing menghrapkan kebaikannya ditambah meski seberat biji atom. Manusia mengetahui kala itu bahwa modal keuntungan dan kerugiannya adalah perbuatan yang telah dilakukan semasa di dunia. Semua sebab dan ikatan di dunia terputus, kecuali amal perbuatan. “Dan diperlihatkan di neraka dengan jelas kepada setiap orang yang melihat,” yakni dijadikan jelas dan nyata bagi setiap orang. Telah disiapkan bagi penghuninya dan siap untuk menyambar mereka seraya menanti perintah Rabbnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah Allah menyebutkan berbagai kenikmatan dan keindahan dunia pada ayat-ayat sebelumnya, menjadi pertanyaan bagi kita, apakah semua itu akan terus berlanjut dan akan terus bertambah ataupun berkembang, apakah langit dan bumi akan terus ada ? tentunya tidak, sebagaimana yang Allah katakan pada ayat ini : { فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَىٰ } Dan apabila saatnya kiamat telah tiba, maka kehidupan dibumi ini akan berakhir, kiamat datang untuk menghancurkan segala-galanya, peristiwa yang sangat mengerikan yang belum pernah ada sebelumnya dan peristiwa inilah peristiwa kehancuran yang paling besar, semua yang ada dibumi akan musnah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah ‘Azza Wa Jalla berfirman: فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَى “Maka apabila malapetaka yang sangat besar telah datang.” Ini adalah terjadinya kiamat, disebut dengan Thaammah (malapetaka yang sangat besar.) karera ia adalah bencana besar yang membinasakan semua yang ada sebelumnya. Al-Kubra: maknanya: Lebih besar daripada semua bencana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 34: 34-36. Kemudian Allah kabarkan keadaan orang-orang yang sengsara pada hari kiamat; Allah berkata : Maka jika telah datang hari kiamat besar (wahai manusia !) dan bencana yang besar secara umum, ketahuilah bahwasanya itu adalah tiupan yang kedua. Pada hari itu kondisinya sangat menakutkan, manusia sibuk (atas pertanggung jawaban) urusannya yang telah berlalu (di dunia) dari yang buruk maupun yang baik. Dan ditampilkan amalan-amalannya untuk dibalas atas apa yang (mereka) amalkan di dunia. Pada hari itu, ahli surga mengetahui tempat-tempat tinggalnya masing-masing, dan ahli neraka mengetahui pula. Pada kondisi itu nampak neraka dan ditampakkan bagi orang-orang yang melihatnya. Dan bagi para pendosa, melihat (neraka) dengan mata kepalanya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu seorang ibu lalai terhadap anaknya, demikian pula kawan, ia juga lalai terhadap kawannya dan orang yang cinta juga lalai kepada kekasihnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 34",
    "description": "34-36. Maka apabila malapetaka besar hari kiamat telah datang dengan hancurnya alam semesta. Yaitu pada hari ketika manusia teringat akan apa yang telah dikerjakannya, yang selama ini mereka lupakan, baik berupa amal baik maupun buruk. Dan nanti di akhirat, neraka dengan segala siksaan yang sangat mengerikan di dalamnya akan diperlihatkan dengan jelas kepada setiap orang yang melihat"
  }
]