[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-36. Dan apabila hari kiamat kubra dengan kesulitannya yang berat telah tiba yang ditandai dengan tiupan sangkakala kedua, Saat itu diperlihatkan kepada manusia amal amalnya yang baik dan yang buruk,dia pun mengingatnya dan mengakuinya, Neraka jahanam ditampakan bagi setiap orang yang memandang yang dapat dilihat dengan mata kepala."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Pada hari di saat Kiamat tiba, manusia mengingat apa yang telah dilakukannya, yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Apabila malapetaka besar yaitu hari kiamat itu sudah tiba, hari ketika manusia mengingat semua amal baik dan buruknya di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{pada hari manusia teringat apa yang telah dia kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 34-36) Maknanya, bila kiamat besar dan huru-hara besar telah tiba yang menyebabkan semua huru-hara lain menjadi kecil dibanding dengannya, pada saat itu, orang tua tidak lagi ingat anaknya, seseorang tidak lagi ingat pada temannya, semua orang yang mencintai tidak lagi ingat pada kekasih yang dicintainya, “manusia (hanya) teringat akan apa yang telah dikerjakannya,” baik dan buruknya selama di dunia. Masing-masing menghrapkan kebaikannya ditambah meski seberat biji atom. Manusia mengetahui kala itu bahwa modal keuntungan dan kerugiannya adalah perbuatan yang telah dilakukan semasa di dunia. Semua sebab dan ikatan di dunia terputus, kecuali amal perbuatan. “Dan diperlihatkan di neraka dengan jelas kepada setiap orang yang melihat,” yakni dijadikan jelas dan nyata bagi setiap orang. Telah disiapkan bagi penghuninya dan siap untuk menyambar mereka seraya menanti perintah Rabbnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ketika peristiwa kiamat ( qubro ) terjadi, bagaimana dengan keadaan manusia ? { يَوْمَ يَتَذَكَّرُ الْإِنْسَانُ مَا سَعَىٰ } Pada hari itu manusia akan mengingat apa yang telah ia perbuat ketika ia hidup, kehidupan mereka ketika didunia, apakah hanya makan dan minum mereka, senang dan bahagiaan mereka yang akan mereka ingat ? kemudian setelah itu segala urusan selesai ?, tidak.. sesungguhnya mereka akan mengingat semua yang telah mereka lakukan ketika di dunia, akan di perlihatkan dihadapan mereka catatan amal yang telah mereka lakukan, amalan baik maupun buruk. semuanya akan nampak jelas dihadapan mereka, Allah mengatakan dalam ayat lain : { يَوْمَئِذٍ يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّىٰ لَهُ الذِّكْرَىٰ , يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي } ( dan pada hari itu ingatlah manusia, akan tetapi tidak berguna lagi mengingat itu baginya , Dia mengatakan: “Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini”. ) [ Al-Fajr : 23-24 ] yakni mereka ingat dengan perbuatan mereka ketika didunia. Oleh karena itu, kalian harus mempersiapkan diri untuk menghadapi peristiwa ini, karena sesungguhnya kalian pasti akan melewati peristiwa yang dahsyat ini, persiapkanlah diri kalian dari sekarang, dan janganlah kalian mengatakan : Demi Allah saya tidak mengetahuinya, saya lupa akan peristiwa ini, dan juga saya tidak pernah memperhitungkannya. Akan tetapi alasan itu tidak akan pernah diterima, karena sesungguhnya telah datang kepada kalian dengan sangat jelas petunjuk Allah yang Ia sampaikan lewat Al-Qur'an dan juga sunnah Nabi ﷺ , maka janganlah kalian melalaikannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ يَتَذَكَّرُ الْإِنْسَانُ مَا سَعَى : “Pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya,” Sungguh hari ini, yang terjadi bencana besar di dalamnya, itulah hari di mana manusia sadar pada apa saja yang telah ia upayakan yakni yang ia lakukan di dunia, ia akan sadar itu semua telah tertulis dalam catatan yang akan ia baca sendiri. Allah Ta’ala berfirman: وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنْشُورًا (13) اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا “Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka. \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.” (QS. Al-Israa: 13-14) Jika ia sudah membaca catatan miliknya itu barulah ia akan sadar apa yang telah ia perbuat, ada pun sekarang ini, terkadang kita terlupakan dengan apa yang telah kita perbuat, kita melakukan amalan-amalan, ada yang saleh, sia-sia bahkan ada yang buruk, namun itu semua kita lupakan, dan di hari kiamat kelak itu semua akan dihadapkan kepada kita dalam bentuk catatan, lalu dikatakan: Baca catatanmu sendiri كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا “cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.”(QS. Al-Isra: 14) saat itulah ia akan ingat apa-apa yang telah diperbuat وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ تُرَابًا “dan orang kafir berkata: \"Alangkah baiknya sekiranya aku dahulu adalah tanah”(QS. An-Naba: 40)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 35: 34-36. Kemudian Allah kabarkan keadaan orang-orang yang sengsara pada hari kiamat; Allah berkata : Maka jika telah datang hari kiamat besar (wahai manusia !) dan bencana yang besar secara umum, ketahuilah bahwasanya itu adalah tiupan yang kedua. Pada hari itu kondisinya sangat menakutkan, manusia sibuk (atas pertanggung jawaban) urusannya yang telah berlalu (di dunia) dari yang buruk maupun yang baik. Dan ditampilkan amalan-amalannya untuk dibalas atas apa yang (mereka) amalkan di dunia. Pada hari itu, ahli surga mengetahui tempat-tempat tinggalnya masing-masing, dan ahli neraka mengetahui pula. Pada kondisi itu nampak neraka dan ditampakkan bagi orang-orang yang melihatnya. Dan bagi para pendosa, melihat (neraka) dengan mata kepalanya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selama di dunia baik atau buruk. Pada hari itu, ia berangan-angan ditambah kebaikannya dan bersedih karena banyak keburukannya dan sedikit kebaikannya. Ia pun mengetahui bahwa sumber keberuntungan dan kerugiannya terletak pada apa yang dia usahakan ketika di dunia. Ketika itu, semua sebab dan hubungan yang terjalin di dunia terputus selain amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 35",
    "description": "34-36. Maka apabila malapetaka besar hari kiamat telah datang dengan hancurnya alam semesta. Yaitu pada hari ketika manusia teringat akan apa yang telah dikerjakannya, yang selama ini mereka lupakan, baik berupa amal baik maupun buruk. Dan nanti di akhirat, neraka dengan segala siksaan yang sangat mengerikan di dalamnya akan diperlihatkan dengan jelas kepada setiap orang yang melihat"
  }
]