[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-39. Barangsiapa membangkang terhadap perintah Allah, Dan mementingkan hidup di dunia atas hidup di akhirat, Maka tempat kembalinya adalah neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Adapun orang-orang yang telah melampaui batas dalam kesesatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-41. Allah menyebutkan tempat kesudahan kedua golongan. Adapun orang yang melanggar batas hingga bersikap angkuh dan kafir, dan lebih memilih kenikmatan dunia daripada kenikmatan akhirat, maka neraka jahim adalah tempat tinggalnya. Sedangkan orang yang takut berdiri di hadapan Allah untuk menjalani hisab, dan menahan hawa nafsunya yang ingin melakukan kemaksiatan, maka tempat tinggalnya adalah surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَأَمَّا مَن طَغَىٰ (Adapun orang yang melampaui batas) Yakni melampaui batas dalam kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37-38. Barangsiapa yang besar kepala dan melampaui batasan, sehingga dia menjadi kafir, lalu lebih mencintai dunia daripada akhirat dengan tidak mempersiapkan bekal untuk kehidupan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang yang melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 37-39) “Adapun orang yang melampaui batas,” yaitu mealnggar batas seraya berani menerjang maksiat-maksiat besar dan tidak mencukupkan diri pada batasan-batasan Allah “dan lebih mengutamakan kehidupan dunia,” daripada akhirat; usahanya akan tertuju pada dunia dan waktunya dihabiskan untuk bagian dan kepentingan dunia dengan melupakan akhirat dan berbuat untuknya, “maka sesungguhnya nerakalah tempat tinggal” baginya. Neraka menjadi tempat tinggal dan menetap bagi orang yang kondisinya seperti itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan ketika Neraka jahannam diperlihatkan, maka ketika itu manusia akan terbagi menjadi dua golongan : Golongan pertama adalah : { فَأَمَّا مَنْ طَغَىٰ } Dan barangsiapa yang membangkang terhadap Tuhanya ketika didunia, serta berlaku sombong kepada Allah dan Rasul-Nya, juga kepada manusia seluruhnya, ia telah melampaui batas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: فَأَمَّا مَنْ طَغَى (37) وَآثَرَ الْحَيَاةَ الدُّنْيَا (38) “Adapun orang yang melampaui batas, dan lebih mengutamakan kehidupan dunia,” Ini adalah dua sifat penghuni neraka: melampaui batas, dan mengedepankan dunia daripada akhirat. Keduanya sifat yang salign berhubungan satu dengan yang lainnya, siapa saja yang melampaui batas pasti lebih mementingkan kehidupandunia, begitupun sebaliknya. Batasan seorang insan telah disebutkan dalam firman Allah Ta’ala: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ “Dan Aku tidak menciptakan jin dan manusia melainkan supaya mereka menyembah-Ku.”(QS. Adz-Dzariyat: 56) siapa saja yang melampaui batasannya, dan tidak beribadah kepada Allah maka ia telah melampaui batas. Anda adalah ciptaan bukan sekedar untuk makan, menikmati, mersenang-senang seperti binatang ternak, namun anda diciptakan untuk beribadah kepada Allah ‘Azza Wa Jalla. Maka sembahlah Allah ‘Azza wa Jalla, jika anda tidak melakukan itu maka anda telah melampaui batas, inilah yang dimaksud dengan melampaui batas yaitu jika seorang insan tidak melakukan peribadatan kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 37: 37-39. Kemudian Allah jelaskan bagi siapa yang menghalalkan untuk menerobos batasan-batasan yang telah Allah tetapkan dan kufur kepada-Nya, serta bermaksiat kepada-Nya. Dampak dari (kesenangan) fana yang mereka lakukan di dunia; Allah kabarkan bahwasanya bagi mereka tempat tinggalnya adalah neraka jahannam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan berani melakukan dosa-dosa besar dan tidak berhenti terhadap batasan yang Allah tetapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 37",
    "description": "37-39. Di akhirat Allah akan memberi putusan kepada manusia, memisahkan mereka menjadi dua kelompok besar. Maka adapun orang yang melampaui batas dengan berlaku musyrik, kafir, dan maksiat, dan lebih mengutamakan kehidupan dunia daripada akhirat, maka sungguh, nerakalah tempat tinggalnya untuk waktu yang sangat lama. Inilah bukti keadilan Allah"
  }
]