[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-39. Barangsiapa membangkang terhadap perintah Allah, Dan mementingkan hidup di dunia atas hidup di akhirat, Maka tempat kembalinya adalah neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan mengutamakan kehidupan dunia yang fana ini atas kehidupan Akhirat yang abadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَءَاثَرَ الْحَيَوٰةَ الدُّنْيَا (dan lebih mengutamakan kehidupan dunia) Yakni lebih mementingkan dunia dari pada akhirat sehingga ia tidak menyiapkan kedatangannya dan tidak beramal untuknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37-38. Barangsiapa yang besar kepala dan melampaui batasan, sehingga dia menjadi kafir, lalu lebih mencintai dunia daripada akhirat dengan tidak mempersiapkan bekal untuk kehidupan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan lebih mengutamakan} dan mengutamakan {kehidupan dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 37-39) “Adapun orang yang melampaui batas,” yaitu mealnggar batas seraya berani menerjang maksiat-maksiat besar dan tidak mencukupkan diri pada batasan-batasan Allah “dan lebih mengutamakan kehidupan dunia,” daripada akhirat; usahanya akan tertuju pada dunia dan waktunya dihabiskan untuk bagian dan kepentingan dunia dengan melupakan akhirat dan berbuat untuknya, “maka sesungguhnya nerakalah tempat tinggal” baginya. Neraka menjadi tempat tinggal dan menetap bagi orang yang kondisinya seperti itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan lebih mementingkan kehidupan dunia dengan kenikmatannya, meghabiskan hidupnya untuk mengumpul semua harta dunia, dan melupakan bahwa ada akhirat yang jauh lebih penting yang harus ia persiapkan untuknya, ia tidak melakukan apapun untuk menghadapi kehidupan yang kekal di akhirat nanti, dan ketahuilah bahwa dunia ini akan pergi, dunia ini akan musnah beserta seluruh kenikmatan-kenikmatan yang ada didalamnya, akan tetapi untuk akhiratnya dia belum melakukan apapun, lalu bagaimana dengan nasib yang akan ia hadapi ? kerugianlah untuknya didunia maupun diakhirat { خَسِرَ الدُّنْيَا وَالْآخِرَةَ ۚ ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ } ( Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata. ) [ Al-Haj : 11 ] , mereka menuruti kemauan nafsunya didunia, dan menghabiskan hari-harinya serta siang dan malamnya hanya untuk menikmati hura-hura dunia, maka pada akhirnya mereka tidak akan mendapatkan apapun; melainkan Neraka Jahannamlah yang akan menjadi tempat kembali mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَآثَرَ الْحَيَاةَ الدُّنْيَا “dan lebih mengutamakan kehidupan dunia,”Maknanya lebih mementingkan kehidupan dunia daripada ketaatan kepada Allah ‘Azza Wa Jalla. Contohnya: Seseorang saat mendengar azan subuh,lebih mengutamakan tidur daripada shalat, dan jika dikatakan kepadanya: Berdzikirlah kepada Allah, ia lebih mengutamakan ucapan sia-sia daripada dzikir, dan begitu semisalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 38: 37-39. Kemudian Allah jelaskan bagi siapa yang menghalalkan untuk menerobos batasan-batasan yang telah Allah tetapkan dan kufur kepada-Nya, serta bermaksiat kepada-Nya. Dampak dari (kesenangan) fana yang mereka lakukan di dunia; Allah kabarkan bahwasanya bagi mereka tempat tinggalnya adalah neraka jahannam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Daripada akhirat, sehingga kerja kerasnya tertuju kepadanya, waktunya habis untuk memperoleh kesenangan dunia, lupa dengan akhirat dan tidak beramal untuknya, serta mengikuti hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 38",
    "description": "37-39. Di akhirat Allah akan memberi putusan kepada manusia, memisahkan mereka menjadi dua kelompok besar. Maka adapun orang yang melampaui batas dengan berlaku musyrik, kafir, dan maksiat, dan lebih mengutamakan kehidupan dunia daripada akhirat, maka sungguh, nerakalah tempat tinggalnya untuk waktu yang sangat lama. Inilah bukti keadilan Allah"
  }
]