[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-41. Sedangkan orang yang takut akan saat dia berdiri menghadap Allah untuk perhitungan amal, dan menahan dirinya dari hawa nafsu yang rusak, Maka tempat tinggalnya adalah surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40-41 Adapun bagi orang yang takut apabila berdiri di hadapan Rabbnya dan menahan nafsunya dari keinginan terhadap apa yang diharamkan oleh Allah, maka Surga adalah tempat tinggal terakhir baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِۦ (Dan adapun orang-orang yang takut kepada kebesaran Tuhannya) Yakni orang-orang yang memperhatikan kedudukannya kelak di hadapan Allah saat hari kiamat. وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ( dan menahan diri dari keinginan hawa nafsunya) Yakni menghalangi hawa nafsunya untuk melakukan kemaksiatan atau hal-hal haram yang ia sukai."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "40-41 1 ) Hatim al-ashom berkata : \"Aku melihat sebagian besar manusia telah menuruti hawa nafsu mereka, dan mereka bergegas mencari apa-apa yang menjadi keinginan nafsu mereka, maka aku mengamati ayat Allah : { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } , dan yakinlah aku bahwasanya al-qur'an adalah sebenar-benarnya perkataan, maka aku bersegera menyalahi keinginan diriku, dan aku menyingsingkan lengan baju untuk berusaha melawan keinginan itu, dan aku juga tidak memberikan kepadanya kepuasan terhadap keinginan syahwatnya, sampai akhirnya dia ridho dengan ketaatan kepada Allah. 2 ) { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Setiap muslim butuh dengan rasa takut kepada Allah, dan menghalangi dirinya dari ketergantungan kepada hawa nafsu, adapun keinginan hawa nafsu dan syahwat tidak dibalas dengan siksaan sampai nafsu syahwat itu dituruti dan dikerjakan, sedangkan jika dirinya berkeinginan kuat dan dia mengalangi dan melarang dirinya untuk melakukan keinginan tersebut, maka larangan itu akan bernilai ibadah disisi Allah, juga bernilai amal shalih, dan { مَقَامَ رَبِّهِ } yakni, berdirinya dia menghadap Allah untuk menerima ganjaran amalannya tersebut. 3 ) { وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Jika kamu mendengarkan di salah satu siaran televisi suatu pembahasan tentang agama, dan di kesempatan lain kamu mendengarkan sebuah nyanyian, kemudian kamu meninggalkan nyanyian itu demi bertahan untuk menyerap lebih banyak manfaat dari pembahasan agama itu, maka pada saat itu kamu memiliki keinginan yang kuat, karena kamu telah melewati jalan yang sulit, kamu telah berusaha untuk mendaki tanjakan yang tinggi, dan mendaki tanjakan adalah sulit, sedangkan menruni penurunan itu mudah. 4 ) { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Apakah kamu mengira bahwasanya seorang muslim yang mampu menundukkan hawa nafsunya, dan senantiasa bermujahadah untuk mensucikan dan mengendalilkan dirinya tidak ada gejolak nafsu dalam dirinya, sungguh tidak, dalam dirinya ia merasakan begitu berat dorongan dari dalam sebagaimana yang dirasakan oleh orang-orang buruk selainnya, bahkan ia dapat merasakan hal yang lebih besar, akan tetapi dia melarang dan menghalangi dirinya karena takut dengan keadaan yang akan terjadi saat ia berdiri menghadap tuhannya, maka dia pun melarang dengan mengendalikan dirinya dari kejamnya hawa nafsu. 5 ) Mahar surga : { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } kepada pemilik hati yang keras, sampai kapan kamu akan terus menjadi hamba bagi nafsumu, kamu yang menyembah dinar dan dirham ? jika kamu terus berbuat demikian, lalu kapan tauhid akan masuk kedalam hatimu dengan sempurna ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40-41. Adapun mereka yang takut kepada Dzat Yang Maha Suci yaitu Allah, dan mempersiapkan bekal hari kiamat. Kemudian mampu menahan hawa nafsu mereka maka tempat tinggal bagi mereka adalah surga. Tidak ada tempat lain yang sesuai selain surga. Neraka adalah tempat bagi orang yang bermaksiat dan surga adalah tempat bagi orang yang taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang-orang yang takut pada kebesaran Tuhannya} kekuasaan yang ada pada Tuhannya {dan menahan diri dari hawa nafsunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 40-41) “Dan adapun orang-orang yang takut kepada kebesaran Rabbnya,” yakni takut berdiri di hadapanNya dan pembalasanNya yang adil, lalu rasa takut ini berpengaruh di hatinya “dan menahan diri dari keinginan hawa nafsunya,” yang menghadangnya dari ketaatan kepada Allah sehingga keinginan hawa nafsunya mengikuti ajaran yang dibawa Rasul, dia menahan hawa nafsu dan keinginan yang menghadang kebaikan, “maka sesungguhnya surgalah,” yang mencangkup segala kebaikan, kesenangan, dan nikmat “tempat tinggal” bagi orang yang sifatnya seperti itu. “(Orang-orang kafir) bertanya kepadamu (Muhammad) tentang Hari Kiamat, kapankah terjadinya. Siapakah kamu (sehingga) dapat menyebutkan (waktunya). Kepada Rabbmulah dikembalikan kesudahannya (ketentuan waktunya). Kamu hanya memberi peringatan bagi siapa yang takut kepadanya (Hari Kiamat). Pada hari mereka melihat hari berabngkit itu, mereka seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi.” (An-Naziat: 42-46)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan barangsiapa yang takut akan berdirinya dihadapan Tuhannya pada hari kiamat, takut kepada Tuhannya ketika didunia dan mempesiapkan diri untuk bertemu Tuhannya pada hari pembalasan, dan menahan dirinya dari gejolak hawa nafsunya yang rusak, ia menahan diri untuk tidak memberikan dirinya apa yang selalu diinginkannya, melainkan ia menahannya demi ketaatan kepada Allah tuhannya. Dan hal yang paling sulit bagi manusia untuk menahannya setelah godaan syaithon adalah hawa nafsunya sendiri, Allah berfirman : { أَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ أَفَأَنْتَ تَكُونُ عَلَيْهِ وَكِيلًا } ( Terangkanlah kepadaku tentang orang yang menjadikan hawa nafsunya sebagai tuhannya. Maka apakah kamu dapat menjadi pemelihara atasnya?, ) [ Al-Furqan : 43 ] yaitu orang yang selalu menuruti keinginan hawa nafsunya, walaupun itu adalah haram."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ \" Dan adapun orang-orang yang takut kepada kebesaran Tuhannya\" Maknanya: Takut berdiri di hadapan-Nya, karena setiap manusia di hari kiamat Allah akan tetapkan dosa-dosanya saat ia berdua dengan-Nya, Allah akan bertanya: Kamu telah berbuat (dosa) demikian? Kamu telah berbuat demikian? Kamu telah berbuat demikian? Sebagaimana disebutkan dalam hadits shahih, jika ia mengakuinya maka Allah akan berkata kepada-Nya: قَدْ سَتَرْتُهَا عَلَيْكَ فِيْ الدُّنْيَا وَأَنَا أَغْفِرُ لَكَ الْيَوْمَ “ Aku telah menutupinya untuk mu di dunia, dan aku ampuni itu semua hari ini ”(1) inilah orang yang takut keadaan itu. وَنَهَى النَّفْسَ عَنِ الْهَوَى \"dan menahan diri dari keinginan hawa nafsunya,\" Dari hawa nafsunya yang menyelisihi perintah Allah dan rasul-Nya, dan jiwa ini memerintahkan kepada keburukan, tidak memerintahkan kecuali kepada kejelekan, namun ada jiwa yang bertolak belakan dengan ini, yaitu jiwa yang muthmainnah (tentram) Manusia memiliki 3 jiwa: Muthmainnah (tentram), Ammarah (memerintahkan kepada keburukan) dan lawwamah (mencela diri -menyesal-) Jiwa Muthmainnah terdapat pada Firman Allah Ta’ala: يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ (27) ارْجِعِي إِلَى رَبِّكِ رَاضِيَةً مَرْضِيَّةً (28) فَادْخُلِي فِي عِبَادِي (29) وَادْخُلِي جَنَّتِي “Hai jiwa yang tenang. Kembalilah kepada Rabbmu dengan hati yang puas lagi diridhai-Nya. Maka masuklah ke dalam jemaah hamba-hamba-Ku, dan masuklah ke dalam surga-Ku.”(al-Fajr: 27-30) Ada pun yang memerintahkan kepada keburukan terdapat pada Firman-Nya: وَمَا أُبَرِّئُ نَفْسِي إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي “Dan aku tidak membebaskan jiwaku (dari kesalahan), karena sesungguhnya jiwa itu selalu menyuruh kepada kejahatan, kecuali jiwa yang diberi rahmat oleh Rabbku.”(QS. Yusuf: 53) Ada pun lawwamah terdapat pada Firman-Nya: “Aku bersumpah dengan hari kiamat, dan aku bersumpah dengan jiwa yang amat menyesali (dirinya sendiri).”(QS.Al-Qiyamah: 1-2) Seorang insan akan merasakan tiga jiwa ini, terkadang dalam jiwanya terdapat dorongan untuk berbuat kebaikan, ia cinta lalu melakukan kebaikan. Ini adalah jiwa yang muthmainnah. Terkadang dalam jiwanya terdapat dorongan melakukan keburukan. Ini adalah jiwa yang memerintahkan kepada keburukan. Kemudian setelah itu datang jiwa yang lawwamah, mencela lalu menyesali apa-apa yang telah ia perbuat berupa kemaksiatan. Atau lawwamah dengan bentuk lain, ia mencela apa-apa yang ia perbuat berupa kebaikan. Ada sebagian orang yang mencela dirinya karena sudah melakukan kebaikan, dan karena berteman dengan orang-orang baik, ia mengatakan: Bagaimana mungkin saya berteman dengan orang-orang yang menghalangiku dari hidupku, syahwatku, kesenanganku dan hal serupa lainnya. Jiwa lawwamah adalah jiwa yang mencela jiwa yang memerintahkan kepada keburukan, bisa juga mencela jiwa yang muthmainnah, jawa ini sebenarnya berada di antara dua jiwa. Mencela jiwa yang sedang memerintahkan kepada keburukan jika telah melakukan keburukan dan mendatangkan penyesalan, dan terkadang mencela jiwa yang tenang jika telah melakukan kebaikan. (1)Dikeluarkan Bukhari (2441) dan Muslim (2768) hadits dari Ibnu Umar radhiyallahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 40: 40-41. Selanjutnya, Allah juga jelaskan bagi siapa yang takut dari mereka (manusia) dari adzab dan siksa-Nya, kemudian mereka berusaha untuk menahan dirinya dari hawa nafsunya yang bekaitan dengan ketaatan kepada Allah; Maka Allah kabarkan bahwa tempat tinggalnya adalah di surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia takut ketika berdiri di hadapan Tuhannya, dimana rasa takut ini berpengaruh dalam hatinya sehingga ia tahan dirinya dari keinginan hawa nafsunya, dan hawa nafsunya menjadi lebih mengikuti apa yang dibawa Rasulullah shallallahu 'alaihi wa sallam serta ia lawan hawa nafsunya yang menghalanginya dari kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 40",
    "description": "40-41. Dan adapun orang-orang yang takut kepada kebesaran tuhannya dengan melakukan amal saleh dan menahan diri dari keinginan hawa nafsunya dengan menaati ajaran agama, maka sungguh, surgalah tempat tinggal-Nya untuk selama-lamanya dengan segala kenikmatan di dalamnya. Itulah anugerah agung tuhan yang maha pemurah"
  }
]