[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-41. Sedangkan orang yang takut akan saat dia berdiri menghadap Allah untuk perhitungan amal, dan menahan dirinya dari hawa nafsu yang rusak, Maka tempat tinggalnya adalah surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40-41 Adapun bagi orang yang takut apabila berdiri di hadapan Rabbnya dan menahan nafsunya dari keinginan terhadap apa yang diharamkan oleh Allah, maka Surga adalah tempat tinggal terakhir baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. فَإِنَّ الْجَنَّةَ هِىَ الْمَأْوَىٰ (maka sesungguhnya surgalah tempat tinggal(nya)) Yakni tempat yang akan menjadi tempat tinggalnya, tidak ada tempat baginya selain surga."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "40-41 1 ) Hatim al-ashom berkata : \"Aku melihat sebagian besar manusia telah menuruti hawa nafsu mereka, dan mereka bergegas mencari apa-apa yang menjadi keinginan nafsu mereka, maka aku mengamati ayat Allah : { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } , dan yakinlah aku bahwasanya al-qur'an adalah sebenar-benarnya perkataan, maka aku bersegera menyalahi keinginan diriku, dan aku menyingsingkan lengan baju untuk berusaha melawan keinginan itu, dan aku juga tidak memberikan kepadanya kepuasan terhadap keinginan syahwatnya, sampai akhirnya dia ridho dengan ketaatan kepada Allah. 2 ) { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Setiap muslim butuh dengan rasa takut kepada Allah, dan menghalangi dirinya dari ketergantungan kepada hawa nafsu, adapun keinginan hawa nafsu dan syahwat tidak dibalas dengan siksaan sampai nafsu syahwat itu dituruti dan dikerjakan, sedangkan jika dirinya berkeinginan kuat dan dia mengalangi dan melarang dirinya untuk melakukan keinginan tersebut, maka larangan itu akan bernilai ibadah disisi Allah, juga bernilai amal shalih, dan { مَقَامَ رَبِّهِ } yakni, berdirinya dia menghadap Allah untuk menerima ganjaran amalannya tersebut. 3 ) { وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Jika kamu mendengarkan di salah satu siaran televisi suatu pembahasan tentang agama, dan di kesempatan lain kamu mendengarkan sebuah nyanyian, kemudian kamu meninggalkan nyanyian itu demi bertahan untuk menyerap lebih banyak manfaat dari pembahasan agama itu, maka pada saat itu kamu memiliki keinginan yang kuat, karena kamu telah melewati jalan yang sulit, kamu telah berusaha untuk mendaki tanjakan yang tinggi, dan mendaki tanjakan adalah sulit, sedangkan menruni penurunan itu mudah. 4 ) { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } Apakah kamu mengira bahwasanya seorang muslim yang mampu menundukkan hawa nafsunya, dan senantiasa bermujahadah untuk mensucikan dan mengendalilkan dirinya tidak ada gejolak nafsu dalam dirinya, sungguh tidak, dalam dirinya ia merasakan begitu berat dorongan dari dalam sebagaimana yang dirasakan oleh orang-orang buruk selainnya, bahkan ia dapat merasakan hal yang lebih besar, akan tetapi dia melarang dan menghalangi dirinya karena takut dengan keadaan yang akan terjadi saat ia berdiri menghadap tuhannya, maka dia pun melarang dengan mengendalikan dirinya dari kejamnya hawa nafsu. 5 ) Mahar surga : { وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ , فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ } kepada pemilik hati yang keras, sampai kapan kamu akan terus menjadi hamba bagi nafsumu, kamu yang menyembah dinar dan dirham ? jika kamu terus berbuat demikian, lalu kapan tauhid akan masuk kedalam hatimu dengan sempurna ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40-41. Adapun mereka yang takut kepada Dzat Yang Maha Suci yaitu Allah, dan mempersiapkan bekal hari kiamat. Kemudian mampu menahan hawa nafsu mereka maka tempat tinggal bagi mereka adalah surga. Tidak ada tempat lain yang sesuai selain surga. Neraka adalah tempat bagi orang yang bermaksiat dan surga adalah tempat bagi orang yang taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya surga adalah tempat tinggal (baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 40-41 “Dan adapun orang-orang yang takut kepada kebesaran Rabbnya,” yakni takut berdiri di hadapanNya dan pembalasanNya yang adil, lalu rasa takut ini berpengaruh di hatinya “dan menahan diri dari keinginan hawa nafsunya,” yang menghadangnya dari ketaatan kepada Allah sehingga keinginan hawa nafsunya mengikuti ajaran yang dibawa Rasul, dia menahan hawa nafsu dan keinginan yang menghadang kebaikan, “maka sesungguhnya surgalah,” yang mencangkup segala kebaikan, kesenangan, dan nikmat “tempat tinggal” bagi orang yang sifatnya seperti itu. “(Orang-orang kafir) bertanya kepadamu (Muhammad) tentang Hari Kiamat, kapankah terjadinya. Siapakah kamu (sehingga) dapat menyebutkan (waktunya). Kepada Rabbmulah dikembalikan kesudahannya (ketentuan waktunya). Kamu hanya memberi peringatan bagi siapa yang takut kepadanya (Hari Kiamat). Pada hari mereka melihat hari berabngkit itu, mereka seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi.” (An-Naziat: 42-46)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka tempat kembali orang-orang yang takut kepada Tuhannya adalah Surga, diisinilah mereka akan tinggal selamanya, adalah tempat yang selalu dimpikan, tempat yang selalu dirindukan, tempat yang tiada kebencian kepadanya, adalah tempat yang tidak diinginkan selainnya, sedangkan mereka yang selalu meuruti hawa nafsu mereka, Nerakalah tempat kembali mereka : dan sudah pasti mereka tidak menginginkan itu, mereka tidak akan pernah menginginkan tinggal ditempat itu, akan tetapi tiada tempat lagi bagi mereka selain Neraka jahannam, dan setiap kali mereka berupaya untuk keluar dari neraka itu mereka dihadang dengan cambuk yang terbuat dari besi panas, dan dikembali lagi ketempatnya, Allah berfirman : { كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ } ( Setiap kali mereka hendak ke luar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan), “Rasailah azab yang membakar ini”. ) [ Al-Haj : 22 ] , maka tiada lagi bagi mereka harapan untuk keluar dari tempat itu, semoga Allah selalu melindungi kita semua. Sedangkan para peghuni surga mereka menikmati dan bersenang-senang didalamnya, mereka kekal didalamnya, mereka tidak hawatir akan dikeluarkan dari tempat itu, mereka tidak takut akan ada yang mengusir mereka dari tempat yang penuh dengan kenikmatan itu, mereka akan tinggal didalam surga selama-lamanya,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَى \" maka sesungguhnya surgalah tempat tinggal (nya). \": Surga adalah negeri kenikmatan yang Allah ‘Azza Wa Jalla siapkan bagi wali-wali-Nya. Di dalamnya terdapat keindahan yang tidak pernah dipandang oleh mata, tidak pernah terdengar telinga, dan tidak perneh terbersit oleh hati manusia, Allah Ta’ala berfirman: فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ “Seorang pun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata”(QS. As-Sajdah: 17) demikianlah dalam al-Quran. Pensifatan surga terdapat pada hadits qudsi: أَعْدَدْتُ لِعِبَادِي الصَّالِحِيْنَ مَا لَا عَيْنَ رَأَتْ، وَلَا أذُنَ سَمِعَتْ، وَلَا خَطَرَ غَلَىَ قَلْبِ بَشَرٍ “ Aku menyiapkan untuk hamba-hamba-Ku yang saleh kenikmatan yang tidak pernah dipandang mata, terdengar telinga dan tidak terlintas di hati manusia”(1) Surga ini akan diperlihatkan kepada manusia sesaat sebelum mati, jika ajalnya telah tiba, Malaikat akan memanggilnya untuk keluar. Malaikat berkata: Keluarlah wahai jiwa yang tenang kepada keridhaan Allah, malaikat itu diberi kabar gembira berupa surga: الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ يَقُولُونَ سَلَامٌ عَلَيْكُمُ “(yaitu) orang-orang yang diwafatkan dalam keadaan baik oleh para malaikat dengan mengatakan (kepada mereka): \"Salaamun'alaikum,”(QS. An-Nahl: 32) Para malaikat akan mengatakannya saat nyawa keluar: “ Keluarlah wahai jiwa yang tenang kepada keridhaan Allah ” ia diberitakan akan masuk surga, maka nyawanya akan keluar dengan kerelaan mudah dan ringan, oleh karenanya ketika Nabi ‘alaihissho;aatu wassalaam memberi kabar: مَنْ أَحَبَّ لِقَاءَ اللهِ أَحَبَ اللهُ لِقَاءَه و مَنْ كَرِهَ لِقَاءَ اللهِ كَرِهَ اللهُ لِقَاءَه “Barang siapa yang cinta bertemu Allah maka Allah akan cinta bertemu dengannya, dan barang siapa yang benci bertemu Allah maka Allah benci bertemu dengannya”(2) Aisyah menanggapi: Ya Rasulullah, kita semua benci kematian, maka beliau menjelaskan bukan seperti yang maksud. Namun yang dimaksud adalah apabila seorang mukmin diberikan kabar surga ketika skaratulmaut, ia akan cinta bertemu Allah, ia akan cinta mati dan akan dimudahkan untuk mati. Sedangkan orang kafir wal-‘iyaadzu billaah dengan yang buruk baginya saat sakaratulmaut, ia akan benci bertemu Allah, jiwanya akan kabur, terceraiberai dalam tubuhnya hingga malaikat menariknya bagai gerigi besi yang ditarik dari kain basah, dan kain basah yang ditarik dari gerigi besi. Istilah ini ma’ruf dikalangan pujangga arab. Hampir-hampir menybeknya karena saking kerasnya. Begitulah nyawa orang kafir wal ‘iyaadzu billaah akan terburai dalam tubuhnya, karena ia dikabarkan azab sehingga ketakutan. Di dalam surga terdapat kenimatan yang belum pernah dipandang mata, belum pernah didengar telinga,dan belum pernah terbersit di hati manusia, seorang insan terkadang telah mendapatkannya sebelum meninggal dari kabar gembira yang ia dapatkan. Anas Bin Nadher Radhiyallahu ‘anhu berkata kepada Sa’ad Bin Muadz: “ Wahai Sa’ad, Demi Allah sungguh aku telah mencium bau surga di balik Uhud ”(3) Ini tidak bermakan mencium yang sekedar perasaan namun ini adalah penciuman hakiki. Ibnul-Qayim rahimahullah mengatakan: Sesungguhnya sebagian manusia terkadang sudah merasakan akhirat sedangkan ia masih di dunia, kemudian ia pergi, berperang lalu iaterbunuh radhiyallaahu ‘anhu. Kasimpulannya: Bahwa disurga terdapat kanikmatan yang belum pernah dipandang mata, didengar telinga dan belum pernah terbersit di hati manusia. (1) Dikeluarkan Bukhari (3244) dan Muslim (2824) dari hadits Abu Hurairah radhiyallaahu 'anhu (2) Dikeluarkan Bukhari (6507) dari hadits Ubadah Bin Shamit radhiyallaahu 'anhu (3) Dikeluarkan Bukhari (4048) dan Muslim (1903) dari Hadits Anas radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 41: 40-41. Selanjutnya, Allah juga jelaskan bagi siapa yang takut dari mereka (manusia) dari adzab dan siksa-Nya, kemudian mereka berusaha untuk menahan dirinya dari hawa nafsunya yang bekaitan dengan ketaatan kepada Allah; Maka Allah kabarkan bahwa tempat tinggalnya adalah di surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang merupakan tempat yang penuh kebaikan, kegembiraan dan kenikmatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 41",
    "description": "40-41. Dan adapun orang-orang yang takut kepada kebesaran tuhannya dengan melakukan amal saleh dan menahan diri dari keinginan hawa nafsunya dengan menaati ajaran agama, maka sungguh, surgalah tempat tinggal-Nya untuk selama-lamanya dengan segala kenikmatan di dalamnya. Itulah anugerah agung tuhan yang maha pemurah. 42. Wahai nabi Muhammad, orang-orang kafir akan mengingkari hari kiamat. Mereka bertanya kepadamu tentang hari kiamat dengan penuh keingkaran, 'kapankah terjadinya''."
  }
]