[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-46. Orang-orang musyrik itu bertanya kepadamu (wahai rasul) dalam rangka mengejekmu, tentang kapan datangnya hari kiamat yang kamu ancamkan kepada mereka. Kamu sama sekali tidak punya ilmu tentangnya, Sebaliknya ilmunya kembali kepada allah semata, Urusanmu terhadap hari kiamat hanya memperingatkan orang orang yang takut kepadanya, Seolah-olah mereka pada hari mereka melihat hari kiamat tidak tinggal di kehidupan dunia,karena ketakutannya yang berat,kecuali antara zhuhur hingga terbenam matahari,atau antara terbit matahari hingga tengah hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Orang-orang yang mendustakan hari Kebangkitan bertanya kepadamu -wahai Rasul-, “Kapan terjadinya Kiamat?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-46. Hai Rasulullah, orang-orang musyrik bertanya kepadamu dengan nada menghina tentang waktu terjadinya hari kiamat: “Kapankah itu akan terjadi?” Ilmu mengenai itu bukan padamu sehingga kamu dapat mengatakannya kepada mereka, namun ilmu mengenai kejadian hari kiamat ada pada Tuhanmu. Tugasmu hanya menyampaikan peringatan bagi orang yang takut hari kiamat, ketika mereka menyaksikannya seakan-akan mereka tidak tinggal di dunia melainkan beberapa saat saja di siang hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. يَسْـَٔلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَىٰهَا ((Orang-orang kafir) bertanya kepadamu (Muhammad) tentang hari kebangkitan, kapankah terjadinya?) Yakni kapankah itu akan datang dan terjadi? Allah menyerupakannya dengan kapal yang datang mendarat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42-43. Orang-orang kafir Makkah bertanya: “Wahai Nabi, kapan kiamat itu terjadi, kapan Allah menetapkan terjadinya?” Pertanyaan mereka pun adalah pertanyaan yang mengejek. Diriwayatkan dari Ibnu Abi Hatim dari Ibnu Abbas bahwa orang musyrik Makkah bertanya-tanya kepada Nabi SAW: “Kapan hari kiamat itu terjadi? (Dengan nada mengejek.)” Maka Allah menurunkan ayat ini. Allah berkata: “Untuk apa kamu memberitahukan waktu kiamat kepada mereka wahai Muhammad? Kamu tidak akan tahu sampai Kami memberitahu mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang hari kiamat, “Kapankah terjadinya} kapan terjadinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 42-44 Maknanya, orang-orang yang membangkang dan mendustakan Hari Kiamat bertanya kepadamu “tentang hari berbangkit kapankah terjadinya,” Allah menjawab dengan firmanNya, “Siapakah kamu (sehingga) dapat menyebutkan (waktunya),” yakni apa gunanya bagimu dan mereka dalam menyebutnya dan mengetahui waktu kedatangannya. Hal itu tidak membawa manfaat. Karena itu, mengingat tahunya manusia akan Hari Kiamat tidak membawa maslahat, baik dunia maupun akhirat, justru maslahatnya adalah dengan disembunyikannya waktu kejadian Hari Kiamat, maka Allah menyembunyikannya hal itu dari semua makhluk, dan hanya Dia sendiri yang tahu seraya berfirman, “Kepada Rabbmu-lah dikembalikan kesudahannya (ketentuan waktunya),” yakni padaNya-lah berakhir pengetahuan tentang Hari Kiamat, seperti disebutkan dalam firman Allah lain, “Mereka menanyakan kepadamu tentang kiamat, ‘Bilakah terjadinya.’ Katakanlah, ‘Sesungguhnya pengetahuan tentang kiamat itu hanyalah pada sisi Rabbku; tidak seorang pun yang dapat menjelaskan waktu kedatangannya selain Dia’.”(Al-A’raf:187)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah dustaan orang-orang musyrikin terbantahkan oleh dali-dalihdan bukti-bukti yang nyata, mereka kemudian bertanya, kapankah kiamat itu akan terjadi ? lagi-lagi mereka bukan mempersiapkan diri untuk menghadapi peristiwa besar itu, akan tetapi mereka bertanya kapan terjadinya ? Apakah ada faedah yang mereka dapatkan ketika mereka mengetahui kapan terjadinya kiamat itu ? yang penting bagi mereka ialah bagaimana mereka mempersiapkan diri untuk menghadapi peristiwa kiamat itu, itulah maslahat bagi mereka yang sebenarnya, dan untuk mengetahui kapan terjadinya itu sama sekali tidak bermanfaat bagi diri mereka, dan hal itu merupakan rahasia Allah dan belum ada yang mengetahuinya selain Dia, baik malaikat maupun Nabi dan Rasul, Tidak ada yang mengetahuinya selain Allah, dan itu demi kemaslhatan bagi hamba seluruhnya, karena yang terpenting bagi kita semua adalah bagaimana kita mempersiapkan diri dengan melakukan amal shalih sebanyak mungkin. Rasulullah ﷺ pun tidak pernah tau kapan akan terjadi kiamat itu, dan Allah belum pernah mewahyukannya tentang itu, juga kepada selain Rasulullah, bahkan Malaikat Jibril yang tugasnya menyampaikan wahyu Allah kepada Rasulullah ﷺ pun Allah belum pernah memberitahukan kepadanya tentang waktu terjadinya kiamat, dan ketika Jibril datang kepada Rasulullah Muhammad ﷺ dan bertanya kepada nya tentang hari terjadinya kiamat, Muhammad kemudian mengatakan : tidaklah orang yang ditanya itu lebih tau dari yang bertanya. Yang ditanya adalah Nani Muhammad, dan yang bertanya adalah Jibril, setiap dari keduanya bahkan tidak mengetahui akan perkara itu, karena Allah merahasiakannya dari siapapun, Allah berfirman : { إِنَّ السَّاعَةَ آتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا تَسْعَىٰ } ( Segungguhnya hari kiamat itu akan datang Aku merahasiakan (waktunya) agar supaya tiap-tiap diri itu dibalas dengan apa yang ia usahakan. ) [ Thaha : 15 ] { يَسْأَلُونَكَ عَنِ السَّاعَةِ } Pertanyaan seperti ini yang kerap ditanyakan oleh orang- prang musyrikin telah berulang kali disebutkan dalam Al-Qur'an, mereka terus bertanya kapan terjadinya kiamat, akan tetapi mereka tidak pernah menanyakan apa yang mesti mereka lakukan untu menghadapi kiamat tersebut, karena tujuan mereka yang sebenarnya adalah untuk mencari kelemahan Muhammad ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا “(Orang-orang kafir) bertanya kepadamu (Muhammad) tentang hari berbangkit, kapankah terjadinya?.” Yakni: Orang-orang bertanya padamu sebagaimana Allah Ta’ala berfirman dalam ayat yang lain: يَسْأَلُكَ النَّاسُ عَنِ السَّاعَةِ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّه “Manusia bertanya kepadamu tentang hari berbangkit. Katakanlah: \"Sesungguhnya pengetahuan tentang hari berbangkit itu hanya di sisi Allah” (QS. Al-Ahzab: 63) مُرْسَاهَا “ Kapan terjadinya?\" Pertanyaan orang-orang tentang harikiamat terbagi menjadi dua: Pertanyaan menganggap kemustahilan dan pengingkaran, ini adalah kekufuran sebagaimana orang-orang musyrik yang bertanya kepada Nabi Shallallaahu ‘alaihi wa sallam tentang hari kiamat, mereka ingin menyegerakannya, Allah Ta’ala telah berfirman tentang mereka: يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَق “Orang-orang yang tidak beriman kepada hari kiamat meminta supaya hari itu segera didatangkan dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa kiamat itu adalah benar (akan terjadi)” (QS. Asy-Syuraa: 18) Dan pertanyaan tentang kapan terjadinya agar menyiapkan untuk menghadapinya, pertanyaan semacam ini tidak mengapa. Ada seorang laki-laki yang bertanya kepada Nabi ‘alaissholaatu wassalaam : Ya Rasulullah kapan kiamat tiba? Rasulullah shallallaahu ‘alaihi wa sallam balik bertanya: مَاذَا اَعْدَدْتَ لَهَا؟ \"Apa yang telah kamu siapkan untuk menghadapinya? Ia menjawab: Cinta kepada Allah dan RasulNya. Maka Nabi bersabda: اَلْمَرْءُ مَعَ مَنْ أَحَبَّ “Seseorang akan bersama yang ia cintai.” (1) Orang-orang bertanya kepad Nabi ‘alaihissolaatu wassalaam,namun tujuan-tujuan mereka berbeda-beda. Apa pun tujuan mereka, apa pun pertanyaan mereka tentang kiamat. Tetaplah ilmu tentang tibanya kiamat hanya Allah yang tahu. (1) Dikeluarkan Bukhari (3688) dan Muslim (2639) dari Hadits Anas radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 42: 42-45. Kemudian Allah tutup firman-Nya dengan gambaran tentang kejadian hari akhir. Ia berkata : Ketahuilah wahai Nabi Allah, bahwasanya orang-orang musyrik lagi pendusta atas hari kebangkitan akan bertanya kepadamu yang sebenarnya adalah ejekan tentang waktu datangnya hari kiamat. Kabarkan kepada mereka bahwasanya urusan kiamat adalah urusan Allah semata. Dan kewajibanmu wahai Nabi Allah pada urusan hari kiamat yaitu takutlah dan beri peringatan bagi siapa saja yang takut akan kedatangannya, dan bagi siapa yang takut (pada saat pertanggung jawaban) di hadapan Allah yang Maha Tinggi (atas amalan mereka)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir berkata: Telah menceritakan kepadaku Ya’qub bin Ibrahim ia berkata: Telah menceritakan kepada kami Sufyan bin ‘Uyaynah dari Az Zuhriy dari Urwah dari Aisyah ia berkata, “Nabi shallallahu 'alaihi wa sallam senantiasa ditanya tentang hari Kiamat (kapan waktunya), sampai Allah ‘Azza wa Jalla menurunkan, “Untuk apa engkau perlu menyebutkan (waktunya)?-- Kepada Tuhanmulah dikembalikan kesudahannya (ketentuan waktunya).” Kata-kata ini mereka ucapkan adalah sebagai ejekan saja, bukan karena mereka percaya akan hari berbangkit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 42",
    "description": "Wahai nabi Muhammad, orang-orang kafir akan mengingkari hari kiamat. Mereka bertanya kepadamu tentang hari kiamat dengan penuh keingkaran, 'kapankah terjadinya''43. Untuk apa engkau perlu menyebutkan waktu-Nya kepada mereka, sedang engkau sendiri tidak mengetahui hal itu'"
  }
]