[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-46. Orang-orang musyrik itu bertanya kepadamu (wahai rasul) dalam rangka mengejekmu, tentang kapan datangnya hari kiamat yang kamu ancamkan kepada mereka. Kamu sama sekali tidak punya ilmu tentangnya, Sebaliknya ilmunya kembali kepada allah semata, Urusanmu terhadap hari kiamat hanya memperingatkan orang orang yang takut kepadanya, Seolah-olah mereka pada hari mereka melihat hari kiamat tidak tinggal di kehidupan dunia,karena ketakutannya yang berat,kecuali antara zhuhur hingga terbenam matahari,atau antara terbit matahari hingga tengah hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Engkau tidak mempunyai pengetahuan tentang hal itu sehingga engkau bisa menyebtukannya kepada mereka. Itu bukan merupakan tugasmu. Sesungguhnya tugasmu adalah bersiap-siap menghadapi datangnya Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. فِيمَ أَنتَ مِن ذِكْرَىٰهَآ (Siapakah kamu (maka) dapat menyebutkan (waktunya)?) Yakni kamu tidak memiliki sedikitpun pengetahuan tentang itu, sebab hanya Allah yang mengetahuinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42-43. Orang-orang kafir Makkah bertanya: “Wahai Nabi, kapan kiamat itu terjadi, kapan Allah menetapkan terjadinya?” Pertanyaan mereka pun adalah pertanyaan yang mengejek. Diriwayatkan dari Ibnu Abi Hatim dari Ibnu Abbas bahwa orang musyrik Makkah bertanya-tanya kepada Nabi SAW: “Kapan hari kiamat itu terjadi? (Dengan nada mengejek.)” Maka Allah menurunkan ayat ini. Allah berkata: “Untuk apa kamu memberitahukan waktu kiamat kepada mereka wahai Muhammad? Kamu tidak akan tahu sampai Kami memberitahu mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Untuk apa kamu perlu menyebutkannya} kamu tidak mengetahuinya sedikitpun kecuali ketika kamu menyebutkannya kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 42-44 Maknanya, orang-orang yang membangkang dan mendustakan Hari Kiamat bertanya kepadamu “tentang hari berbangkit kapankah terjadinya,” Allah menjawab dengan firmanNya, “Siapakah kamu (sehingga) dapat menyebutkan (waktunya),” yakni apa gunanya bagimu dan mereka dalam menyebutnya dan mengetahui waktu kedatangannya. Hal itu tidak membawa manfaat. Karena itu, mengingat tahunya manusia akan Hari Kiamat tidak membawa maslahat, baik dunia maupun akhirat, justru maslahatnya adalah dengan disembunyikannya waktu kejadian Hari Kiamat, maka Allah menyembunyikannya hal itu dari semua makhluk, dan hanya Dia sendiri yang tahu seraya berfirman, “Kepada Rabbmu-lah dikembalikan kesudahannya (ketentuan waktunya),” yakni padaNya-lah berakhir pengetahuan tentang Hari Kiamat, seperti disebutkan dalam firman Allah lain, “Mereka menanyakan kepadamu tentang kiamat, ‘Bilakah terjadinya.’ Katakanlah, ‘Sesungguhnya pengetahuan tentang kiamat itu hanyalah pada sisi Rabbku; tidak seorang pun yang dapat menjelaskan waktu kedatangannya selain Dia’.”(Al-A’raf:187)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( Ketahuilah ) wahai Muhammad kamu tidak mengetahui perkara itu , bagaimana mungkin mereka bertanya kepadamu sedangkan kamu tidak memiliki ilmu tentang hali itu ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah berfirman: فِيمَ أَنْتَ مِنْ ذِكْرَاهَا “Siapakah kamu (sehingga) dapat menyebutkan (waktunya)?” Yakni: Engkau tidak mungkin bisa menyebutkan kapan terjadinya kiamat, karena ilmunya hanya ada di sisi Allah, sebagaimana Allah berfirman: إِنَّمَا عِلْمُهَا عِنْدَ اللَّه “Sesungguhnya pengetahuan tentang hari berbangkit itu hanya di sisi Allah” (QS. AL-Ahzab: 63) Jibril ‘alaihissalaam, malaikat yang paling tahu tentang wahyu, pernah bertanya kepada Nabi shallallaahu ‘alaihi wa sallam, beliau manusia yang paling mengetahui kiamat, jibril bertanya: Beritahulah aku tentang kedatangan hari kiamat. Maka Nabi shallallaahu ‘alaihi wa sallam bersabda: مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ “Tidaklah yang ditanya lebih tahu dari penanya”(1) Maksudnya: Jika kiamat tidak anda ketahui, maka itu pun tidak saya ketahui. Jika yang malaikat yang paling tahu dan manusia yang paling tahu tidak mengetahuinya, maka bagaimana dengan orang yang lebih rendah dari mereka berdua? Dengan demikian, kita tahu bahwa apa-apa yang disebarluaskan sebagian orang bahwa kiamat akan terjadi tahun sekian, tanggal sekian di waktu tertentu,semua itu dusta, tidak ada yang mengetahui kapan kiamat akan terjadi kecuali Allah ‘Azza Wa Jalla. (1) Dikeluarkan Bukhari (50) dan Muslim (9) dari hadits Abu Hurairah radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 43: 42-45. Kemudian Allah tutup firman-Nya dengan gambaran tentang kejadian hari akhir. Ia berkata : Ketahuilah wahai Nabi Allah, bahwasanya orang-orang musyrik lagi pendusta atas hari kebangkitan akan bertanya kepadamu yang sebenarnya adalah ejekan tentang waktu datangnya hari kiamat. Kabarkan kepada mereka bahwasanya urusan kiamat adalah urusan Allah semata. Dan kewajibanmu wahai Nabi Allah pada urusan hari kiamat yaitu takutlah dan beri peringatan bagi siapa saja yang takut akan kedatangannya, dan bagi siapa yang takut (pada saat pertanggung jawaban) di hadapan Allah yang Maha Tinggi (atas amalan mereka)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni engkau tidak memiliki pengetahuan terhadapnya sehingga untuk apa engkau perlu menyebutkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 43",
    "description": "Untuk apa engkau perlu menyebutkan waktu-Nya kepada mereka, sedang engkau sendiri tidak mengetahui hal itu' 44. Hanya kepada tuhanmulah dikembalikan kesudahannya, yakni ketentuan waktunya."
  }
]