[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-46. Orang-orang musyrik itu bertanya kepadamu (wahai rasul) dalam rangka mengejekmu, tentang kapan datangnya hari kiamat yang kamu ancamkan kepada mereka. Kamu sama sekali tidak punya ilmu tentangnya, Sebaliknya ilmunya kembali kepada allah semata, Urusanmu terhadap hari kiamat hanya memperingatkan orang orang yang takut kepadanya, Seolah-olah mereka pada hari mereka melihat hari kiamat tidak tinggal di kehidupan dunia,karena ketakutannya yang berat,kecuali antara zhuhur hingga terbenam matahari,atau antara terbit matahari hingga tengah hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Sesungguhnya engkau hanyalah pemberi peringatan kepada orang yang takut kepada hari Kiamat, karena orang yang takut kepada hari Kiamat lah yang bisa mendapat manfaat dari peringatanmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. إِنَّمَآ أَنتَ مُنذِرُ مَن يَخْشَىٰهَا (Kamu hanyalah pemberi peringatan bagi siapa yang takut kepadanya (hari berbangkit)) Yakni kamu adalah orang yang memperingatkan orang yang takut terhadap hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Peringatanmu terhadap kedatangan hari kiamat akan bermanfaat bagi mereka yang takut terhadap bencana itu, artinya bahwa engkau wahai Muhammad hanya diutus untuk memperingatkan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu hanyalah pemberi peringatan kepada siapa yang takut padanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 45-46 “Kamu hanya memberi peringatan bagi siapa yang takut kepadanya (hari kebangkitan),” yakni ancamanmu hanya berguna bagi orang yang takut akan datangnya Hari Kiamat dan takut berdiri di hadapan Allah. Mereka adalah orang-orang yang perhatiannya tertuju untuk mempersiapkan diri menghadapinya dan beramal untuk menyongsongnya. Adapun orang yang tidak beriman pada Hari Kiamat, ia tidak mempedulikannya karena sikap pembangkangannya berdasarkan kedustaan dan pembangkangan.bila sifatnya sudah seperti ini, maka jawaban atasnya adalah sia-sia Yang Mahasuci Allah lagi Yang Mahabijaksana dari hal itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tugasmu ( wahai Muhammad ) hanyalah sebagai pemberi peringatan kepada siapa yang takut akan kiamat, maka katakanlah kepada mereka : kiamat pasti akan terjadi, maka waspadalah, lalu terkadang diantara manusia ada yang mengatakan : boleh jadi hidupku tidak sampai pada hari kiamata itu terjadi, maka katakanlah kepadanya: sesungguhnya kematianmu itulah kiamat bagimu, karena kiamat juga terbagi menjadi : kiamat massal yang semua makhluk hidup akan musnah, dan kiamat khusus yaitu kematian yang akan di hadapi setiap jiwa yang bernyawa, maka kematian yang dihadapi setiap insan adalah pada hakikatnya merupakan kiamat untuknya. Lalu apakah kamu mengetahui kapan kematian akan menjemputmu ? Allah berfirman : { وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ } ( Dan tiada seorangpun yang dapat mengetahui di bumi mana dia akan mati. ) [ Luqman : 34 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّمَا أَنْتَ مُنْذِرُ مَنْ يَخْشَاهَا “Kamu hanyalah pemberi peringatan bagi siapa yang takut kepadanya (hari berbangkit).” Maknanya: Engkau tidak mempunyai sedikit pun pengetahuan tentang kapan kiamat tiba, namun engkau hanya pemberi peringatan kepada orang-orang yang takut. Mereka itu adalah orang-orang yang beriman. Ada pun orang yang mengingkarinya, menganggapnya mustahil dan mendustakannya, maka peringatanmu tidak akan bermanfaat padanya: وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ “Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman”(QS. Yunus: 101) Oleh karena itu kami katakan: Jangan tanyakan kapan anda akan mati, dimana akan mati, kerena perkara ini tidak perlu ditanyakan, bagaimana pun juga ia pasti datang, walau pun usia anda di dunia ini panjang. Namun itu seperti hanya tersisa satu hari, bahkan sebagaimana Allah ta’ala berfirman di sini"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 45: 42-45. Kemudian Allah tutup firman-Nya dengan gambaran tentang kejadian hari akhir. Ia berkata : Ketahuilah wahai Nabi Allah, bahwasanya orang-orang musyrik lagi pendusta atas hari kebangkitan akan bertanya kepadamu yang sebenarnya adalah ejekan tentang waktu datangnya hari kiamat. Kabarkan kepada mereka bahwasanya urusan kiamat adalah urusan Allah semata. Dan kewajibanmu wahai Nabi Allah pada urusan hari kiamat yaitu takutlah dan beri peringatan bagi siapa saja yang takut akan kedatangannya, dan bagi siapa yang takut (pada saat pertanggung jawaban) di hadapan Allah yang Maha Tinggi (atas amalan mereka)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni peringatanmu hanyalah bermanfaat bagi orang yang takut terhadap kedatangan hari Kiamat dan takut berhadap dengan Tuhannya. Adapun orang yang tidak beriman, maka tidak bermanfaat peringatan itu, bahkan hanya menegakkan hujjah saja atasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 45",
    "description": "Wahai nabi, engkau tidak tahu kapan kiamat akan terjadi. Engkau kami utus hanyalah sebagai pemberi peringatan bagi siapa yang takut kepadanya, lalu beriman dan berbuat baik untuk menghindari azab di akhirat. 46. Hari kiamat itu penuh dengan huru-hara yang membuat manusia sangat tercengang. Pada hari ketika mereka melihat hari kiamat itu, mereka merasa seakan-akan hanya sebentar saja tinggal di dunia, hidup di dunia seakan hanya pada waktu sore atau pagi hari."
  }
]