[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-46. Orang-orang musyrik itu bertanya kepadamu (wahai rasul) dalam rangka mengejekmu, tentang kapan datangnya hari kiamat yang kamu ancamkan kepada mereka. Kamu sama sekali tidak punya ilmu tentangnya, Sebaliknya ilmunya kembali kepada allah semata, Urusanmu terhadap hari kiamat hanya memperingatkan orang orang yang takut kepadanya, Seolah-olah mereka pada hari mereka melihat hari kiamat tidak tinggal di kehidupan dunia,karena ketakutannya yang berat,kecuali antara zhuhur hingga terbenam matahari,atau antara terbit matahari hingga tengah hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Pada Hari ketika mereka melihat Kiamat di depan mata, mereka merasa seakan-akan tidak tinggal di kehidupan dunia mereka kecuali hanya sebatas sore dari suatu hari atau sepaginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوٓا۟ إِلَّا عَشِيَّةً أَوْ ضُحَىٰهَا (Pada hari mereka melihat hari berbangkit itu, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari) Yakni selama beberapa saat di sore atau pagi hari. Atau seperti selama waktu pagi setelah sore itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Hasan al-bashri suatu ketika membaca : { كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا } dia kemudian berkata : wahai anak Adam ! dunia ini tidak lain kecuali seperti waktu pagi dan sore, maka apakah kamu tidak sabar dari kemaksiatan ? 2 ) { كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا } Dilipatlah kehidupan dunia ini yang para penghuninya saling berperang dan membinasakan untuk mendapatkannya, akan tetapi mereka tidak menyadari kalau kehidpan dunia ini hanyalah sebentar, mereka rela mengorbankan akhirat demi meraih segala pernak-pernik dunia, sungguh ini adalah kebodohan yang sangat besar yang tidak akan diperbuat oleh orang-orang yang mendengar dan melihat ! 3 ) Jika kehidupan dunia ini diukur dengan waktu, maka tidaklah ia kecuali waktu yang sagat singkat, lalu bagaimana dengan malam-malam yang sangat singkat itu di dibandingkan dengan usia dunia seleuruhnya ? adapun orang beriman memahami makna ayat ini untuk memperbanyak ketaatan kepada Allah pada waktu yang sangat singkat ini, agar mereka meraih semua kesempatan yang ada, sehingga waktu yang terus berjalan tidak terbuang dengan sia-sia tanpa adanya titik terang untuk mendekatkan diri kepada Allah { وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ } \"dan aku bersegera kepada-Mu. Ya Tuhanku, agar supaya Engkau ridha (kepadaku)”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Ketika orang-orang yang mengingkari hari kiamat kiamat itu mengalami suasana hari kiamat yang hebat mereka merasa seakan hidup mereka di dunia hanya sebentar saja, pagi hari atau sore hari saja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika melihatnya, mereka merasa seakan-akan hanya tinggal pada waktu petang atau paginya} akhir atau permulaan hari."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 45-46 “Kamu hanya memberi peringatan bagi siapa yang takut kepadanya (hari kebangkitan),” yakni ancamanmu hanya berguna bagi orang yang takut akan datangnya Hari Kiamat dan takut berdiri di hadapan Allah. Mereka adalah orang-orang yang perhatiannya tertuju untuk mempersiapkan diri menghadapinya dan beramal untuk menyongsongnya. Adapun orang yang tidak beriman pada Hari Kiamat, ia tidak mempedulikannya karena sikap pembangkangannya berdasarkan kedustaan dan pembangkangan.bila sifatnya sudah seperti ini, maka jawaban atasnya adalah sia-sia Yang Mahasuci Allah lagi Yang Mahabijaksana dari hal itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ العََشِيَّة } Yaitu waktu zuhur sampai sore, ( الضُحَى ) sejak terbitnya fajar sampai waktu dhuha, ketika mereka melihat hari kebangkitan itu telah tiba, mereka merasa seakan-akan mereka tidak perah hidup didunia kecuali sementara, yaitu sejak terbitnya matahari hingga terbenam kembali, mereka melupakan apa yang telah mereka lewati dalam kehidupan dunia, kecuali amalan kebaikan yang akan mereka ingat, sedangkan waktu terlupakan dan terabaikan, dan seketika hidup mereka terasa hanya sesaat saja, Allah berfirman : { وَيَوْمَ يَحْشُرُهُمْ كَأَنْ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنَ النَّهَارِ يَتَعَارَفُونَ بَيْنَهُمْ } ( Dan (ingatlah) akan hari (yang di waktu itu) Allah mengumpulkan mereka, (mereka merasa di hari itu) seakan-akan mereka tidak pernah berdiam (di dunia) hanya sesaat di siang hari, (di waktu itu) mereka saling berkenalan. ) [ Yunus : ] semuanya telah kabarkan kepada kita, agar kita mempersiapkan diri lebih banyak, dan agar kita tidak mengalpakan dan melalaikan akhirat dikarena dunia yang fana ini, itulah Rahmat Allah kepada hambanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا “Pada hari mereka melihat hari berbangkit itu, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari.” Tapi,pertanyaan yang seharusnya terlintas di dalam hati, dan wajib bagi anda mempunyai jawabannya, dalam keadaan apakah anda mati? Yang saya maksud bukan keadaan, kaya atau miskin,kuat atau lemah, punya keturunan atau tidak punya, namun maksudnya adalah dalam keadaan apa anda mati dalam beramal. Jika anda bertanya-tanya pada diri anda dengan pertanyaan ini, tentu anda akan melakukan persiapan, karena anda tidak akan tahu kapan kematian itu akan mengagetkanmu. Betapa banyak manusia yang keluar rumah menyetir mobilnya lalu ia pulang dengan digotong, betapa banyak manusia yang keluar rumah meninggalkan istrinya, mengatakan: Siapkanlah untukku makan siang atau malam, namun ia tidak bisa lagi memakannya, betapa banyak manusia yang mengenakan kemeja dan sarungnya namun yang melepasnya orang yang memandikan jenazahnya, ini adalah perkara yang disaksikan setiap orang berupa kejadian-kejadian mendadak, maka pikirkanlah mulai dari sekarang, dalam keadaan bagaimana anda akan mati. Oleh karenanya sudah selayaknya anda memperbanyak istighfar semampu anda, di dalamnya terdapat pereda rasa gundah, jalan keluar dari himpitan hidup, sampai-sampai sebagian ulama mengatakan: Apa bila engkau diminta untuk berfatwa, maka beristighfarlah sebelum engkau memberikan fatwa, karena dosa-dosa akan menghalangi seseorang dari petunjuk hidayah. Kesimpulan ini diambil dari firman Allah Tabaaraka wa Ta’ala: إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا (105) وَاسْتَغْفِرِ اللَّهَ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا “Sesungguhnya Kami telah menurunkan Kitab kepadamu dengan membawa kebenaran, supaya kamu mengadili antara manusia dengan apa yang telah Allah wahyukan kepadamu, dan janganlah kamu menjadi penantang (orang yang tidak bersalah), karena (membela) orang-orang yang khianat”(QS. An-Nisa: 105-106) Ini adalah kesimpulan yang bagus, mungkin juga mengambil dari firman Allah Ta’ala: وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ “Dan orang-orang yang mendapat petunjuk Allah menambah petunjuk kepada mereka dan memberikan kepada mereka (balasan) ketakwaannya.”(QS. Muhammad: 17) dan Istighfar adalah petunjuk. Maka saya wasiatkan kepada anda untuk senantiasa merasa diawasi, memperbanyak istighfar dan berintropeksi diri, sehingga kita dalam persiapan terbaik khawatir jika kita dikejutkan dengan kematian. Kita memohon kepada Allah agar kita diwafatkan dalam keadaan husnul khatimah. كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا “Pada hari mereka melihat hari berbangkit itu ” Melihat kiamat لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا “, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari.” waktu sore dari mulai tergelincirnya matahari hingga terbenam, waktu pagi dari mulai terbit matahari hingga matahari mulai turun, maksudnya mereka merasa seakan-akan hidup hanya setengah hari. Inilah kenyataannya, kalau kita tanya sekarang, berapa tahun sudah dilalui oleh kita? Apakah kita rasakan sekarang bahwa telah dilalui beberapa tahun ataukah terasa hanya satu hari? Tidak diragukan lagi seolah-olah kita hanya merasakan satu hari saja. Manusia saat ini berada pada tiga hal: Hari yang telah lalu, ini sudah hilang. Hari yang akan datang, tidak tahu apakah akan sampai atau tidak, dan hari yang sedang dijalani, inilah yang akan ditanya. Adapun yang telah berlalu, maka ia telah hilang dan yang telah hilang sungguh telah mati. Telah binasa waktumu yang telah berlalu. Waktu yang akan datang anda tidak tahu apakah akan sampai padanya ataukah tidak. Dan waktu yang sedang dijalani, itulah waktu yang menjadi tanggunganmu. Kita memohon kepada Allah Ta’ala agar memberikan kesudahan yang baik, dan menjadikan akhir kita akhir yang terpuji, penutup kita kebahagiaan, sesungguhnya Dialah Yang Maha Pemberi lagi Maha Mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 46: Kemudian Allah jelaskan bahwa mereka orang-orang kafir ketika melihat hari kiamat, Allah mengingatkan mereka ketika di dunia, dan terasa sebentar (di dunia). Seakan-akan ia (orang-orang musyrik) tidaklah tinggal di dunia melainkan antara waktu dzuhur sampai terbenamnya matahari atau apa yang di antara terbitnya matahari sampai pertengahan siang. (Mereka merasakan demikian) karena sebab apa yang mereka lihat dari kedahsyatan keadaan (hari kiamat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena hebatnya suasana hari berbangkit itu mereka merasa bahwa hidup di dunia hanya sebentar saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 46",
    "description": "Hari kiamat itu penuh dengan huru-hara yang membuat manusia sangat tercengang. Pada hari ketika mereka melihat hari kiamat itu, mereka merasa seakan-akan hanya sebentar saja tinggal di dunia, hidup di dunia seakan hanya pada waktu sore atau pagi hari. 1. Jika bagian akhir surah an-n'zi''t menjelaskan tugas nabi sebagai pemberi peringatan tentang hari kiamat, maka pada permulaan surah 'abasa Allah menyebutkan siapa yang akan mendapatkan manfaat dari peringatan tersebut. Disebutkan bahwa seorang pria buta bernama 'abdull'h bin ummi makt'm, anak paman khad'jah, menghadap nabi untuk meminta petunjuk. Ketika itu nabi tengah berdakwah kepada para pemuka quraisy. Nabi kurang berkenan dengan kedatangannya. Muka nabi menjadi masam. Atas perilaku tersebut Allah menegurnya dengan halus. Teguran ini menunjukkan bahwa Al-Qur'an bukanlah perkataan nabi melainkan kal'mullah. Dengan teguran itu Allah menghendaki agar nabi Muhammad melakukan hal yang lebih utama, yaitu memperhatikan orang yang sungguh-sungguh mencari kebenaran dan berpegang teguh dengan islam. Dia, nabi Muhammad, berwajah masam karena kedatangan ibnu ummi makt'm, dan berpaling darinya untuk melanjutkan pembicaraan dengan pemuka quraisy."
  }
]