[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan para malaikat yang mencabut nyawa orang orang kafir dengan keras, Para malaikat yang mencabut nyawa orang orang beriman dengan semangat dan lembut, Para malaikat yang melayang saat turun dari langit dan naik ke langit, Para malaikat yang berlomba melaksanakan perintah Allah dengan segera, Para malaikat yang melaksankan perintah-perintah tuhan mereka terkait dengan tugas yang mereka emban dalam mengatur alam semesta, dan tidak boleh bagi makhluk untuk bersumpah dengan selain penciptanya,dan barang siapa melakukannya,maka dia berbuat syirik, Makhluk-makhluk pasti dibangkitkan dan dihisab pada hari yang bumi berguncang karena tiupan sangkakala pertama,yaitu tiupan kematian, Yang diikuti dengan tiupan kedua untuk kebangkitan kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Pada hari ketika bumi bergoncang karena tiupan pertama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَوْمَ تَرْجُفُ الرَّاجِفَةُ ((Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama menggoncang alam) Yakni tiupan pertama yang menjadikan seluruh makhluk mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Hari di mana bumi dan gunung bergoncang, pada saat dimatikannya semua makhluk saat tiupan sangkakala pertama. Ar rajifah bermakna bumi ketika bergoncang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{pada hari ketika tiupan pertama mengguncang} Bumi diguncangkan dengan tiupan pertama yang samgat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 6-9) “(Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama mengguncangkan alam,” itulah datangnya hari kiamat, “tiupan pertama itu diiringi oleh tiupan kedua,” yaitu goncangan lain yang mengiringi dan datang berikutnya. “Hati manusia pada waktu itu sangat takut,” yakni takut karena dahsyatnya apa yang dilihat dan didengar. “Pandangan tunduk,” yakni hina dina, karena hati mereka telah dikuasai oleh rasa takut, penyesalan, serta kerugian."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada ayat-ayat yang telah disebutkan yang merupakan bentuk daripada sumpah-sumpah Allah memiliki tujuan dan jawaban dari sumpah-sumpah tersebut , yaitu : Ketika Allah bersumpah dengan peristiwa kebangkitan setelah kematian , timbul pertanyaan di benak setiap yang mendengarkan berita ini, kapan peristiwa itu akan terjadi ? Yaitu { يَوْمَ تَرْجُفُ الرَّاجِفَةُ } pada hari ketika tiupan sangkakala pertama menggoncang alam, ketika Isrofil meniupkan sangkakala yang pertama seketika seluruh makhluk hidup akan mati, kecuali yang Allah kehendaki atasnya, Allah berfirman : { َوَنُفِخَ فِي الصُّوْرِ فَصَعِق } ketika ( sangkakala ) ditiupkan maka binasalah , { مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ } ( siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah ) ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ تَرْجُفُ الرَّاجِفَةُ (6) تَتْبَعُهَا الرَّادِفَةُ “pada hari ketika tiupan pertama menggoncangkan alam, tiupan pertama itu diiringi oleh tiupan kedua.” Kalimat : يَوْمَ تَرْجُفُ “pada hari ketika tiupan pertama” ini terkait dengan suatu kalimat yang disembunyikan yaitu: Ingatlah Muhammad dan peringatkanlah manusia tentang hari besar ini يَوْمَ تَرْجُفُ الرَّاجِفَةُ (6) تَتْبَعُهَا الرَّادِفَةُ “hari ketika tiupan pertama menggoncangkan alam, tiupan pertama itu diiringi oleh tiupan kedua.” Dua tiupan ini ditiupkan ke sangkakala. Tiupan pertama: akan menggocangkan dan mengagetkan manusia kemudian mereka akan mati sampai akhir mereka, kecuali yang Allah kehendaki tetap hidup. Tiupan kedua: Mereka akan dibangkitkan dari kubur-kubur mereka, manusia akan bangkit seluruhnya dalam satu waktu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 6: 6-9. Kemudian Allah menjelaskan bahwa hari kiamat akan datang setelah tiba (hari) dimana bumi diguncang pada saat tiupan (malaikat) pada kali pertama. Yaitu tiupan yang mematikan seluruh makhluk yang ada di bumi. Kemudian di ikuti dengan tiupan yang kedua dimana dibangkitkannya manusia dan dikeluarkan dari kubur-kubur mereka. Dan pada hari itu berguncang hati orang-orang kafir karena sebab ketakutan yang sangat, dan tertunduk mata-mata mereka melihat kengerian atas kejadian hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 6",
    "description": "Sungguh, demi lima macam malaikat itu, kiamat pasti akan terjadi pada hari ketika tiupan pertama mengguncangkan alam, menghancurkan gunung, mengubah lautan menjadi api, dan sebagainya. Setelah tiupan pertama ini semua makhluk hidup akan mati. 7. Tiupan pertama itu diiringi oleh tiupan kedua, di mana manusia bangkit dari kubur untuk mempertanggungjawabkan perbuatan mereka di dunia."
  }
]