[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan para malaikat yang mencabut nyawa orang orang kafir dengan keras, Para malaikat yang mencabut nyawa orang orang beriman dengan semangat dan lembut, Para malaikat yang melayang saat turun dari langit dan naik ke langit, Para malaikat yang berlomba melaksanakan perintah Allah dengan segera, Para malaikat yang melaksankan perintah-perintah tuhan mereka terkait dengan tugas yang mereka emban dalam mengatur alam semesta, dan tidak boleh bagi makhluk untuk bersumpah dengan selain penciptanya,dan barang siapa melakukannya,maka dia berbuat syirik, Makhluk-makhluk pasti dibangkitkan dan dihisab pada hari yang bumi berguncang karena tiupan sangkakala pertama,yaitu tiupan kematian, Yang diikuti dengan tiupan kedua untuk kebangkitan kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Kemudian tiupan pertama ini diikuti dengan tiupan kedua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. تَتْبَعُهَا الرَّادِفَةُ (tiupan pertama itu diiringi oleh tiupan kedua) Yakni tiupan kedua yang membangkitkan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Langit dan bintang ikut bergoncang bersamaan goncangnya bumi. Ar rajifah adalah tiupan pertama, dan ar radifah tiupan kedua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Tiupan) itu diiringi oleh tiupan kedua} dilanjutkan oleh tiupan kedua untuk membangkitkan makhluk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "(Ayat 6-9) “(Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama mengguncangkan alam,” itulah datangnya hari kiamat, “tiupan pertama itu diiringi oleh tiupan kedua,” yaitu goncangan lain yang mengiringi dan datang berikutnya. “Hati manusia pada waktu itu sangat takut,” yakni takut karena dahsyatnya apa yang dilihat dan didengar. “Pandangan tunduk,” yakni hina dina, karena hati mereka telah dikuasai oleh rasa takut, penyesalan, serta kerugian."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian diikuti tiupan sangkakala kedua { الرَّادِفَةُ } dan ketika itu bangkitlah kembali mereka yang telah dimatikan , Allah berfirman dalam ayat lain : { مَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ } ( Kemudian ditiup sangkakala itu sekali lagi maka tiba-tiba mereka berdiri ) yakni mereka bangkit dari kubur mereka, { فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ } mereka berdiri bangkit dari kubur mereka dengan kuasa Allah , dan inilah yang dihindari oleh orang-orang kafir, dan sangatlah mudah bagi Allah untuk melakukan hal ini, Dia memerintahkan Isrofil kemudian meniupkan sangkakala, maka binasalah setiap yang bernyawa dalam waktu yang sangat singkat, kemudia Dia memerintahkannya kembali kemudian ditiuplah yang kedua kalinya, dan seketika kembalilah ruh-ruh ke jasadnya, kemudian mereka bangkit dari kubur sebagaimana mereka diciptakan pertama kali dan mereka menunggu penghakiman dari Allah, sangatlah mudah bagi Allah untuk mewujudkan hal ini, Alla befirman : { مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ ۗ} (Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja ) . Akan tetapi orang orang kafir meragukan hal ini dan menganggap Allah tidak mampu melakukannya, itu karena tiada keimanan dalam diri mereka, dan menyamakan kemampuan Allah dengan kemampuan mereka dikarenakan kebodohan yang ada pada diri mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat pada tafsir surat an-nazi'at ayat 6"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nazi’at ayat 7: 6-9. Kemudian Allah menjelaskan bahwa hari kiamat akan datang setelah tiba (hari) dimana bumi diguncang pada saat tiupan (malaikat) pada kali pertama. Yaitu tiupan yang mematikan seluruh makhluk yang ada di bumi. Kemudian di ikuti dengan tiupan yang kedua dimana dibangkitkannya manusia dan dikeluarkan dari kubur-kubur mereka. Dan pada hari itu berguncang hati orang-orang kafir karena sebab ketakutan yang sangat, dan tertunduk mata-mata mereka melihat kengerian atas kejadian hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jarak antara keduanya 40. Dari Abu Hurairah radhiyallahu 'anhu ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda: مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُونَ قَالَ أَرْبَعُونَ يَوْمًا قَالَ أَبَيْتُ قَالَ أَرْبَعُونَ شَهْرًا قَالَ أَبَيْتُ قَالَ أَرْبَعُونَ سَنَةً قَالَ أَبَيْتُ قَالَ ثُمَّ يُنْزِلُ اللَّهُ مِنْ السَّمَاءِ مَاءً فَيَنْبُتُونَ كَمَا يَنْبُتُ الْبَقْلُ لَيْسَ مِنْ الْإِنْسَانِ شَيْءٌ إِلَّا يَبْلَى إِلَّا عَظْمًا وَاحِدًا وَهُوَ عَجْبُ الذَّنَبِ وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ “Jarak antara kedua tiupan empat puluh.” Abu Hurairah bertanya, “(Apakah) empat puluh hari.” Beliau menjawab, “Aku belum bisa memastikan.” Abu Hurairah bertanya, “(Apakah) empat puluh bulan.” Beliau menjawab, “Aku belum bisa memastikan.” Abu Hurairah bertanya, “(Apakah) empat puluh tahun.” Beliau menjawab, “Aku belum bisa memastikan.” Beliau bersabda, “Kemudian Allah menurunkan air (hujan) dari langit, maka mereka pun tumbuh sebagaimana tumbuhnya tanaman. Tidak ada sesuatu pun dari jasad manusia kecuali telah hancur kecuali satu tulang, yaitu tulang ekornya, dan dari sanalah manusia tersusun kembali pada hari Kiamat.” (HR. Bukhari dan Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nazi’at Ayat 7",
    "description": "Tiupan pertama itu diiringi oleh tiupan kedua, di mana manusia bangkit dari kubur untuk mempertanggungjawabkan perbuatan mereka di dunia. 8. Suasana pada hari itu sangat mencekam. Hati manusia pada waktu itu merasa sangat takut, jantung mereka berdegup kencang karena mereka akan dihadapkan ke pengadilan Allah untuk menunggu putusan Allah kepada mereka."
  }
]